"use strict";
// 2022 개정 정보과 공식 교육과정 corpus.
window.CURRILOOP_CURRICULUM_DATA = {
  "middle-info": {
    "컴퓨팅 시스템": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "하드웨어와 소프트웨어의 유기적 연결을 통해 동작하는 컴퓨팅 시스템은 사회적, 기술적 가치를 높이는 데 활용된다.",
              "easy": [
                "하드웨어",
                "소프트웨어",
                "컴퓨팅 시스템",
                "사회적, 기술적 가치"
              ],
              "normal": [
                "하드웨어와 소프트웨어",
                "유기적 연결",
                "동작하는 컴퓨팅 시스템",
                "사회적, 기술적 가치",
                "높이는 데 활용"
              ],
              "aliases": {},
              "id": "MI-01-CS-KI-01",
              "legacyId": "19een0-vygxwv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g07",
                  "g08",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "컴퓨팅 시스템을 설계하는 것은 시스템에 대한 전체 흐름과 자원 할당의 가치를 이해하는 데 도움을 준다.",
              "easy": [
                "컴퓨팅 시스템",
                "설계하는 것",
                "전체 흐름",
                "자원 할당"
              ],
              "normal": [
                "컴퓨팅 시스템",
                "시스템",
                "설계하는 것",
                "전체 흐름",
                "자원 할당의 가치",
                "이해"
              ],
              "aliases": {},
              "id": "MI-01-CS-KI-02",
              "legacyId": "19een0-7roycg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g05",
                  "g03",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g05",
                  "g03",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "컴퓨팅 시스템의 동작 원리",
              "easy": [
                "컴퓨팅 시스템",
                "동작 원리"
              ],
              "normal": [
                "컴퓨팅 시스템",
                "동작 원리"
              ],
              "aliases": {},
              "id": "MI-01-CS-KN-01",
              "legacyId": "1gji2b-1w2fgs6",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "운영 체제의 기능",
              "easy": [
                "운영 체제",
                "기능"
              ],
              "normal": [
                "운영 체제",
                "기능"
              ],
              "aliases": {},
              "id": "MI-01-CS-KN-02",
              "legacyId": "1gji2b-1q9j2uh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "피지컬 컴퓨팅의 개념",
              "easy": [
                "피지컬 컴퓨팅",
                "개념"
              ],
              "normal": [
                "피지컬 컴퓨팅",
                "개념"
              ],
              "aliases": {},
              "id": "MI-01-CS-KN-03",
              "legacyId": "1gji2b-5do4ag",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "컴퓨팅 시스템의 구성요소를 파악하고, 동작 원리를 운영 체제와 관계짓기",
              "easy": [
                "구성요소",
                "동작 원리",
                "운영 체제"
              ],
              "normal": [
                "컴퓨팅 시스템",
                "구성요소",
                "파악",
                "동작 원리",
                "운영 체제",
                "관계짓기"
              ],
              "aliases": {},
              "id": "MI-01-CS-PF-01",
              "legacyId": "1eyoxrk-rutfsw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "생활 속에서 피지컬 컴퓨팅이 적용된 사례 조사하기",
              "easy": [
                "피지컬 컴퓨팅",
                "적용된 사례 조사하기"
              ],
              "normal": [
                "생활 속에서",
                "피지컬 컴퓨팅",
                "적용된 사례 조사하기",
                "적용된 사례",
                "조사하기"
              ],
              "aliases": {},
              "id": "MI-01-CS-PF-02",
              "legacyId": "1eyoxrk-1rsfcvq",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "c66-36ae0eaa"
                ],
                "normal": [
                  "g04",
                  "g01",
                  "n66-36ae0eaa",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "피지컬 컴퓨팅 시스템 구성하기",
              "easy": [
                "피지컬 컴퓨팅",
                "구성하기"
              ],
              "normal": [
                "피지컬 컴퓨팅",
                "시스템",
                "구성하기"
              ],
              "aliases": {},
              "id": "MI-01-CS-PF-03",
              "legacyId": "1eyoxrk-j4b2dz",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g02"
                ],
                "normal": [
                  "g03",
                  "g04",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "컴퓨팅 시스템의 필요성과 가치를 판단하는 자세",
              "easy": [
                "필요성",
                "가치"
              ],
              "normal": [
                "컴퓨팅 시스템",
                "필요성",
                "가치",
                "판단",
                "자세"
              ],
              "aliases": {},
              "id": "MI-01-CS-VA-01",
              "legacyId": "j8myzy-kx1e51",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "피지컬 컴퓨팅 시스템의 구성요소를 목적에 맞게 선택하는 유연한 태도",
              "easy": [
                "구성요소",
                "목적에 맞게",
                "유연한 태도"
              ],
              "normal": [
                "피지컬 컴퓨팅 시스템",
                "구성요소",
                "목적에 맞게",
                "선택",
                "유연한 태도"
              ],
              "aliases": {},
              "id": "MI-01-CS-VA-02",
              "legacyId": "j8myzy-1ws4h56",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[9정01-01] 컴퓨팅 시스템의 구성요소와 동작 원리를 이해하고 운영 체제의 기능을 분석한다.",
              "easy": [
                "컴퓨팅 시스템",
                "동작 원리",
                "운영 체제",
                "기능"
              ],
              "normal": [
                "컴퓨팅 시스템",
                "구성요소",
                "동작 원리",
                "이해",
                "운영 체제",
                "기능",
                "분석"
              ],
              "aliases": {},
              "id": "MI-01-AC-ST-01",
              "legacyId": "1rmtuks-s02hin",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[9정01-02] 피지컬 컴퓨팅의 개념을 이해하고 생활 속에서 적용된 사례 조사를 통해 컴퓨팅 시스템의 필요성과 가치를 판단한다.",
              "easy": [
                "피지컬 컴퓨팅",
                "적용된 사례 조사",
                "필요성",
                "가치"
              ],
              "normal": [
                "피지컬 컴퓨팅",
                "개념",
                "이해",
                "생활 속에서",
                "적용된 사례 조사",
                "컴퓨팅 시스템",
                "필요성",
                "가치",
                "판단"
              ],
              "aliases": {},
              "id": "MI-01-AC-ST-02",
              "legacyId": "1rmtuks-mv4hyh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g10",
                  "g11",
                  "g12"
                ]
              }
            },
            {
              "text": "[9정01-03] 문제 해결 목적에 맞는 피지컬 컴퓨팅 구성요소를 선택하여 시스템을 구상한다.",
              "easy": [
                "문제 해결 목적",
                "피지컬 컴퓨팅",
                "구성요소",
                "구상"
              ],
              "normal": [
                "문제 해결 목적",
                "맞는",
                "피지컬 컴퓨팅 구성요소",
                "선택",
                "시스템",
                "구상"
              ],
              "aliases": {},
              "id": "MI-01-AC-ST-03",
              "legacyId": "1rmtuks-1gy7wli",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g09",
                  "g10",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ],
                "g02": [
                  "g09",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[9정01-01] 컴퓨팅 시스템은 컴퓨터라는 특정한 기기에서 더욱 큰 범위의 시스템으로 확장되었음을 인식하고 현실 세계에서 볼 수 있는 다양한 컴퓨팅 시스템이 문제를 해결하는 방식을 설명할 수 있어야 한다. 컴퓨팅 시스템이 올바르게 동작하기 위해 운영 체제라는 특수한 형태의 소프트웨어가 필요함을 이해하고, 운영 체제가 컴퓨팅 시스템을 효율적으로 활용하기 위해 수행하는 작업을 설명할 수 있어야 한다.",
              "easy": [
                "컴퓨팅 시스템",
                "확장",
                "운영 체제",
                "소프트웨어"
              ],
              "normal": [
                "컴퓨팅 시스템",
                "특정한 기기",
                "확장",
                "현실 세계",
                "문제를 해결하는 방식",
                "설명",
                "운영 체제",
                "특수한 형태",
                "소프트웨어",
                "효율적으로 활용",
                "수행하는 작업"
              ],
              "aliases": {},
              "id": "MI-01-AC-EX-01",
              "legacyId": "1ykpcgs-itqxgg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g16"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g02",
                  "g08",
                  "g03",
                  "g10",
                  "g04",
                  "g19",
                  "g16",
                  "g09",
                  "g06"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g11",
                  "g12",
                  "g13"
                ],
                "g05": [
                  "g14",
                  "g15",
                  "g16"
                ],
                "g06": [
                  "g17",
                  "g18"
                ]
              },
              "normalSplitMigrations": {
                "g05": [
                  "g19",
                  "g16"
                ]
              },
              "yaho": [
                "특정한 기기에서 더욱 큰 범위의 시스템으로 확장되었음을 인식하고",
                "현실 세계에서 볼 수 있는 다양한 컴퓨팅 시스템이 문제를 해결하는 방식을 설명할 수 있어야 한다",
                "위해 운영 체제라는 특수한 형태의 소프트웨어가 필요함을 이해하고",
                "운영 체제가 컴퓨팅 시스템을 효율적으로 활용하기 위해 수행하는 작업을 설명할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "[9정01-02] 다양한 구성요소가 컴퓨팅 시스템에서 고유한 역할을 담당하고 있음을 이해하고 목적에 맞는 물리적인 장치와 소프트웨어를 결합하여 피지컬 컴퓨팅 시스템을 구현하는 과정을 통해 사회의 다양한 영역에서 피지컬 컴퓨팅 시스템이 유용하게 사용될 수 있음을 판단할 수 있어야 한다.",
              "easy": [
                "구성요소",
                "고유한 역할",
                "물리적인 장치",
                "소프트웨어",
                "피지컬 컴퓨팅",
                "유용하게"
              ],
              "normal": [
                "구성요소",
                "시스템",
                "고유한 역할",
                "목적에 맞는",
                "물리적인 장치",
                "소프트웨어",
                "결합",
                "피지컬 컴퓨팅 시스템",
                "구현",
                "사회",
                "유용하게 사용",
                "판단"
              ],
              "aliases": {},
              "id": "MI-01-AC-EX-02",
              "legacyId": "1ykpcgs-1stle0w",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g12",
                  "g14"
                ],
                "normal": [
                  "g01",
                  "g13",
                  "g02",
                  "g08",
                  "g03",
                  "g04",
                  "g09",
                  "g05",
                  "g06",
                  "g10",
                  "g07",
                  "g11"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g12",
                  "g13"
                ],
                "g07": [
                  "g14",
                  "g15"
                ]
              },
              "yaho": [
                "고유한 역할을 담당하고 있음을 이해하고 목적에 맞는 물리적인 장치와 소프트웨어를 결합하여",
                "피지컬 컴퓨팅 시스템을 구현하는 과정을 통해 사회의 다양한 영역에서",
                "피지컬 컴퓨팅 시스템이 유용하게 사용될 수 있음을 판단할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "실생활에서 관찰할 수 있는 구체적인 컴퓨팅 시스템의 예시를 적극적으로 활용하여 나의 삶과 컴퓨팅 시스템이 괴리되어 있지 않음을 인식하도록 유도하고 컴퓨팅 시스템이 사회에서 담당하는 역할을 탐색하여 사회에 주는 영향력을 진술할 수 있는 구체적인 과제를 제공하는 방식으로 교수·학습을 구성하도록 한다.",
              "easy": [
                "컴퓨팅 시스템",
                "나의 삶",
                "괴리",
                "담당하는 역할",
                "영향력",
                "교수·학습"
              ],
              "normal": [
                "실생활",
                "구체적인 컴퓨팅 시스템",
                "컴퓨팅 시스템",
                "적극적으로 활용",
                "나의 삶",
                "괴리",
                "사회",
                "담당하는 역할",
                "탐색",
                "영향력",
                "진술",
                "구체적인 과제",
                "교수·학습"
              ],
              "aliases": {},
              "id": "MI-01-AC-CO-01",
              "legacyId": "1dahci5-ahz9px",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g11",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g09",
                  "g02",
                  "g10",
                  "g03",
                  "g04",
                  "g05",
                  "g11",
                  "g12",
                  "g07",
                  "g13",
                  "g14",
                  "g08"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g15"
                ]
              },
              "yaho": [
                "구체적인 컴퓨팅 시스템의 예시를 적극적으로 활용하여",
                "나의 삶과 컴퓨팅 시스템이 괴리되어 있지 않음을 인식하도록 유도하고",
                "컴퓨팅 시스템이 사회에서 담당하는 역할을 탐색하여",
                "사회에 주는 영향력을 진술할 수 있는 구체적인 과제를 제공하는 방식으로 교수·학습을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "피지컬 컴퓨팅 시스템을 구현하는 활동은 하드웨어 구성과 소프트웨어 제작을 함께 진행하게 되어 복잡해질 수 있으므로 초등학교 실과에서 학습한 수준의 프로그래밍 활동으로 수행할 수 있도록 미리 구성되어 있는 피지컬 컴퓨팅 시스템을 동작하거나 간단한 피지컬 컴퓨팅 시스템을 구현하는 난이도로 교수·학습을 구성하여 하드웨어와 소프트웨어가 통합적으로 동작함을 인식하는 데 초점을 맞출 수 있도록 한다.",
              "easy": [
                "피지컬 컴퓨팅",
                "구현",
                "하드웨어 구성",
                "소프트웨어 제작",
                "프로그래밍 활동",
                "동작",
                "통합적으로"
              ],
              "normal": [
                "피지컬 컴퓨팅 시스템",
                "구현",
                "하드웨어 구성",
                "소프트웨어 제작",
                "초등학교 실과",
                "프로그래밍 활동",
                "미리 구성되어 있는",
                "동작",
                "간단한",
                "교수·학습",
                "하드웨어와 소프트웨어",
                "통합적으로 동작",
                "초점"
              ],
              "aliases": {},
              "id": "MI-01-AC-CO-02",
              "legacyId": "1dahci5-1x7nb80",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g14",
                  "g06",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g16"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g03",
                  "g09",
                  "g04",
                  "g17",
                  "g05",
                  "g18",
                  "g12",
                  "g13",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15"
                ],
                "g07": [
                  "g16",
                  "g05"
                ]
              },
              "normalSplitMigrations": {
                "g10": [
                  "g17",
                  "g01"
                ],
                "g11": [
                  "g18",
                  "g01"
                ]
              },
              "yaho": [
                "하드웨어 구성과 소프트웨어 제작을 함께 진행하게 되어 복잡해질 수 있으므로",
                "초등학교 실과에서 학습한 수준의 프로그래밍 활동으로 수행할 수 있도록",
                "미리 구성되어 있는 피지컬 컴퓨팅 시스템을 동작하거나 간단한",
                "피지컬 컴퓨팅 시스템을 구현하는 난이도로 교수·학습을 구성하여",
                "하드웨어와 소프트웨어가 통합적으로 동작함을 인식하는 데 초점을 맞출 수 있도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "피지컬 컴퓨팅 시스템을 구현하기 위한 탐구 중심의 활동을 진행하고 프로젝트 형태의 수업을 통해 학생이 피지컬 컴퓨팅 시스템을 구성하는 종합적인 활동 경험을 제공하도록 한다.",
              "easy": [
                "피지컬 컴퓨팅",
                "탐구 중심",
                "프로젝트 형태의 수업",
                "구성"
              ],
              "normal": [
                "피지컬 컴퓨팅 시스템",
                "구현",
                "탐구 중심의 활동",
                "프로젝트 형태의 수업",
                "구성",
                "종합적인 활동 경험",
                "제공"
              ],
              "aliases": {},
              "id": "MI-01-AC-CO-03",
              "legacyId": "1dahci5-le668q",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g09",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g07",
                  "g03",
                  "g04",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g09",
                  "g10"
                ],
                "g03": [
                  "g11",
                  "g12",
                  "g13"
                ],
                "g05": [
                  "g14",
                  "g15",
                  "g16"
                ]
              },
              "yaho": [
                "피지컬 컴퓨팅 시스템을 구현하기 위한 탐구 중심의 활동을 진행하고",
                "프로젝트 형태의 수업을 통해 학생이 피지컬 컴퓨팅 시스템을 구성하는",
                "종합적인 활동 경험을 제공하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "초등학교 수준에서 프로그래밍 학습이 충분히 이루어지지 않은 학생의 경우 피지컬 컴퓨팅 활동을 통해 물리적인 도구를 활용하여 기초적인 프로그래밍 역량을 충분히 함양할 수 있게 활동을 구성하도록 한다.",
              "easy": [
                "프로그래밍 학습",
                "피지컬 컴퓨팅",
                "물리적인 도구",
                "프로그래밍 역량",
                "함양"
              ],
              "normal": [
                "초등학교 수준",
                "프로그래밍 학습",
                "피지컬 컴퓨팅 활동",
                "활동",
                "물리적인 도구",
                "프로그래밍 역량",
                "충분히 함양",
                "구성"
              ],
              "aliases": {},
              "id": "MI-01-AC-CO-04",
              "legacyId": "1dahci5-1q8ujra",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g10",
                  "g03",
                  "g12",
                  "g05"
                ],
                "normal": [
                  "g06",
                  "g01",
                  "g02",
                  "g08",
                  "g03",
                  "g12",
                  "g07",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g10",
                  "g08"
                ],
                "g04": [
                  "g11",
                  "g12"
                ]
              },
              "normalSplitMigrations": {
                "g04": [
                  "g11",
                  "g12"
                ]
              },
              "yaho": [
                "프로그래밍 학습이 충분히 이루어지지 않은 학생의 경우",
                "피지컬 컴퓨팅 활동을 통해 물리적인 도구를 활용하여",
                "기초적인 프로그래밍 역량을 충분히 함양할 수 있게 활동을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        }
      ]
    },
    "데이터": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "데이터를 관리하기 위해서는 아날로그 데이터를 컴퓨터에서 처리할 수 있는 디지털 형태로 변환하는 과정이 필요하다.",
              "easy": [
                "아날로그 데이터",
                "디지털 형태",
                "변환"
              ],
              "normal": [
                "데이터",
                "관리",
                "아날로그 데이터",
                "컴퓨터",
                "처리",
                "디지털 형태",
                "변환",
                "과정",
                "필요"
              ],
              "aliases": {},
              "id": "MI-02-CS-KI-01",
              "legacyId": "19een0-3cziar",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g07",
                  "g04",
                  "g05",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "문제 해결을 위해서는 필요한 데이터를 수집하고 분석하여 의미를 해석하는 것이 필요하다.",
              "easy": [
                "필요한 데이터",
                "수집",
                "분석",
                "의미",
                "해석"
              ],
              "normal": [
                "문제 해결",
                "필요한 데이터",
                "필요",
                "수집",
                "분석",
                "의미",
                "해석"
              ],
              "aliases": {},
              "id": "MI-02-CS-KI-02",
              "legacyId": "19een0-1t4h00n",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g07",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "수집된 데이터 간의 관계를 파악하고 구조화하는 것은 데이터를 통해 새로운 지식을 찾는 데 도움을 준다.",
              "easy": [
                "데이터 간의 관계",
                "구조화",
                "새로운 지식"
              ],
              "normal": [
                "데이터 간의 관계",
                "파악",
                "구조화",
                "새로운 지식",
                "찾는 데 도움"
              ],
              "aliases": {},
              "id": "MI-02-CS-KI-03",
              "legacyId": "19een0-1190mt0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "c66-a759a0c3",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "n66-a759a0c3",
                  "g05",
                  "g03",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "normalSplitMigrations": {
                "g01": [
                  "g11",
                  "g09"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "디지털 데이터 표현 방법",
              "easy": [
                "디지털",
                "데이터",
                "표현 방법"
              ],
              "normal": [
                "디지털",
                "데이터",
                "표현 방법"
              ],
              "aliases": {},
              "id": "MI-02-CS-KN-01",
              "legacyId": "1gji2b-k9o51p",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g02"
                ],
                "normal": [
                  "g03",
                  "g04",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 수집과 관리",
              "easy": [
                "데이터",
                "수집",
                "관리"
              ],
              "normal": [
                "데이터",
                "수집",
                "관리"
              ],
              "aliases": {},
              "id": "MI-02-CS-KN-02",
              "legacyId": "1gji2b-r9s4ja",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 구조화 및 해석",
              "easy": [
                "데이터 구조화",
                "해석"
              ],
              "normal": [
                "데이터 구조화",
                "해석"
              ],
              "aliases": {},
              "id": "MI-02-CS-KN-03",
              "legacyId": "1gji2b-r4sng9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g03"
                ],
                "normal": [
                  "g04",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "다양한 데이터를 디지털 데이터로 표현하기",
              "easy": [
                "디지털 데이터",
                "표현하기"
              ],
              "normal": [
                "데이터",
                "디지털 데이터",
                "디지털",
                "표현하기"
              ],
              "aliases": {},
              "id": "MI-02-CS-PF-01",
              "legacyId": "1eyoxrk-15a31qe",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "c66-f87ac770",
                  "g03"
                ],
                "normal": [
                  "g04",
                  "n66-f87ac770",
                  "g05",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터를 목적에 맞게 수집·분류·저장하기",
              "easy": [
                "목적에 맞게",
                "수집",
                "분류",
                "저장"
              ],
              "normal": [
                "데이터",
                "목적에 맞게",
                "수집",
                "분류",
                "저장"
              ],
              "aliases": {},
              "id": "MI-02-CS-PF-02",
              "legacyId": "1eyoxrk-16gbzt3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터를 구조화하고 의미 해석하기",
              "easy": [
                "구조화",
                "의미 해석하기"
              ],
              "normal": [
                "데이터",
                "구조화",
                "의미 해석하기"
              ],
              "aliases": {},
              "id": "MI-02-CS-PF-03",
              "legacyId": "1eyoxrk-1bw4o1e",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g04",
                  "g05"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "실생활의 많은 데이터가 디지털 형태로 변환되어 활용되는 긍정적 측면의 인식",
              "easy": [
                "디지털 형태",
                "긍정적 측면",
                "인식"
              ],
              "normal": [
                "실생활",
                "많은 데이터",
                "디지털 형태",
                "디지털",
                "형태",
                "변환",
                "활용",
                "긍정적 측면",
                "인식"
              ],
              "aliases": {},
              "id": "MI-02-CS-VA-01",
              "legacyId": "j8myzy-10khr3x",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "c66-961bf15e",
                  "g06",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "n66-961bf15e",
                  "g09",
                  "g10",
                  "g04",
                  "g05",
                  "g06",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터에 기반하여 현상을 바라보는 관점",
              "easy": [
                "데이터에 기반하여",
                "현상",
                "관점"
              ],
              "normal": [
                "데이터에 기반하여",
                "현상",
                "바라보는 관점"
              ],
              "aliases": {},
              "id": "MI-02-CS-VA-02",
              "legacyId": "j8myzy-qnni3q",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g04",
                  "g02",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[9정02-01] 실생활의 데이터가 디지털 형태로 변환되어 활용되는 긍정적 가치를 탐색하고 다양한 데이터를 디지털 형태로 표현한다.",
              "easy": [
                "실생활의 데이터",
                "변환",
                "다양한 데이터",
                "표현"
              ],
              "normal": [
                "실생활의 데이터",
                "디지털 형태",
                "변환",
                "활용",
                "긍정적 가치",
                "탐색",
                "다양한 데이터",
                "표현"
              ],
              "aliases": {},
              "id": "MI-02-AC-ST-01",
              "legacyId": "1rmtuks-15n64fe",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g09",
                  "g10"
                ],
                "g02": [
                  "g11",
                  "g12"
                ],
                "g05": [
                  "g13",
                  "g14"
                ],
                "g07": [
                  "g15",
                  "g10"
                ]
              }
            },
            {
              "text": "[9정02-02] 문제 해결에 적합한 데이터를 수집하고 목적에 맞게 구분하여 관리한다.",
              "easy": [
                "적합한 데이터",
                "목적",
                "구분",
                "관리"
              ],
              "normal": [
                "문제 해결",
                "적합한 데이터",
                "수집",
                "목적에 맞게",
                "구분",
                "관리"
              ],
              "aliases": {},
              "id": "MI-02-AC-ST-02",
              "legacyId": "1rmtuks-zjx059",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g09",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ],
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "[9정02-03] 실생활의 데이터를 표, 다이어그램 등 다양한 형태로 구조화한다.",
              "easy": [
                "표",
                "다이어그램",
                "구조화"
              ],
              "normal": [
                "실생활의 데이터",
                "표",
                "다이어그램",
                "다양한 형태",
                "구조화"
              ],
              "aliases": {},
              "id": "MI-02-AC-ST-03",
              "legacyId": "1rmtuks-16fcbsz",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ],
                "g04": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "[9정02-04] 사례를 중심으로 데이터 간의 관계를 파악하고 데이터에 기반하여 의미를 해석한다.",
              "easy": [
                "데이터 간의 관계",
                "데이터",
                "의미",
                "해석"
              ],
              "normal": [
                "사례",
                "데이터 간의 관계",
                "파악",
                "데이터에 기반하여",
                "의미",
                "해석"
              ],
              "aliases": {},
              "id": "MI-02-AC-ST-04",
              "legacyId": "1rmtuks-7pwpml",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g07",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g08"
                ]
              }
            },
            {
              "text": "[9정02-05] 여러 학문 분야의 사례를 중심으로 데이터를 수집·분석하여 융합적으로 문제를 해결한다.",
              "easy": [
                "학문 분야",
                "데이터",
                "수집·분석",
                "융합적으로"
              ],
              "normal": [
                "여러 학문 분야",
                "사례",
                "데이터",
                "수집·분석",
                "융합적으로",
                "문제를 해결"
              ],
              "aliases": {},
              "id": "MI-02-AC-ST-05",
              "legacyId": "1rmtuks-1yialij",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g08",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ],
                "g06": [
                  "g09",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[9정02-01] 디지털 형태의 데이터가 갖는 특징과 장점을 탐색하고 문자, 이미지, 소리, 동영상 등의 데이터를 컴퓨팅 시스템에서 표현하기 위해 사용하는 기법을 활용하여 실제로 데이터를 디지털 형태로 표현할 수 있어야 한다.",
              "easy": [
                "디지털 형태",
                "특징",
                "장점",
                "문자",
                "이미지",
                "소리",
                "동영상"
              ],
              "normal": [
                "디지털 형태의 데이터",
                "데이터",
                "특징",
                "장점",
                "탐색",
                "문자",
                "이미지",
                "소리",
                "동영상",
                "컴퓨팅 시스템",
                "표현",
                "기법",
                "활용",
                "디지털 형태로 표현"
              ],
              "aliases": {},
              "id": "MI-02-AC-EX-01",
              "legacyId": "1ykpcgs-1sahmld",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g14",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g15",
                  "g02",
                  "g03",
                  "g11",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08",
                  "g12",
                  "g09",
                  "g13",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15"
                ],
                "g10": [
                  "g14",
                  "g12"
                ]
              },
              "yaho": [
                "특징과 장점을 탐색하고 문자, 이미지, 소리",
                "동영상 등의 데이터를 컴퓨팅 시스템에서 표현하기 위해 사용하는 기법을 활용하여",
                "실제로 데이터를 디지털 형태로 표현할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "[9정02-02] 여러 가지 문제 상황을 해결하는 데 활용 가능한 데이터를 다양한 방식으로 수집하고 분류하여 활용도를 높일 수 있어야 한다. 데이터의 종류, 데이터의 의미, 공통점 등 데이터가 가지고 있는 의미나 형식에 따라 데이터를 구분하여 저장하고 활용할 수 있어야 한다.",
              "easy": [
                "문제 상황",
                "분류",
                "데이터의 종류",
                "데이터의 의미",
                "공통점",
                "저장"
              ],
              "normal": [
                "문제 상황",
                "활용 가능한 데이터",
                "활용",
                "데이터",
                "다양한 방식",
                "수집",
                "분류",
                "활용도",
                "데이터의 종류",
                "데이터의 의미",
                "공통점",
                "의미나 형식",
                "구분",
                "저장"
              ],
              "aliases": {},
              "id": "MI-02-AC-EX-02",
              "legacyId": "1ykpcgs-1gqa3x1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04",
                  "g06",
                  "g07",
                  "g08",
                  "g11"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g12",
                  "g16",
                  "g13",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08",
                  "g14",
                  "g10",
                  "g11"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g12",
                  "g15",
                  "g16"
                ],
                "g06": [
                  "g16",
                  "g17"
                ],
                "g07": [
                  "g16",
                  "g18"
                ]
              }
            },
            {
              "text": "[9정02-04] 수집, 관리하는 데이터를 분석하기 용이한 형태로 나타내고 이를 소프트웨어나 프로그래밍으로 분석하여 얻은 결과의 가치를 인식하고 데이터를 기반으로 자신의 주장을 논리적으로 설명할 수 있어야 한다.",
              "easy": [
                "분석하기 용이한 형태",
                "소프트웨어",
                "프로그래밍",
                "결과의 가치",
                "논리적으로 설명"
              ],
              "normal": [
                "수집",
                "관리",
                "데이터",
                "분석하기 용이한 형태",
                "분석",
                "소프트웨어",
                "프로그래밍",
                "결과의 가치",
                "인식",
                "데이터를 기반으로",
                "자신의 주장",
                "논리적으로 설명"
              ],
              "aliases": {},
              "id": "MI-02-AC-EX-03",
              "legacyId": "1ykpcgs-1th85l1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g11",
                  "g05",
                  "g06",
                  "g07",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g11",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g12",
                  "g08",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g07": [
                  "g13",
                  "g14"
                ],
                "g08": [
                  "g03",
                  "g15"
                ],
                "g09": [
                  "g16"
                ],
                "g10": [
                  "g17",
                  "g18"
                ]
              },
              "yaho": [
                "분석하기 용이한 형태로 나타내고 이를 소프트웨어나 프로그래밍으로 분석하여",
                "얻은 결과의 가치를 인식하고 데이터를 기반으로 자신의 주장을 논리적으로 설명할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "실습 환경에 따라 다양한 운영 체제와 파일 시스템을 운용할 수 있으므로 실습 환경에 비교적 독립적인 소프트웨어를 활용하여 디지털 데이터를 탐색하고 저장하여 활용하는 능력이 여러 기기로 전이될 수 있게 교수·학습을 구성하도록 한다.",
              "easy": [
                "실습 환경",
                "운영 체제",
                "파일 시스템",
                "디지털 데이터",
                "여러 기기"
              ],
              "normal": [
                "실습 환경",
                "운영 체제",
                "파일 시스템",
                "비교적 독립적인",
                "소프트웨어",
                "활용",
                "디지털 데이터",
                "탐색",
                "저장",
                "여러 기기",
                "전이",
                "교수·학습"
              ],
              "aliases": {},
              "id": "MI-02-AC-CO-01",
              "legacyId": "1dahci5-2th1dj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g01",
                  "g02",
                  "g05",
                  "g09"
                ],
                "normal": [
                  "g03",
                  "g01",
                  "g02",
                  "g13",
                  "g04",
                  "g08",
                  "g05",
                  "g06",
                  "g07",
                  "g09",
                  "g10",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "normalSplitMigrations": {
                "g11": [
                  "g13",
                  "g04"
                ]
              },
              "yaho": [
                "운영 체제와 파일 시스템을 운용할 수 있으므로 실습 환경에 비교적 독립적인 소프트웨어를 활용하여",
                "디지털 데이터를 탐색하고 저장하여",
                "활용하는 능력이 여러 기기로 전이될 수 있게 교수·학습을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "학생의 수준에 따라 데이터를 다양한 시각적 형태로 나타내는 기초적인 활동부터 스프레드시트 등과 같은 소프트웨어를 활용하여 데이터의 의미를 분석하는 활동까지 단계적으로 교수·학습을 설계하도록 한다.",
              "easy": [
                "다양한 시각적 형태",
                "스프레드시트",
                "소프트웨어",
                "데이터의 의미",
                "단계적으로"
              ],
              "normal": [
                "학생의 수준",
                "데이터",
                "다양한 시각적 형태",
                "기초적인 활동",
                "활동",
                "스프레드시트",
                "소프트웨어",
                "데이터의 의미",
                "분석",
                "단계적으로",
                "교수·학습",
                "설계"
              ],
              "aliases": {},
              "id": "MI-02-AC-CO-02",
              "legacyId": "1dahci5-d4ugyf",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g10",
                  "g05",
                  "g06",
                  "g11",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g10",
                  "g04",
                  "g19",
                  "g05",
                  "g06",
                  "g11",
                  "g08",
                  "g09",
                  "g12",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15"
                ],
                "g03": [
                  "g16",
                  "g17"
                ],
                "g04": [
                  "g18",
                  "g19"
                ]
              },
              "yaho": [
                "다양한 시각적 형태로 나타내는 기초적인 활동부터 스프레드시트 등과 같은 소프트웨어를 활용하여",
                "데이터의 의미를 분석하는 활동까지 단계적으로 교수·학습을 설계하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "학생이 다양한 형태의 데이터를 경험하고 분석할 수 있도록 활동 중심으로 교수·학습을 구성한다. 즉, 데이터 분석 활동의 전 과정이 프로젝트 기반의 문제 해결 활동 혹은 문제기반 학습의 맥락에서 수행되어 데이터를 기반으로 문제를 해결하는 실제적인 경험을 제공하도록 한다.",
              "easy": [
                "다양한 형태의 데이터",
                "활동 중심",
                "데이터 분석",
                "전 과정",
                "프로젝트 기반",
                "문제기반 학습"
              ],
              "normal": [
                "다양한 형태의 데이터",
                "경험",
                "분석",
                "활동 중심",
                "교수·학습",
                "데이터 분석 활동",
                "전 과정",
                "프로젝트 기반",
                "문제 해결 활동",
                "문제기반 학습",
                "맥락",
                "데이터를 기반으로",
                "문제를 해결",
                "실제적인 경험"
              ],
              "aliases": {},
              "id": "MI-02-AC-CO-03",
              "legacyId": "1dahci5-1uzb524",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g17",
                  "g05",
                  "g23",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g09",
                  "g02",
                  "g03",
                  "g10",
                  "g04",
                  "g05",
                  "g23",
                  "g24",
                  "g07",
                  "g11",
                  "g12",
                  "g13",
                  "g08"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15",
                  "g16"
                ],
                "g04": [
                  "g17",
                  "g18"
                ],
                "g06": [
                  "g19",
                  "g20",
                  "g21",
                  "g18"
                ],
                "g08": [
                  "g22",
                  "g09"
                ]
              },
              "normalSplitMigrations": {
                "g06": [
                  "g23",
                  "g24"
                ]
              },
              "yaho": [
                "학생이 다양한 형태의 데이터를 경험하고 분석할 수 있도록 활동 중심으로 교수·학습을 구성한다",
                "즉, 데이터 분석 활동의 전 과정이 프로젝트 기반의 문제 해결 활동 혹은",
                "문제기반 학습의 맥락에서 수행되어 데이터를 기반으로 문제를 해결하는 실제적인 경험을 제공하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01"
                ],
                "y02": [
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        }
      ]
    },
    "알고리즘과 프로그래밍": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "알고리즘은 다양한 설계 전략을 통해 일상생활의 문제를 해결하는 데 활용된다.",
              "easy": [
                "알고리즘",
                "설계 전략"
              ],
              "normal": [
                "알고리즘",
                "다양한 설계 전략",
                "일상생활의 문제",
                "해결",
                "활용"
              ],
              "aliases": {},
              "id": "MI-03-CS-KI-01",
              "legacyId": "19een0-43i7u9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ],
                "g03": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "자동화를 고려해 설계된 알고리즘은 컴퓨터가 이해할 수 있는 언어로 구현되어 생활을 더욱 편리하게 하는 데 활용된다.",
              "easy": [
                "자동화",
                "알고리즘",
                "언어",
                "구현",
                "편리"
              ],
              "normal": [
                "자동화",
                "고려",
                "설계된 알고리즘",
                "컴퓨터",
                "이해할 수 있는 언어",
                "구현",
                "생활",
                "편리",
                "활용"
              ],
              "aliases": {},
              "id": "MI-03-CS-KI-02",
              "legacyId": "19een0-85xtz",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g10",
                  "g13",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g02",
                  "g11",
                  "g14",
                  "g04",
                  "g05",
                  "g06",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g09",
                  "g10"
                ],
                "g03": [
                  "g11",
                  "g12",
                  "g13"
                ]
              },
              "normalSplitMigrations": {
                "g03": [
                  "g11",
                  "g14"
                ]
              }
            },
            {
              "text": "프로그램 개발은 협력이 필요하며, 공유하는 문화를 통해 더 좋은 프로그램이 개발된다.",
              "easy": [
                "프로그램 개발",
                "협력",
                "공유"
              ],
              "normal": [
                "프로그램 개발",
                "개발",
                "협력",
                "필요",
                "공유하는 문화",
                "더 좋은 프로그램"
              ],
              "aliases": {},
              "id": "MI-03-CS-KI-03",
              "legacyId": "19een0-j0mc6e",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g05",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g07",
                  "g08"
                ],
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "문제 추상화",
              "easy": [
                "문제 추상화"
              ],
              "normal": [
                "문제 추상화"
              ],
              "aliases": {},
              "id": "MI-03-CS-KN-01",
              "legacyId": "1gji2b-3e6ui0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "알고리즘 표현 방법",
              "easy": [
                "알고리즘",
                "표현 방법"
              ],
              "normal": [
                "알고리즘",
                "표현 방법"
              ],
              "aliases": {},
              "id": "MI-03-CS-KN-02",
              "legacyId": "1gji2b-s0pkln",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "순차적인 데이터 저장",
              "easy": [
                "순차적인",
                "데이터 저장"
              ],
              "normal": [
                "순차적인 데이터 저장"
              ],
              "aliases": {},
              "id": "MI-03-CS-KN-03",
              "legacyId": "1gji2b-x5hpgj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              }
            },
            {
              "text": "논리 연산",
              "easy": [
                "논리 연산"
              ],
              "normal": [
                "논리 연산"
              ],
              "aliases": {},
              "id": "MI-03-CS-KN-04",
              "legacyId": "1gji2b-ln6ctj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "중첩 제어 구조",
              "easy": [
                "중첩",
                "제어 구조"
              ],
              "normal": [
                "중첩 제어 구조"
              ],
              "aliases": {},
              "id": "MI-03-CS-KN-05",
              "legacyId": "1gji2b-1yn9w63",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              }
            },
            {
              "text": "함수와 디버깅",
              "easy": [
                "함수",
                "디버깅"
              ],
              "normal": [
                "함수",
                "디버깅"
              ],
              "aliases": {},
              "id": "MI-03-CS-KN-06",
              "legacyId": "1gji2b-19zzif4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "문제의 초기 상태, 현재 상태, 목표 상태를 정의하고 해결 가능한 형태로 구조화하기",
              "easy": [
                "초기 상태",
                "현재 상태",
                "목표 상태"
              ],
              "normal": [
                "문제",
                "초기 상태",
                "현재 상태",
                "목표 상태",
                "정의",
                "해결 가능한 형태",
                "구조화하기"
              ],
              "aliases": {},
              "id": "MI-03-CS-PF-01",
              "legacyId": "1eyoxrk-5dbcnw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g07",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g08",
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "문제 해결을 위한 다양한 알고리즘을 설계하고 적용하기",
              "easy": [
                "알고리즘",
                "적용하기"
              ],
              "normal": [
                "문제 해결",
                "다양한 알고리즘",
                "설계",
                "적용하기"
              ],
              "aliases": {},
              "id": "MI-03-CS-PF-02",
              "legacyId": "1eyoxrk-1pkxtp8",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g06",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "논리 연산, 중첩 제어 구조, 순차적인 데이터 저장을 활용하여 프로그램 작성하기",
              "easy": [
                "논리 연산",
                "제어 구조",
                "순차적인 데이터 저장"
              ],
              "normal": [
                "논리 연산",
                "중첩 제어 구조",
                "순차적인 데이터 저장",
                "활용",
                "프로그램 작성하기"
              ],
              "aliases": {},
              "id": "MI-03-CS-PF-03",
              "legacyId": "1eyoxrk-1ekxvoi",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g07",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ],
                "g03": [
                  "g08",
                  "g09"
                ],
                "g05": [
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "함수를 활용하여 프로그램을 모듈화하고, 프로그램의 오류를 발견하여 수정하기",
              "easy": [
                "함수",
                "수정하기"
              ],
              "normal": [
                "함수",
                "프로그램",
                "모듈화",
                "프로그램의 오류",
                "발견",
                "수정하기"
              ],
              "aliases": {},
              "id": "MI-03-CS-PF-04",
              "legacyId": "1eyoxrk-m7vebt",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g02",
                  "g07"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "문제 분석을 통한 추상화의 중요성을 이해하고, 실생활 문제 해결을 실천하는 자세",
              "easy": [
                "문제 분석",
                "추상화",
                "실천"
              ],
              "normal": [
                "문제 분석",
                "추상화",
                "중요성",
                "실생활 문제 해결",
                "실천",
                "자세"
              ],
              "aliases": {},
              "id": "MI-03-CS-VA-01",
              "legacyId": "j8myzy-1lx1exb",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "문제 해결을 위한 다양한 해법을 탐색하고, 명확하게 알고리즘으로 표현하는 자세",
              "easy": [
                "문제 해결",
                "알고리즘"
              ],
              "normal": [
                "문제 해결",
                "다양한 해법",
                "탐색",
                "명확하게",
                "알고리즘",
                "표현",
                "자세"
              ],
              "aliases": {},
              "id": "MI-03-CS-VA-02",
              "legacyId": "j8myzy-19be5vg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "소프트웨어를 통한 협력과 공유의 가치",
              "easy": [
                "소프트웨어",
                "협력"
              ],
              "normal": [
                "소프트웨어",
                "협력",
                "공유",
                "가치"
              ],
              "aliases": {},
              "id": "MI-03-CS-VA-03",
              "legacyId": "j8myzy-c8k7od",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "프로그램의 효과성을 분석하고, 프로그램의 오류를 해결하려는 자세",
              "easy": [
                "효과성",
                "프로그램의 오류"
              ],
              "normal": [
                "프로그램",
                "효과성",
                "분석",
                "프로그램의 오류",
                "해결",
                "자세"
              ],
              "aliases": {},
              "id": "MI-03-CS-VA-04",
              "legacyId": "j8myzy-17pi13z",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[9정03-01] 문제의 상태를 정의하고 수행 가능한 형태로 구조화한다.",
              "easy": [
                "정의",
                "수행 가능한 형태",
                "구조화"
              ],
              "normal": [
                "문제의 상태",
                "정의",
                "수행 가능한 형태",
                "구조화"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-01",
              "legacyId": "1rmtuks-nd0h33",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ],
                "g03": [
                  "g07",
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "[9정03-02] 문제 해결을 위한 추상화의 중요성을 이해하고 핵심요소를 중심으로 알고리즘을 표현한다.",
              "easy": [
                "문제 해결",
                "추상화",
                "핵심요소",
                "알고리즘"
              ],
              "normal": [
                "문제 해결",
                "추상화",
                "중요성",
                "이해",
                "핵심요소",
                "중심으로",
                "알고리즘",
                "표현"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-02",
              "legacyId": "1rmtuks-1d9bqiq",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g07",
                  "g04",
                  "g08",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[9정03-03] 알고리즘의 중요성을 이해하고 문제를 해결하는 다양한 알고리즘을 비교·분석한다.",
              "easy": [
                "알고리즘",
                "다양한 알고리즘",
                "비교·분석"
              ],
              "normal": [
                "알고리즘의 중요성",
                "이해",
                "문제를 해결하는",
                "다양한 알고리즘",
                "비교·분석"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-03",
              "legacyId": "1rmtuks-u7ayrr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g05",
                  "g09",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g10",
                  "g09",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ],
                "g02": [
                  "g07",
                  "g08",
                  "g09"
                ]
              },
              "normalSplitMigrations": {
                "g02": [
                  "g10",
                  "g09"
                ]
              }
            },
            {
              "text": "[9정03-04] 사례를 중심으로 문제 해결에 적합한 전략을 선택하여 알고리즘을 설계한다.",
              "easy": [
                "문제 해결",
                "알고리즘",
                "설계"
              ],
              "normal": [
                "사례",
                "문제 해결",
                "적합한 전략",
                "선택",
                "알고리즘",
                "설계"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-04",
              "legacyId": "1rmtuks-1hh6wos",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "[9정03-05] 데이터를 순차적으로 저장할 수 있는 구조를 활용하여 문제 해결 프로그램을 작성한다.",
              "easy": [
                "순차적으로 저장",
                "프로그램"
              ],
              "normal": [
                "데이터",
                "순차적으로 저장",
                "구조",
                "활용",
                "문제 해결 프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-05",
              "legacyId": "1rmtuks-ma8eoj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g11"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g08",
                  "g09"
                ],
                "g05": [
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "[9정03-06] 논리 연산과 중첩 제어 구조를 활용하여 문제를 해결하는 프로그램을 작성한다.",
              "easy": [
                "논리 연산",
                "중첩 제어 구조",
                "프로그램"
              ],
              "normal": [
                "논리 연산",
                "중첩 제어 구조",
                "활용",
                "문제를 해결하는",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-06",
              "legacyId": "1rmtuks-6efxms",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g11",
                  "g10",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ],
                "g04": [
                  "g08",
                  "g09",
                  "g10"
                ]
              },
              "normalSplitMigrations": {
                "g04": [
                  "g11",
                  "g10"
                ]
              }
            },
            {
              "text": "[9정03-07] 프로그램 작성에서 함수를 활용하고 프로그램 수행 결과를 디버거로 분석하여 오류를 수정한다.",
              "easy": [
                "함수",
                "디버거",
                "오류"
              ],
              "normal": [
                "프로그램 작성",
                "함수",
                "활용",
                "프로그램 수행 결과",
                "디버거",
                "분석",
                "오류",
                "수정"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-07",
              "legacyId": "1rmtuks-g10672",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g05",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g09",
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "[9정03-08] 실생활의 문제를 탐색하여 발견하고 프로그래밍을 통해 해결한다.",
              "easy": [
                "탐색",
                "발견",
                "프로그래밍"
              ],
              "normal": [
                "실생활의 문제",
                "탐색",
                "발견",
                "프로그래밍",
                "해결"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-08",
              "legacyId": "1rmtuks-1lgqo2r",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[9정03-09] 다양한 학문 분야의 문제 해결을 위해 협력하여 소프트웨어를 개발한다.",
              "easy": [
                "학문 분야",
                "협력",
                "소프트웨어"
              ],
              "normal": [
                "다양한 학문 분야",
                "문제 해결",
                "협력",
                "소프트웨어",
                "개발"
              ],
              "aliases": {},
              "id": "MI-03-AC-ST-09",
              "legacyId": "1rmtuks-prrg5o",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g07",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[9정03-03] 문제를 해결하는 알고리즘은 여러 가지 방식으로 나타날 수 있으나 정보 과목에서 추구하는 목표는 문제를 효과적이고 효율적으로 해결하는 알고리즘임을 인식하고, 하나의 문제를 해결하는 여러 알고리즘에 어떠한 장단점이 존재하는지를 비교·분석하여 논리적으로 설명할 수 있어야 한다.",
              "easy": [
                "알고리즘",
                "효과적이고 효율적으로",
                "여러 알고리즘",
                "장단점",
                "비교·분석",
                "논리적으로"
              ],
              "normal": [
                "알고리즘",
                "여러 가지 방식",
                "정보 과목",
                "효과적이고 효율적으로",
                "여러 알고리즘",
                "장단점",
                "비교·분석",
                "논리적으로 설명"
              ],
              "aliases": {},
              "id": "MI-03-AC-EX-01",
              "legacyId": "1ykpcgs-4ykvll",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g10",
                  "g04",
                  "g05",
                  "g06",
                  "g12"
                ],
                "normal": [
                  "g01",
                  "g08",
                  "g09",
                  "g10",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g11",
                  "g01"
                ],
                "g07": [
                  "g12",
                  "g13"
                ]
              },
              "yaho": [
                "여러 가지 방식으로 나타날 수 있으나 정보 과목에서 추구하는 목표는 문제를",
                "효과적이고 효율적으로 해결하는 알고리즘임을 인식하고",
                "하나의 문제를 해결하는 여러 알고리즘에 어떠한 장단점이 존재하는지를 비교·분석하여",
                "논리적으로 설명할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "[9정03-04] 문제를 해결하기 위해 정보 분야에서 활용하는 문제 해결 전략을 이해하고 문제 해결 과정에 적절한 전략을 활용하여 문제를 해결할 수 있어야 한다.",
              "easy": [
                "정보",
                "활용",
                "문제 해결 전략",
                "문제 해결 과정",
                "적절한 전략"
              ],
              "normal": [
                "문제를 해결",
                "정보 분야",
                "활용",
                "문제 해결 전략",
                "이해",
                "문제 해결 과정",
                "적절한 전략"
              ],
              "aliases": {},
              "id": "MI-03-AC-EX-02",
              "legacyId": "1ykpcgs-y5ujeu",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g08",
                  "g05",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g06",
                  "g01",
                  "g05",
                  "g02",
                  "g07",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g08",
                  "g09"
                ],
                "g02": [
                  "g10",
                  "g11"
                ],
                "g03": [
                  "g10",
                  "g12"
                ],
                "g04": [
                  "g13",
                  "g11"
                ],
                "g06": [
                  "g14",
                  "g15"
                ]
              }
            },
            {
              "text": "[9정03-05] 입력된 데이터를 처리하여 결과 데이터를 도출하는 형태로 프로그램이 제작된다는 개념을 이해하고, 배열이나 리스트 등 데이터를 순차적으로 저장할 수 있는 구조를 활용하여 많은 양의 데이터를 효과적으로 처리할 수 있어야 한다.",
              "easy": [
                "처리",
                "배열",
                "리스트",
                "저장",
                "효과적으로"
              ],
              "normal": [
                "입력된 데이터",
                "데이터",
                "처리",
                "결과 데이터",
                "도출",
                "프로그램",
                "배열",
                "리스트",
                "순차적으로",
                "저장할 수 있는 구조",
                "활용",
                "많은 양의 데이터",
                "효과적으로 처리"
              ],
              "aliases": {},
              "id": "MI-03-AC-EX-03",
              "legacyId": "1ykpcgs-ua2az6",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g05",
                  "g06",
                  "g18",
                  "g20"
                ],
                "normal": [
                  "g01",
                  "g15",
                  "g02",
                  "g03",
                  "g11",
                  "g04",
                  "g05",
                  "g06",
                  "g21",
                  "g22",
                  "g13",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15"
                ],
                "g03": [
                  "g16",
                  "g15"
                ],
                "g07": [
                  "g17",
                  "g18"
                ],
                "g09": [
                  "g19",
                  "g15"
                ],
                "g10": [
                  "g20",
                  "g02"
                ]
              },
              "normalSplitMigrations": {
                "g12": [
                  "g21",
                  "g22"
                ]
              },
              "yaho": [
                "결과 데이터를 도출하는 형태로 프로그램이 제작된다는 개념을 이해하고",
                "배열이나 리스트 등 데이터를 순차적으로 저장할 수 있는 구조를 활용하여",
                "많은 양의 데이터를 효과적으로 처리할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "문제를 해결하는 과정에서 문제 발견, 상태 정의, 핵심요소 추출 등의 추상화 단계를 거쳐 알고리즘을 설계하는 과정을 자연스럽게 경험할 수 있도록 교수·학습 절차를 설계하고, 문제 해결 과정 전반을 평가할 수 있도록 보고서나 포트폴리오 등을 활용하여 학생의 사고 과정을 누적하여 기록하도록 한다.",
              "easy": [
                "문제 발견",
                "상태 정의",
                "핵심요소",
                "추상화",
                "단계",
                "사고 과정"
              ],
              "normal": [
                "과정",
                "문제 발견",
                "상태 정의",
                "핵심요소 추출",
                "추상화 단계",
                "알고리즘",
                "설계",
                "자연스럽게 경험",
                "교수·학습 절차",
                "문제 해결 과정 전반",
                "평가",
                "보고서",
                "포트폴리오",
                "사고 과정",
                "누적하여 기록"
              ],
              "aliases": {},
              "id": "MI-03-AC-CO-01",
              "legacyId": "1dahci5-13g55z3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g17",
                  "g19",
                  "g20",
                  "g11"
                ],
                "normal": [
                  "g24",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g14",
                  "g15",
                  "g06",
                  "g07",
                  "g08",
                  "g09",
                  "g10",
                  "g11",
                  "g16"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g17",
                  "g18"
                ],
                "g04": [
                  "g19",
                  "g20"
                ],
                "g06": [
                  "g21",
                  "g22"
                ],
                "g07": [
                  "g23",
                  "g24",
                  "g25"
                ]
              },
              "yaho": [
                "문제 발견, 상태 정의, 핵심요소 추출 등의 추상화 단계를 거쳐 알고리즘을",
                "설계하는 과정을 자연스럽게 경험할 수 있도록 교수·학습 절차를 설계하고",
                "문제 해결 과정 전반을 평가할 수 있도록 보고서나 포트폴리오 등을 활용하여",
                "학생의 사고 과정을 누적하여 기록하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "학생의 수준을 고려하여 적합한 프로그래밍 언어를 선정하고 초등학교 실과 과목에서 학습한 기초적인 프로그래밍 기능을 바탕으로 데이터를 순차적으로 저장하는 구조, 논리 연산, 중첩 제어 구조를 활용할 수 있도록 프로젝트의 수준을 적절하게 설정하도록 한다.",
              "easy": [
                "프로그래밍 언어",
                "초등학교",
                "순차적으로",
                "저장",
                "논리 연산",
                "제어 구조"
              ],
              "normal": [
                "학생의 수준",
                "적합한 프로그래밍 언어",
                "선정",
                "초등학교 실과",
                "프로그래밍 기능",
                "순차적으로",
                "저장하는 구조",
                "논리 연산",
                "중첩 제어 구조",
                "프로젝트의 수준",
                "적절하게 설정"
              ],
              "aliases": {},
              "id": "MI-03-AC-CO-02",
              "legacyId": "1dahci5-1feijc4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g15",
                  "g20",
                  "g21",
                  "g06",
                  "g24"
                ],
                "normal": [
                  "g01",
                  "g10",
                  "g11",
                  "g03",
                  "g25",
                  "g20",
                  "g26",
                  "g06",
                  "g07",
                  "g12",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g09"
                ],
                "g03": [
                  "g15",
                  "g16"
                ],
                "g04": [
                  "g17",
                  "g18",
                  "g19"
                ],
                "g05": [
                  "g20",
                  "g21",
                  "g22"
                ],
                "g07": [
                  "g23",
                  "g24"
                ]
              },
              "normalSplitMigrations": {
                "g04": [
                  "g17",
                  "g25"
                ],
                "g05": [
                  "g20",
                  "g26"
                ]
              },
              "yaho": [
                "적합한 프로그래밍 언어를 선정하고",
                "초등학교 실과 과목에서 학습한 기초적인 프로그래밍 기능을 바탕으로 데이터를",
                "순차적으로 저장하는 구조, 논리 연산",
                "중첩 제어 구조를 활용할 수 있도록 프로젝트의 수준을 적절하게 설정하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "프로젝트 활동에서는 실생활의 문제를 해결하기 위한 알고리즘을 설계하고 이를 적용한 소프트웨어를 개발하는 활동을 중점으로 교수·학습을 설계하도록 한다. 필요에 따라서는 ‘컴퓨팅 시스템’ 영역과 연계하여 피지컬 컴퓨팅 시스템을 설계·제작하고 이를 동작하게 하는 소프트웨어를 결합하는 형태의 프로젝트도 제공할 수 있다.",
              "easy": [
                "프로젝트 활동",
                "알고리즘",
                "소프트웨어",
                "컴퓨팅 시스템",
                "피지컬 컴퓨팅",
                "설계·제작"
              ],
              "normal": [
                "프로젝트 활동",
                "실생활의 문제",
                "알고리즘",
                "설계",
                "적용",
                "소프트웨어",
                "개발",
                "중점",
                "교수·학습",
                "컴퓨팅 시스템",
                "연계",
                "피지컬 컴퓨팅 시스템",
                "설계·제작",
                "동작",
                "결합"
              ],
              "aliases": {},
              "id": "MI-03-AC-CO-03",
              "legacyId": "1dahci5-200ebf",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g06",
                  "g08",
                  "g18",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g12",
                  "g13",
                  "g08",
                  "g14",
                  "g09",
                  "g10",
                  "g15",
                  "g11"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g16",
                  "g17"
                ],
                "g09": [
                  "g18",
                  "g19"
                ]
              }
            },
            {
              "text": "효율적인 알고리즘 설계와 프로그램 작성은 시간, 에너지, 컴퓨팅 시스템 자원을 절약하는 방안임을 학생들이 인식할 수 있도록 안내한다.",
              "easy": [
                "효율적인",
                "알고리즘 설계",
                "프로그램 작성",
                "시간",
                "에너지",
                "컴퓨팅 시스템"
              ],
              "normal": [
                "효율적인 알고리즘 설계",
                "프로그램 작성",
                "시간",
                "에너지",
                "컴퓨팅 시스템 자원",
                "절약하는 방안",
                "인식"
              ],
              "aliases": {},
              "id": "MI-03-AC-CO-04",
              "legacyId": "1dahci5-1wy9n7l",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g09",
                  "g10",
                  "g02",
                  "g03",
                  "g04",
                  "g11"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g09",
                  "g10"
                ],
                "g05": [
                  "g11",
                  "g12"
                ]
              }
            }
          ]
        }
      ]
    },
    "인공지능": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "인공지능 기술로 구현된 에이전트는 외부와의 상호 작용을 통해 기존에 해결할 수 없었던 복잡하고 어려운 문제를 해결하는 데 활용된다.",
              "easy": [
                "인공지능 기술",
                "에이전트",
                "상호 작용",
                "복잡하고 어려운 문제"
              ],
              "normal": [
                "인공지능 기술",
                "구현된 에이전트",
                "외부",
                "상호 작용",
                "해결",
                "복잡하고 어려운 문제",
                "활용"
              ],
              "aliases": {},
              "id": "MI-04-CS-KI-01",
              "legacyId": "19een0-1nu801o",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g03",
                  "g04",
                  "g06",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g09",
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "인공지능은 데이터를 기반으로 문제 해결을 가능하게 하므로 인공지능에 사용되는 데이터는 윤리적 편향성이 없도록 하는 것이 중요하다.",
              "easy": [
                "데이터를 기반으로",
                "사용되는 데이터",
                "윤리적 편향성"
              ],
              "normal": [
                "인공지능",
                "데이터를 기반으로",
                "문제 해결",
                "사용되는 데이터",
                "윤리적 편향성",
                "중요"
              ],
              "aliases": {},
              "id": "MI-04-CS-KI-02",
              "legacyId": "19een0-kej887",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g06",
                  "g11",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g03",
                  "g11",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g01",
                  "g08",
                  "g02"
                ],
                "g05": [
                  "g09",
                  "g10"
                ]
              },
              "normalSplitMigrations": {
                "g04": [
                  "g01",
                  "g11"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "인공지능의 개념과 특성",
              "easy": [
                "인공지능",
                "개념",
                "특성"
              ],
              "normal": [
                "인공지능",
                "개념",
                "특성"
              ],
              "aliases": {},
              "id": "MI-04-CS-KN-01",
              "legacyId": "1gji2b-rbx427",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능 시스템",
              "easy": [
                "인공지능 시스템"
              ],
              "normal": [
                "인공지능 시스템"
              ],
              "aliases": {},
              "id": "MI-04-CS-KN-02",
              "legacyId": "1gji2b-1rab3oh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "인공지능 소프트웨어 구별하기",
              "easy": [
                "인공지능 소프트웨어",
                "구별하기"
              ],
              "normal": [
                "인공지능 소프트웨어",
                "구별하기"
              ],
              "aliases": {},
              "id": "MI-04-CS-PF-01",
              "legacyId": "1eyoxrk-aunhy3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능 학습에 필요한 데이터를 수집하여 활용하기",
              "easy": [
                "인공지능 학습",
                "수집"
              ],
              "normal": [
                "인공지능 학습",
                "필요한 데이터",
                "수집",
                "활용하기"
              ],
              "aliases": {},
              "id": "MI-04-CS-PF-02",
              "legacyId": "1eyoxrk-1i60bdv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "인공지능 시스템을 활용하여 해결할 수 있는 문제 발견하기",
              "easy": [
                "인공지능 시스템",
                "발견하기"
              ],
              "normal": [
                "인공지능 시스템",
                "활용",
                "해결할 수 있는 문제",
                "발견하기"
              ],
              "aliases": {},
              "id": "MI-04-CS-PF-03",
              "legacyId": "1eyoxrk-rf75oy",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "인공지능 시스템을 선택하여 문제 해결하기",
              "easy": [
                "인공지능 시스템",
                "해결하기"
              ],
              "normal": [
                "인공지능 시스템",
                "선택",
                "문제 해결하기"
              ],
              "aliases": {},
              "id": "MI-04-CS-PF-04",
              "legacyId": "1eyoxrk-z1i3ia",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g04",
                  "g05"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "인공지능 시스템에서 적용 가능한 문제를 발견하는 자세",
              "easy": [
                "인공지능 시스템",
                "적용 가능한 문제"
              ],
              "normal": [
                "인공지능 시스템",
                "적용 가능한 문제",
                "발견",
                "자세"
              ],
              "aliases": {},
              "id": "MI-04-CS-VA-01",
              "legacyId": "j8myzy-17cd1ys",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "인공지능 학습에서 데이터로 인한 문제 가능성을 최소화하는 태도",
              "easy": [
                "인공지능 학습",
                "최소화"
              ],
              "normal": [
                "인공지능 학습",
                "데이터",
                "문제 가능성",
                "최소화",
                "태도"
              ],
              "aliases": {},
              "id": "MI-04-CS-VA-02",
              "legacyId": "j8myzy-8tmzi5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[9정04-01] 인공지능의 개념과 특성을 설명하고 인공지능 소프트웨어를 구별한다.",
              "easy": [
                "특성",
                "인공지능 소프트웨어",
                "구별"
              ],
              "normal": [
                "인공지능",
                "개념",
                "특성",
                "설명",
                "인공지능 소프트웨어",
                "구별"
              ],
              "aliases": {},
              "id": "MI-04-AC-ST-01",
              "legacyId": "1rmtuks-c7lkda",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[9정04-02] 인공지능 학습에서 데이터의 중요성을 이해하고 학습에 필요한 데이터를 수집하여 분류한다.",
              "easy": [
                "인공지능 학습",
                "학습에 필요한 데이터",
                "수집",
                "분류"
              ],
              "normal": [
                "인공지능 학습",
                "데이터의 중요성",
                "이해",
                "학습에 필요한 데이터",
                "수집",
                "분류"
              ],
              "aliases": {},
              "id": "MI-04-AC-ST-02",
              "legacyId": "1rmtuks-pu3oyl",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ],
                "g04": [
                  "g09",
                  "g10",
                  "g07"
                ]
              }
            },
            {
              "text": "[9정04-03] 다양한 데이터를 활용하여 인공지능 시스템을 구성하고 적용한다.",
              "easy": [
                "다양한 데이터",
                "인공지능 시스템",
                "구성"
              ],
              "normal": [
                "다양한 데이터",
                "활용",
                "인공지능 시스템",
                "구성",
                "적용"
              ],
              "aliases": {},
              "id": "MI-04-AC-ST-03",
              "legacyId": "1rmtuks-1u4cfe2",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[9정04-04] 인공지능 시스템으로 해결 가능한 문제를 발견하고 문제 해결에 적합한 인공지능 시스템을 적용한다.",
              "easy": [
                "인공지능 시스템",
                "발견",
                "문제 해결",
                "적합한 인공지능 시스템"
              ],
              "normal": [
                "인공지능 시스템",
                "해결 가능한 문제",
                "발견",
                "문제 해결",
                "적합한 인공지능 시스템",
                "적용"
              ],
              "aliases": {},
              "id": "MI-04-AC-ST-04",
              "legacyId": "1rmtuks-rjfa6d",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08",
                  "g09"
                ],
                "g05": [
                  "g10",
                  "g01"
                ]
              }
            },
            {
              "text": "[9정04-05] 인공지능 학습에 필요한 데이터의 수집과 활용에서 발생하는 윤리적인 문제의 해결 방안을 구상한다.",
              "easy": [
                "인공지능 학습",
                "수집",
                "윤리적인",
                "구상"
              ],
              "normal": [
                "인공지능 학습",
                "필요한 데이터",
                "수집",
                "활용",
                "발생하는 윤리적인 문제",
                "해결 방안",
                "구상"
              ],
              "aliases": {},
              "id": "MI-04-AC-ST-05",
              "legacyId": "1rmtuks-os32zx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g11",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g09",
                  "g10"
                ],
                "g05": [
                  "g11",
                  "g12"
                ],
                "g06": [
                  "g13",
                  "g14"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[9정04-01] 인공지능의 기초적인 개념을 이해하고 모델, 학습, 데이터 등 인공지능 시스템이 구성되는 원리와 문제를 해결하는 과정에 대해 설명할 수 있어야 한다. 이러한 이해를 기반으로 소프트웨어가 문제를 해결할 때 인공지능 시스템을 사용하는 부분을 구체적인 방식으로 설명할 수 있어야 한다.",
              "easy": [
                "기초적인 개념",
                "모델",
                "학습",
                "데이터",
                "인공지능 시스템",
                "소프트웨어"
              ],
              "normal": [
                "기초적인 개념",
                "모델",
                "학습",
                "데이터",
                "인공지능 시스템",
                "구성되는 원리",
                "문제를 해결하는 과정",
                "문제를 해결",
                "설명",
                "이러한 이해",
                "소프트웨어",
                "사용하는 부분",
                "구체적인 방식"
              ],
              "aliases": {},
              "id": "MI-04-AC-EX-01",
              "legacyId": "1ykpcgs-1kc8mpx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g12",
                  "g10",
                  "g11",
                  "g08",
                  "g09",
                  "g13"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15"
                ],
                "g06": [
                  "g16",
                  "g17"
                ],
                "g07": [
                  "g18",
                  "g19",
                  "g20"
                ],
                "g09": [
                  "g21",
                  "g22"
                ]
              }
            },
            {
              "text": "[9정04-03] 이미지, 소리, 글자 등의 데이터를 활용하여 인공지능 시스템을 학습시키고 학습한 시스템을 활용하여 문제를 해결하는 과정을 수행할 수 있어야 한다.",
              "easy": [
                "이미지",
                "소리",
                "글자",
                "인공지능 시스템",
                "학습한 시스템"
              ],
              "normal": [
                "이미지",
                "소리",
                "글자",
                "데이터",
                "활용",
                "인공지능 시스템",
                "학습시키고",
                "학습한 시스템",
                "문제를 해결하는 과정",
                "수행"
              ],
              "aliases": {},
              "id": "MI-04-AC-EX-02",
              "legacyId": "1ykpcgs-684ikg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g09",
                  "g10",
                  "g08",
                  "g11"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g08": [
                  "g12",
                  "g13",
                  "g14"
                ]
              }
            },
            {
              "text": "[9정04-05] 인공지능 학습에 필요한 데이터의 수집과 활용에서 나타날 수 있는 여러 가지 현실적인 문제들에 대해 법적, 사회적, 윤리적으로 타당성을 가지는 해결 방안을 제시할 수 있어야 한다. 하나의 문제를 바라보는 여러 측면에 대해 고려하고 각각의 해결 방안이 가지는 장단점을 정리한 후 결론을 도출하는 과정을 경험하면서 인공지능의 사회적 역할과 가치를 판단할 수 있어야 한다.",
              "easy": [
                "인공지능 학습",
                "수집",
                "현실적인",
                "법적",
                "사회적",
                "윤리적",
                "타당성"
              ],
              "normal": [
                "인공지능 학습",
                "데이터",
                "수집",
                "활용",
                "현실적인 문제",
                "법적",
                "사회적",
                "윤리적으로",
                "타당성",
                "해결 방안",
                "제시",
                "하나의 문제",
                "여러 측면",
                "각각의 해결 방안",
                "장단점",
                "결론",
                "도출",
                "인공지능의 사회적 역할",
                "가치",
                "판단"
              ],
              "aliases": {},
              "id": "MI-04-AC-EX-03",
              "legacyId": "1ykpcgs-1ptpxvl",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g23",
                  "g06",
                  "g07",
                  "g08",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g17",
                  "g09",
                  "g10",
                  "g18",
                  "g19",
                  "g11",
                  "g20",
                  "g12",
                  "g13",
                  "g21",
                  "g22",
                  "g15",
                  "g16"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05",
                  "y66-06"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g23",
                  "g24"
                ],
                "g10": [
                  "g25",
                  "g26"
                ],
                "g11": [
                  "g27",
                  "g28"
                ],
                "g14": [
                  "g07",
                  "g29"
                ]
              },
              "yaho": [
                "인공지능 학습에 필요한 데이터의 수집과 활용에서 나타날 수 있는 여러 가지",
                "현실적인 문제들에 대해 법적, 사회적",
                "윤리적으로 타당성을 가지는 해결 방안을 제시할 수 있어야 한다",
                "하나의 문제를 바라보는 여러 측면에 대해 고려하고",
                "각각의 해결 방안이 가지는 장단점을 정리한 후 결론을 도출하는 과정을",
                "경험하면서 인공지능의 사회적 역할과 가치를 판단할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05",
                  "y66-06"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "인공지능 시스템 적용 시 학생이 익숙하게 활용할 수 있는 프로그래밍 언어를 사용하여 학습에 인지적 부하가 적은 형태로 교수·학습 활동을 구성하도록 한다.",
              "easy": [
                "인공지능 시스템",
                "프로그래밍 언어",
                "인지적",
                "부하",
                "교수·학습 활동"
              ],
              "normal": [
                "인공지능 시스템",
                "적용",
                "익숙하게 활용",
                "프로그래밍 언어",
                "학습",
                "인지적 부하",
                "적은 형태",
                "교수·학습 활동",
                "구성"
              ],
              "aliases": {},
              "id": "MI-04-AC-CO-01",
              "legacyId": "1dahci5-7wcgor",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g10",
                  "g11",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g07",
                  "g02",
                  "g08",
                  "g03",
                  "g09",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g10",
                  "g11"
                ],
                "g04": [
                  "g12",
                  "g13"
                ]
              }
            },
            {
              "text": "인공지능 윤리는 개인의 성향이나 문제에 대한 관점에 따라 서로 다른 주장을 펼칠 수 있다. 학생의 개별적인 의견을 최대한 존중하고 근거를 가지고 논리적으로 자신의 의견을 주장할 수 있도록 활동을 구성하도록 한다.",
              "easy": [
                "인공지능 윤리",
                "개인",
                "성향",
                "개별적인",
                "논리적으로"
              ],
              "normal": [
                "인공지능 윤리",
                "개인의 성향",
                "문제에 대한 관점",
                "서로 다른 주장",
                "주장",
                "개별적인 의견",
                "최대한 존중",
                "근거",
                "논리적으로",
                "자신의 의견",
                "활동",
                "구성"
              ],
              "aliases": {},
              "id": "MI-04-AC-CO-02",
              "legacyId": "1dahci5-1654eq4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g15",
                  "g16",
                  "g18",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g10",
                  "g04",
                  "g13",
                  "g05",
                  "g11",
                  "g07",
                  "g08",
                  "g12",
                  "g09",
                  "g14"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g15",
                  "g16"
                ],
                "g04": [
                  "g17",
                  "g13"
                ],
                "g05": [
                  "g18",
                  "g19"
                ]
              }
            },
            {
              "text": "인공지능과 관련된 여러 사례를 경험하게 하고 활동을 통해 학습자의 인공지능에 대한 깊이 있는 이해가 내면화될 수 있도록 교수·학습을 구성한다.",
              "easy": [
                "인공지능",
                "학습자",
                "깊이 있는 이해",
                "내면화",
                "교수·학습"
              ],
              "normal": [
                "인공지능",
                "여러 사례",
                "경험",
                "활동",
                "학습자",
                "깊이 있는 이해",
                "내면화",
                "교수·학습",
                "구성"
              ],
              "aliases": {},
              "id": "MI-04-AC-CO-03",
              "legacyId": "1dahci5-7m7t57",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g08",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g10",
                  "g11"
                ],
                "g05": [
                  "g12",
                  "g13"
                ]
              }
            }
          ]
        }
      ]
    },
    "디지털 문화": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "디지털 기술의 발전에 따라 디지털 사회에서 지켜야 할 규칙과 주의해야 할 위험 요소가 새롭게 등장한다.",
              "easy": [
                "디지털 기술",
                "디지털 사회",
                "지켜야 할 규칙",
                "주의해야 할 위험 요소"
              ],
              "normal": [
                "디지털 기술",
                "발전",
                "디지털 사회",
                "지켜야 할 규칙",
                "주의해야 할 위험 요소",
                "새롭게 등장"
              ],
              "aliases": {},
              "id": "MI-05-CS-KI-01",
              "legacyId": "19een0-ts9pdr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g08",
                  "g09"
                ],
                "g05": [
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "디지털 세상에서의 직업이나 진로는 기술의 발전에 따라 변화되므로 기술과 사회 변화의 관계를 파악하는 것이 중요하다.",
              "easy": [
                "디지털 세상",
                "기술의 발전",
                "사회 변화",
                "관계"
              ],
              "normal": [
                "디지털 세상",
                "직업",
                "진로",
                "기술의 발전",
                "기술",
                "변화",
                "사회 변화",
                "관계",
                "파악",
                "중요"
              ],
              "aliases": {},
              "id": "MI-05-CS-KI-02",
              "legacyId": "19een0-cs3dgr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g09",
                  "g08",
                  "g05",
                  "g06",
                  "g07",
                  "g10"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g09",
                  "g11"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "디지털 사회와 직업",
              "easy": [
                "디지털 사회",
                "직업"
              ],
              "normal": [
                "디지털 사회",
                "직업"
              ],
              "aliases": {},
              "id": "MI-05-CS-KN-01",
              "legacyId": "1gji2b-ifr0z3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "디지털 윤리",
              "easy": [
                "디지털 윤리"
              ],
              "normal": [
                "디지털 윤리"
              ],
              "aliases": {},
              "id": "MI-05-CS-KN-02",
              "legacyId": "1gji2b-12iwp41",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "개인 정보와 저작권",
              "easy": [
                "개인 정보",
                "저작권"
              ],
              "normal": [
                "개인 정보",
                "저작권"
              ],
              "aliases": {},
              "id": "MI-05-CS-KN-03",
              "legacyId": "1gji2b-16f8bib",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "디지털 사회의 특성에 따른 직업의 변화 탐구하기",
              "easy": [
                "직업",
                "탐구하기"
              ],
              "normal": [
                "디지털 사회",
                "특성",
                "직업의 변화",
                "탐구하기"
              ],
              "aliases": {},
              "id": "MI-05-CS-PF-01",
              "legacyId": "1eyoxrk-1mp07x",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g05",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "디지털 공간에서 지켜야 하는 윤리 토론하기",
              "easy": [
                "디지털 공간",
                "토론하기"
              ],
              "normal": [
                "디지털 공간",
                "지켜야 하는 윤리",
                "토론하기"
              ],
              "aliases": {},
              "id": "MI-05-CS-PF-02",
              "legacyId": "1eyoxrk-1l3jvm0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g05"
                ]
              }
            },
            {
              "text": "디지털 공간에서 나와 다른 사람을 보호하는 방법 탐구하기",
              "easy": [
                "디지털 공간",
                "탐구하기"
              ],
              "normal": [
                "디지털 공간",
                "나와 다른 사람",
                "보호하는 방법",
                "탐구하기"
              ],
              "aliases": {},
              "id": "MI-05-CS-PF-03",
              "legacyId": "1eyoxrk-125r2zi",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ],
                "g03": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "디지털 사회로의 변화가 나의 삶과 진로 결정에 미치는 영향력을 탐색하는 자세",
              "easy": [
                "디지털 사회",
                "진로 결정"
              ],
              "normal": [
                "디지털 사회",
                "변화",
                "나의 삶",
                "진로 결정",
                "미치는 영향력",
                "탐색",
                "자세"
              ],
              "aliases": {},
              "id": "MI-05-CS-VA-01",
              "legacyId": "j8myzy-h7acvi",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g07",
                  "g06",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g09"
                ]
              }
            },
            {
              "text": "디지털 공간에서 함께 살아가기 위한 윤리적인 태도",
              "easy": [
                "디지털 공간",
                "윤리적인"
              ],
              "normal": [
                "디지털 공간",
                "함께 살아가기",
                "윤리적인 태도"
              ],
              "aliases": {},
              "id": "MI-05-CS-VA-02",
              "legacyId": "j8myzy-1rbvp5r",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g05"
                ],
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[9정05-01] 디지털 사회의 특성을 탐구하고 사회 변화에 따른 직업의 변화를 탐구한다.",
              "easy": [
                "디지털 사회",
                "사회 변화",
                "직업의 변화를 탐구"
              ],
              "normal": [
                "디지털 사회",
                "특성을 탐구",
                "사회 변화",
                "따른",
                "직업의 변화를 탐구"
              ],
              "aliases": {},
              "id": "MI-05-AC-ST-01",
              "legacyId": "1rmtuks-1nnq0xm",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ],
                "g04": [
                  "g08",
                  "g09",
                  "g07"
                ]
              }
            },
            {
              "text": "[9정05-02] 디지털 사회의 구성원으로서 편리하고 안전한 생활을 위한 규칙에 대해 민주적으로 논의하고 실천 방안을 수립한다.",
              "easy": [
                "디지털 사회",
                "구성원",
                "민주적으로",
                "실천 방안"
              ],
              "normal": [
                "디지털 사회",
                "구성원",
                "편리하고 안전한 생활",
                "규칙",
                "민주적으로",
                "논의",
                "실천 방안",
                "수립"
              ],
              "aliases": {},
              "id": "MI-05-AC-ST-02",
              "legacyId": "1rmtuks-wf8bdx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g05",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g09",
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "[9정05-03] 사례를 중심으로 디지털 공간에서 함께 살아가기 위해 개인 정보 및 권리와 저작권을 보호하는 실천 방법을 탐구한다.",
              "easy": [
                "디지털 공간",
                "개인 정보",
                "권리",
                "저작권"
              ],
              "normal": [
                "사례",
                "디지털 공간",
                "함께 살아가기",
                "개인 정보",
                "권리",
                "저작권",
                "보호",
                "실천 방법",
                "탐구"
              ],
              "aliases": {},
              "id": "MI-05-AC-ST-03",
              "legacyId": "1rmtuks-q6x1ev",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g10",
                  "g11"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[9정05-02] 디지털 사회를 안전하고 편리하게 살아가는 데 필요한 정보 윤리, 사이버 폭력 및 범죄 예방에 대한 기본적인 소양을 갖추고 스마트폰 중독, 인터넷 중독, 게임 과몰입 등의 구체적인 사례를 분석할 수 있어야 한다. 분석 내용을 기반으로 개인과 사회가 각각 수행해야 하는 실천 방안을 도출하여 자신의 삶에 적용하려는 태도를 갖출 수 있어야 한다.",
              "easy": [
                "안전하고",
                "편리하게",
                "정보 윤리",
                "사이버 폭력",
                "범죄 예방",
                "스마트폰 중독",
                "인터넷 중독",
                "게임 과몰입"
              ],
              "normal": [
                "디지털 사회",
                "사회",
                "안전하고 편리하게",
                "정보 윤리",
                "사이버 폭력",
                "범죄 예방",
                "기본적인 소양",
                "스마트폰 중독",
                "인터넷 중독",
                "게임 과몰입",
                "구체적인 사례",
                "분석",
                "분석 내용",
                "개인",
                "실천 방안",
                "도출",
                "자신의 삶",
                "적용",
                "태도"
              ],
              "aliases": {},
              "id": "MI-05-AC-EX-01",
              "legacyId": "1ykpcgs-en6es7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g21",
                  "g22",
                  "g03",
                  "g04",
                  "g05",
                  "g07",
                  "g08",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g13",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08",
                  "g09",
                  "g19",
                  "g11",
                  "g20",
                  "g12",
                  "g14",
                  "g15",
                  "g16",
                  "g17",
                  "g18"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g21",
                  "g22"
                ],
                "g06": [
                  "g23",
                  "g24"
                ],
                "g16": [
                  "g25"
                ]
              },
              "yaho": [
                "살아가는 데 필요한 정보 윤리",
                "사이버 폭력 및 범죄 예방에 대한 기본적인 소양을 갖추고 스마트폰 중독",
                "인터넷 중독, 게임 과몰입 등의 구체적인 사례를 분석할 수 있어야 한다",
                "분석 내용을 기반으로 개인과 사회가 각각 수행해야 하는 실천 방안을 도출하여",
                "자신의 삶에 적용하려는 태도를 갖출 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "정보 과목의 다른 내용 영역에서 자신이 실제로 학습한 내용을 바탕으로 디지털 사회를 이해하고 자신의 진로 계획을 수립할 수 있도록 진로 연계 교육을 고려한 교수·학습을 구성하도록 한다.",
              "easy": [
                "정보",
                "과목",
                "내용 영역",
                "디지털 사회",
                "진로 계획"
              ],
              "normal": [
                "정보 과목",
                "다른 내용 영역",
                "실제로 학습한 내용",
                "디지털 사회",
                "이해",
                "자신의 진로 계획",
                "수립",
                "진로 연계 교육",
                "고려",
                "교수·학습",
                "구성"
              ],
              "aliases": {},
              "id": "MI-05-AC-CO-01",
              "legacyId": "1dahci5-1cd37d9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g13",
                  "g14",
                  "g16",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g09",
                  "g10",
                  "g06",
                  "g07",
                  "g11",
                  "g08",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g13",
                  "g14"
                ],
                "g02": [
                  "g15",
                  "g16"
                ],
                "g03": [
                  "g17",
                  "g18",
                  "g19"
                ],
                "g07": [
                  "g20",
                  "g21"
                ]
              },
              "yaho": [
                "정보 과목의 다른 내용 영역에서 자신이 실제로 학습한 내용을 바탕으로 디지털 사회를 이해하고",
                "자신의 진로 계획을 수립할 수 있도록 진로 연계 교육을 고려한 교수·학습을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "민주시민 교육의 일환으로 디지털 사회에서 발생하는 여러 문제에 대한 다양한 견해가 있을 수 있음을 인정하고, 다른 사람의 의견을 존중하는 논의 환경을 조성하도록 한다.",
              "easy": [
                "민주시민",
                "디지털 사회",
                "인정",
                "다른 사람",
                "논의 환경"
              ],
              "normal": [
                "민주시민 교육",
                "디지털 사회",
                "발생하는 여러 문제",
                "다양한 견해",
                "인정",
                "다른 사람의 의견",
                "존중",
                "논의 환경",
                "조성"
              ],
              "aliases": {},
              "id": "MI-05-AC-CO-02",
              "legacyId": "1dahci5-zc62s1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g11",
                  "g02",
                  "g05",
                  "g17",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g10",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g11",
                  "g12"
                ],
                "g03": [
                  "g13",
                  "g14"
                ],
                "g04": [
                  "g15",
                  "g16"
                ],
                "g06": [
                  "g17",
                  "g18"
                ]
              },
              "yaho": [
                "민주시민 교육의 일환으로 디지털 사회에서 발생하는 여러 문제에 대한",
                "다양한 견해가 있을 수 있음을 인정하고, 다른 사람의 의견을 존중하는 논의 환경을 조성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            }
          ]
        }
      ]
    },
    "과목 공통": {
      "character-goal": [
        {
          "title": "성격",
          "lines": [
            {
              "id": "MI-CG-CHAR-01",
              "text": "‘정보(Informatics)’과는 인공지능으로 정의되는 사회에서 데이터와 정보로 인한 디지털 세상의 변화를 인식하고, 정보의 사회적 가치를 탐구하며, 정보를 처리하는 다양한 원리와 기술에 기반한 컴퓨팅 사고력을 바탕으로 실생활 및 다양한 학문 분야의 문제를 해결하는 능력과 태도를 기르는 교과이다.",
              "easy": [
                "컴퓨팅 사고력",
                "문제를 해결하는 능력과 태도"
              ],
              "normal": [
                "컴퓨팅 사고력",
                "문제를 해결하는 능력과 태도",
                "인공지능으로 정의되는 사회",
                "정보의 사회적 가치",
                "다양한 원리와 기술"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ipmdkh",
                  "g-1fjo5en"
                ],
                "normal": [
                  "g-1ipmdkh",
                  "g-1fjo5en",
                  "g-1k8egnc",
                  "g-1oxrfs3",
                  "g-qpwpyc"
                ]
              }
            },
            {
              "id": "MI-CG-CHAR-02",
              "text": "모든 학생이 기초적으로 갖추어야 할 디지털 소양의 근본이 되는 ‘정보’는 학생들이 미래 사회가 요구하는 컴퓨팅, 디지털에 대한 역량과 자기주도성을 갖춘 인간으로 성장하게 한다.",
              "easy": [
                "디지털 소양",
                "자기주도성"
              ],
              "normal": [
                "디지털 소양",
                "자기주도성",
                "컴퓨팅, 디지털에 대한 역량"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-7o41tn",
                  "g-1kmz59n"
                ],
                "normal": [
                  "g-7o41tn",
                  "g-1kmz59n",
                  "g-1vf4x45"
                ]
              }
            },
            {
              "id": "MI-CG-CHAR-03",
              "text": "중학교 ‘정보’는 컴퓨팅과 인공지능 기술 및 디지털 문화에 대한 이해를 기반으로 미래 사회의 문제를 해결하는 데 필요한 기초적인 능력과 태도를 함양하도록 한다.",
              "easy": [
                "컴퓨팅과 인공지능 기술",
                "디지털 문화",
                "기초적인 능력과 태도"
              ],
              "normal": [
                "컴퓨팅과 인공지능 기술",
                "디지털 문화",
                "기초적인 능력과 태도",
                "미래 사회의 문제를 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ekc9kk",
                  "g-q31e8x",
                  "g-c5tqqq"
                ],
                "normal": [
                  "g-1ekc9kk",
                  "g-q31e8x",
                  "g-c5tqqq",
                  "g-gx3rsn"
                ]
              }
            },
            {
              "id": "MI-CG-CHAR-04",
              "text": "중학교 ‘정보’는 초등학교 실과 내의 디지털 사회와 인공지능 영역 및 고등학교 정보 교과의 모든 과목과 연계성을 갖는다.",
              "easy": [
                "디지털 사회와 인공지능",
                "고등학교 정보 교과의 모든 과목"
              ],
              "normal": [
                "디지털 사회와 인공지능",
                "고등학교 정보 교과의 모든 과목",
                "연계성"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1u8u78q",
                  "g-f6nwge"
                ],
                "normal": [
                  "g-1u8u78q",
                  "g-f6nwge",
                  "g-xungh5"
                ]
              }
            }
          ]
        },
        {
          "title": "목표",
          "lines": [
            {
              "id": "MI-CG-GOAL-00",
              "text": "중학교 ‘정보’는 컴퓨팅 사고력을 기반으로 인공지능을 포함하는 컴퓨팅 기술을 활용하여 미래 사회에서 다양한 분야의 문제를 발견하고 해결할 수 있는 기초적인 능력을 함양하도록 하는 데 중점을 둔다.",
              "easy": [
                "컴퓨팅 사고력",
                "인공지능을 포함하는 컴퓨팅 기술",
                "문제를 발견하고 해결"
              ],
              "normal": [
                "컴퓨팅 사고력",
                "인공지능을 포함하는 컴퓨팅 기술",
                "문제를 발견하고 해결",
                "기초적인 능력"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-13kx2hb",
                  "g-u1pp6a",
                  "g-1re0w8b"
                ],
                "normal": [
                  "g-13kx2hb",
                  "g-u1pp6a",
                  "g-1re0w8b",
                  "g-1fw2i3e"
                ]
              }
            },
            {
              "id": "MI-CG-GOAL-01",
              "text": "(1) 디지털 세상의 데이터와 정보를 다루는 컴퓨팅 장치를 이해하고, 실생활에서 정보를 다루는 시스템에 의해 처리된 결과의 영향력을 판단하는 능력을 기른다.",
              "easy": [
                "컴퓨팅 장치",
                "결과의 영향력을 판단"
              ],
              "normal": [
                "컴퓨팅 장치",
                "결과의 영향력을 판단",
                "데이터와 정보",
                "정보를 다루는 시스템"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-17mjdhk",
                  "g-15fo0gh"
                ],
                "normal": [
                  "g-17mjdhk",
                  "g-15fo0gh",
                  "g-olq72h",
                  "g-15fwbzr"
                ]
              }
            },
            {
              "id": "MI-CG-GOAL-02",
              "text": "(2) 컴퓨터로 처리되는 정보의 원리를 이해하고, 다양한 현상의 의미를 해석하는 데 도움이 되는 데이터의 중요성을 고려하여 데이터의 수집 및 분석, 처리를 위한 능력을 기른다.",
              "easy": [
                "정보의 원리",
                "데이터의 중요성",
                "수집 및 분석, 처리"
              ],
              "normal": [
                "정보의 원리",
                "데이터의 중요성",
                "수집 및 분석, 처리",
                "다양한 현상의 의미를 해석"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1w3ecwq",
                  "g-16y3phj",
                  "g-1g79l2w"
                ],
                "normal": [
                  "g-1w3ecwq",
                  "g-16y3phj",
                  "g-1g79l2w",
                  "g-h7gjvg"
                ]
              }
            },
            {
              "id": "MI-CG-GOAL-03",
              "text": "(3) 컴퓨팅을 활용한 실생활의 문제 해결을 위해 문제를 발견, 분석, 추상화하여 해결책을 구상하고, 프로그램을 설계·구현하는 과정에서 자동화의 필요성과 중요성을 이해하고 실천하는 태도를 기른다.",
              "easy": [
                "발견, 분석, 추상화",
                "프로그램을 설계·구현",
                "자동화의 필요성과 중요성"
              ],
              "normal": [
                "발견, 분석, 추상화",
                "프로그램을 설계·구현",
                "자동화의 필요성과 중요성",
                "해결책을 구상"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-aenadu",
                  "g-1qt7a1z",
                  "g-mgb426"
                ],
                "normal": [
                  "g-aenadu",
                  "g-1qt7a1z",
                  "g-mgb426",
                  "g-1ms6wgi"
                ]
              }
            },
            {
              "id": "MI-CG-GOAL-04",
              "text": "(4) 인공지능으로 인한 세상의 변화를 이해하고, 기초 지식을 기반으로 인공지능을 활용한 문제 해결의 가능성을 탐색하는 태도와 능력을 기른다.",
              "easy": [
                "인공지능으로 인한 세상의 변화",
                "문제 해결의 가능성"
              ],
              "normal": [
                "인공지능으로 인한 세상의 변화",
                "문제 해결의 가능성",
                "기초 지식"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-hhossm",
                  "g-ozq3r"
                ],
                "normal": [
                  "g-hhossm",
                  "g-ozq3r",
                  "g-19z21ck"
                ]
              }
            },
            {
              "id": "MI-CG-GOAL-05",
              "text": "(5) 정보를 다루는 디지털 사회에 대한 특성을 이해하고, 미래 사회에서 디지털 기술의 영향력을 탐색하며, 디지털 사회를 살아가는 데 필요한 디지털 윤리를 실천할 수 있는 태도를 기른다.",
              "easy": [
                "디지털 사회",
                "디지털 기술의 영향력",
                "디지털 윤리"
              ],
              "normal": [
                "디지털 사회",
                "디지털 기술의 영향력",
                "디지털 윤리",
                "실천할 수 있는 태도"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-t1vo2c",
                  "g-12191s1",
                  "g-orn0lo"
                ],
                "normal": [
                  "g-t1vo2c",
                  "g-12191s1",
                  "g-orn0lo",
                  "g-1lb8v1g"
                ]
              }
            }
          ]
        }
      ],
      "teaching-evaluation": [
        {
          "title": "교수·학습의 방향",
          "lines": [
            {
              "id": "MI-TE-DIR-01",
              "text": "(가) 실제적인 삶의 맥락에서 컴퓨팅을 통해 문제를 해결하도록 하는 학습 과제를 제시하여 학습자가 과제를 스스로 해결하는 과정에서 자연스럽게 컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양을 함양할 수 있도록 지도한다.",
              "easy": [
                "실제적인 삶의 맥락",
                "컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양"
              ],
              "normal": [
                "실제적인 삶의 맥락",
                "컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양",
                "과제를 스스로 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-czoz4a",
                  "g-1hgoki7"
                ],
                "normal": [
                  "g-czoz4a",
                  "g-1hgoki7",
                  "g-grakwr"
                ]
              }
            },
            {
              "id": "MI-TE-DIR-02",
              "text": "(라) 정보 과목 내의 영역, 다른 교과 및 비교과 활동과의 통합을 통해 정보 관련 역량의 확장을 꾀하고 학생의 역량이 다양한 분야에 전이되도록 한다.",
              "easy": [
                "통합",
                "정보 관련 역량의 확장",
                "다양한 분야에 전이"
              ],
              "normal": [
                "통합",
                "정보 관련 역량의 확장",
                "다양한 분야에 전이"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-lt6xg6",
                  "g-1ln8uhx",
                  "g-7giiz3"
                ],
                "normal": [
                  "g-lt6xg6",
                  "g-1ln8uhx",
                  "g-7giiz3"
                ]
              }
            },
            {
              "id": "MI-TE-DIR-03",
              "text": "(마) 내용 영역의 배열순서가 반드시 교수·학습의 순서를 의미하는 것은 아니므로, 교수·학습 계획을 수립하거나 평가를 준비할 때는 학생에게 제공할 문제 상황, 문제의 난이도, 학생의 준비 상태, 학습 환경 등을 고려하여 내용이나 순서 등을 재구성할 수 있다.",
              "easy": [
                "배열순서",
                "교수·학습의 순서를 의미하는 것은 아니므로",
                "재구성"
              ],
              "normal": [
                "배열순서",
                "교수·학습의 순서를 의미하는 것은 아니므로",
                "재구성",
                "학생의 준비 상태",
                "학습 환경"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1xfeiep",
                  "g-majcrt",
                  "g-kw5i30"
                ],
                "normal": [
                  "g-1xfeiep",
                  "g-majcrt",
                  "g-kw5i30",
                  "g-1w2pzag",
                  "g-zxkht6"
                ]
              }
            },
            {
              "id": "MI-TE-DIR-04",
              "text": "(바) 학습자의 선행 지식과 총체적인 과제 진행을 고려하여 하위 학년군과 상위 학년군의 성취기준을 적절히 활용할 수 있다.",
              "easy": [
                "선행 지식",
                "하위 학년군과 상위 학년군의 성취기준"
              ],
              "normal": [
                "선행 지식",
                "하위 학년군과 상위 학년군의 성취기준",
                "적절히 활용"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ymodns",
                  "g-4bfy2q"
                ],
                "normal": [
                  "g-1ymodns",
                  "g-4bfy2q",
                  "g-1fu5nnw"
                ]
              }
            }
          ]
        },
        {
          "title": "교수·학습 방법",
          "lines": [
            {
              "id": "MI-TE-MET-01",
              "text": "(가) 교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, 디자인기반학습, 짝 프로그래밍, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
              "easy": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습"
              ],
              "normal": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습",
                "핵심 아이디어"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-14ysnkc",
                  "g-1jp6l3b",
                  "g-35bj7k",
                  "g-1t629yq",
                  "g-bgxs4c"
                ],
                "normal": [
                  "g-14ysnkc",
                  "g-1jp6l3b",
                  "g-35bj7k",
                  "g-1t629yq",
                  "g-bgxs4c",
                  "g-1c6iycl"
                ]
              }
            },
            {
              "id": "MI-TE-MET-02",
              "text": "(나) 디지털 교육 환경에 적응할 수 있도록 온오프라인 연계 수업, 다양한 디지털 도구의 활용 등을 통해 디지털 도구에 대한 인지적 부담은 최소화하고, 활용에 대한 경험은 높일 수 있도록 활동을 구성한다.",
              "easy": [
                "온오프라인 연계 수업",
                "인지적 부담은 최소화",
                "활용에 대한 경험은 높일"
              ],
              "normal": [
                "온오프라인 연계 수업",
                "인지적 부담은 최소화",
                "활용에 대한 경험은 높일",
                "다양한 디지털 도구"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1x31as8",
                  "g-uc6d1g",
                  "g-yq15lp"
                ],
                "normal": [
                  "g-1x31as8",
                  "g-uc6d1g",
                  "g-yq15lp",
                  "g-3udz6u"
                ]
              }
            },
            {
              "id": "MI-TE-MET-03",
              "text": "(라) 내용 영역별로 프로그래밍을 통한 문제 해결 과정을 포함하도록 하여 컴퓨팅 시스템을 문제 해결에 적용하는 충분한 경험을 하도록 교수·학습을 구성한다.",
              "easy": [
                "프로그래밍을 통한 문제 해결 과정",
                "컴퓨팅 시스템",
                "충분한 경험"
              ],
              "normal": [
                "프로그래밍을 통한 문제 해결 과정",
                "컴퓨팅 시스템",
                "충분한 경험"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-15cz2d",
                  "g-s277yb",
                  "g-1a67pyw"
                ],
                "normal": [
                  "g-15cz2d",
                  "g-s277yb",
                  "g-1a67pyw"
                ]
              }
            }
          ]
        },
        {
          "title": "평가의 방향",
          "lines": [
            {
              "id": "MI-TE-EVD-01",
              "text": "(가) 평가 항목은 컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양의 하위 요소를 기반으로 구체화한다.",
              "easy": [
                "컴퓨팅 사고력",
                "디지털 문화 소양",
                "인공지능 소양",
                "하위 요소"
              ],
              "normal": [
                "컴퓨팅 사고력",
                "디지털 문화 소양",
                "인공지능 소양",
                "하위 요소"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1jyhv9b",
                  "g-1ydq4qo",
                  "g-fuleu8",
                  "g-15ahzuj"
                ],
                "normal": [
                  "g-1jyhv9b",
                  "g-1ydq4qo",
                  "g-fuleu8",
                  "g-15ahzuj"
                ]
              }
            },
            {
              "id": "MI-TE-EVD-02",
              "text": "(나) 평가 내용은 지식·이해뿐 아니라, 과정·기능, 가치·태도의 측면 등을 다면적으로 반영하고 과정을 중시하는 평가를 통해 학생의 성장과 발달을 돕는 평가를 실현한다.",
              "easy": [
                "지식·이해",
                "과정·기능",
                "가치·태도",
                "과정을 중시하는 평가"
              ],
              "normal": [
                "지식·이해",
                "과정·기능",
                "가치·태도",
                "과정을 중시하는 평가",
                "다면적으로 반영"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1k4hhti",
                  "g-aok5kx",
                  "g-dzshhn",
                  "g-nm84tp"
                ],
                "normal": [
                  "g-1k4hhti",
                  "g-aok5kx",
                  "g-dzshhn",
                  "g-nm84tp",
                  "g-11cjpdw"
                ]
              }
            },
            {
              "id": "MI-TE-EVD-03",
              "text": "(다) 구체적인 평가 루브릭을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
              "easy": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "normal": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1xo0mtd",
                  "g-1lqp178",
                  "g-1flzsu0"
                ],
                "normal": [
                  "g-1xo0mtd",
                  "g-1lqp178",
                  "g-1flzsu0"
                ]
              }
            }
          ]
        },
        {
          "title": "평가 방법",
          "lines": [
            {
              "id": "MI-TE-EVM-01",
              "text": "(가) 성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 평가 포트폴리오를 계획한다. 예를 들어, 관찰 평가, 서술형평가, 수행평가 등을 활용하거나, 자기 평가, 동료 평가 등과 같은 다면적 평가를 실행한다.",
              "easy": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행평가",
                "자기 평가",
                "동료 평가"
              ],
              "normal": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행평가",
                "자기 평가",
                "동료 평가",
                "지필평가에 국한하지 않고",
                "다면적 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-pe6fyb",
                  "g-19335a7",
                  "g-13z66nk",
                  "g-e7bm38",
                  "g-1bbp8bz",
                  "g-qzbrp0"
                ],
                "normal": [
                  "g-pe6fyb",
                  "g-19335a7",
                  "g-13z66nk",
                  "g-e7bm38",
                  "g-1bbp8bz",
                  "g-qzbrp0",
                  "g-h7kgq8",
                  "g-1ppwyvu"
                ]
              }
            },
            {
              "id": "MI-TE-EVM-02",
              "text": "(나) 평가 내용이나 방법에 따라 다양한 디지털 도구(프로그램 자동 평가시스템, 학습관리시스템(LMS) 등)를 활용할 수 있으며, 평가 이전에 학생이 디지털 도구를 다룰 수 있도록 교육하여 평가의 불이익이 없도록 계획한다.",
              "easy": [
                "프로그램 자동 평가시스템",
                "학습관리시스템(LMS)",
                "평가의 불이익이 없도록"
              ],
              "normal": [
                "프로그램 자동 평가시스템",
                "학습관리시스템(LMS)",
                "평가의 불이익이 없도록",
                "다양한 디지털 도구"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-r4i86v",
                  "g-1cgreqc",
                  "g-1jwwlmg"
                ],
                "normal": [
                  "g-r4i86v",
                  "g-1cgreqc",
                  "g-1jwwlmg",
                  "g-hdcwy2"
                ]
              }
            },
            {
              "id": "MI-TE-EVM-03",
              "text": "(다) 개념적이거나 기능적으로 명확하게 파악할 수 있는 부분은 정량적 평가를, 결과물의 품질이나 심미적 부분을 평가할 때는 정성적 평가를 실시한다.",
              "easy": [
                "정량적 평가",
                "정성적 평가"
              ],
              "normal": [
                "정량적 평가",
                "정성적 평가",
                "결과물의 품질이나 심미적 부분"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1uvpywi",
                  "g-xj4ca2"
                ],
                "normal": [
                  "g-1uvpywi",
                  "g-xj4ca2",
                  "g-izw0rh"
                ]
              }
            }
          ]
        }
      ]
    }
  },
  "info-science": {
    "프로그래밍": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "프로그래밍을 통한 자동화는 다양한 학문 분야의 문제를 해결하는 데 도움을 준다.",
              "easy": [
                "프로그래밍",
                "자동화",
                "학문 분야"
              ],
              "normal": [
                "프로그래밍",
                "자동화",
                "다양한 학문 분야",
                "학문 분야",
                "문제",
                "해결"
              ],
              "aliases": {},
              "id": "IS-01-CS-KI-01",
              "legacyId": "19een0-1da0asc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-38ebe1b9",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "효율적인 프로그래밍을 가능하게 하는 함수는 프로그램의 간결화, 재사용성 측면에서 활용된다.",
              "easy": [
                "프로그래밍",
                "함수",
                "간결화",
                "재사용성"
              ],
              "normal": [
                "효율적인 프로그래밍",
                "함수",
                "프로그램",
                "간결화",
                "재사용성",
                "활용"
              ],
              "aliases": {},
              "id": "IS-01-CS-KI-02",
              "legacyId": "19een0-ugbjc4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g08",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "프로그램 개발은 협력이 필요하며, 공유하는 문화를 통해 더 좋은 프로그램이 개발된다.",
              "easy": [
                "프로그램 개발",
                "협력",
                "문화"
              ],
              "normal": [
                "프로그램 개발",
                "프로그램",
                "협력",
                "공유",
                "문화",
                "더 좋은 프로그램"
              ],
              "aliases": {},
              "id": "IS-01-CS-KI-03",
              "legacyId": "19een0-j0mc6e",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "n66-4179082e"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "함수 정의와 호출",
              "easy": [
                "함수 정의",
                "호출"
              ],
              "normal": [
                "함수 정의",
                "호출"
              ],
              "aliases": {},
              "id": "IS-01-CS-KN-01",
              "legacyId": "1gji2b-eszuby",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "재귀관계와 재귀함수",
              "easy": [
                "재귀관계",
                "재귀함수"
              ],
              "normal": [
                "재귀관계",
                "재귀함수"
              ],
              "aliases": {},
              "id": "IS-01-CS-KN-02",
              "legacyId": "1gji2b-vyxsgh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "매개변수를 활용한 함수 프로그램 작성하기",
              "easy": [
                "함수",
                "작성"
              ],
              "normal": [
                "매개변수",
                "활용",
                "함수 프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "IS-01-CS-PF-01",
              "legacyId": "1eyoxrk-iqkf0k",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g05",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "문제 해결을 위한 재귀관계 파악 및 재귀함수 구현하기",
              "easy": [
                "재귀관계",
                "재귀함수"
              ],
              "normal": [
                "문제 해결",
                "재귀관계",
                "파악",
                "재귀함수",
                "구현"
              ],
              "aliases": {},
              "id": "IS-01-CS-PF-02",
              "legacyId": "1eyoxrk-1228081",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "재귀구조의 가치를 이해하고 적극적으로 활용하는 자세",
              "easy": [
                "재귀구조",
                "적극적으로 활용"
              ],
              "normal": [
                "재귀구조",
                "가치",
                "이해",
                "적극적으로 활용",
                "자세"
              ],
              "aliases": {},
              "id": "IS-01-CS-VA-01",
              "legacyId": "j8myzy-1hyhe1p",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "문제 해결에 새로운 아이디어를 적용하는 자세",
              "easy": [
                "문제 해결",
                "아이디어"
              ],
              "normal": [
                "문제 해결",
                "새로운 아이디어",
                "적용",
                "자세"
              ],
              "aliases": {},
              "id": "IS-01-CS-VA-02",
              "legacyId": "j8myzy-16gvql7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정과01-01] 함수 정의와 호출의 원리를 이해하고, 매개변수를 활용한 함수 프로그램을 작성한다.",
              "easy": [
                "함수 정의",
                "호출",
                "매개변수",
                "함수 프로그램"
              ],
              "normal": [
                "함수 정의",
                "호출",
                "원리",
                "매개변수",
                "활용",
                "함수 프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "IS-01-AC-ST-01",
              "legacyId": "1rmtuks-fgm31a",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g06",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "[12정과01-02] 주어진 문제에서 적용할 수 있는 재귀관계를 파악하고, 재귀구조를 활용하여 프로그램을 작성한다.",
              "easy": [
                "재귀관계",
                "재귀구조",
                "프로그램"
              ],
              "normal": [
                "문제",
                "재귀관계",
                "파악",
                "재귀구조",
                "활용",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "IS-01-AC-ST-02",
              "legacyId": "1rmtuks-bdcusj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g06",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정과01-03] 반복구조와 재귀구조를 활용하여 문제를 해결하고, 두 방식의 차이를 비교·분석한다.",
              "easy": [
                "반복구조",
                "재귀구조",
                "차이"
              ],
              "normal": [
                "반복구조",
                "재귀구조",
                "문제",
                "해결",
                "두 방식",
                "차이",
                "비교·분석"
              ],
              "aliases": {},
              "id": "IS-01-AC-ST-03",
              "legacyId": "1rmtuks-qrn9zw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정과01-02] 많은 알고리즘의 코드가 재귀적으로 구성되어 있고 재귀구조를 통해 높은 수준의 생산성을 기대할 수 있다. 문제 내에서 재귀관계를 파악할 때는 수학적 귀납법을 활용할 수 있음을 이해하고, 문제 해결책을 재귀구조를 활용하여 설계하고 프로그래밍할 수 있어야 한다. 또한, 이후의 학습 내용이 많은 부분 재귀구조와 관련되어 있음을 판단할 수 있어야 한다.",
              "easy": [
                "알고리즘",
                "재귀구조",
                "생산성",
                "재귀관계",
                "수학적 귀납법",
                "문제 해결책"
              ],
              "normal": [
                "알고리즘",
                "코드",
                "재귀적으로 구성",
                "재귀구조",
                "생산성",
                "재귀관계",
                "파악",
                "수학적 귀납법",
                "문제 해결책",
                "설계",
                "프로그래밍",
                "학습 내용",
                "판단"
              ],
              "aliases": {},
              "id": "IS-01-AC-EX-01",
              "legacyId": "1ykpcgs-e5lzn4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g08",
                  "g02",
                  "g03",
                  "g04",
                  "n66-a00035d6",
                  "g05",
                  "g06",
                  "g09",
                  "g10",
                  "g11",
                  "n66-ff85f5ca"
                ],
                "yaho": [
                  "y01",
                  "y02",
                  "y03"
                ]
              }
            },
            {
              "text": "[12정과01-03] 재귀구조와 반복구조는 문제 해결책을 설계하는 방법이나 코드의 표현에 있어서 서로 다른 지향점을 갖는다. 특정한 문제를 해결할 때 재귀구조를 사용하여 프로그래밍하는 것과 반복구조를 사용하여 프로그래밍하는 방식의 차이를 구체적으로 비교하여 설명할 수 있어야 한다.",
              "easy": [
                "재귀구조",
                "반복구조",
                "문제 해결책",
                "코드",
                "차이"
              ],
              "normal": [
                "재귀구조",
                "반복구조",
                "문제 해결책",
                "설계",
                "코드",
                "표현",
                "지향점",
                "특정한 문제",
                "프로그래밍",
                "차이",
                "비교"
              ],
              "aliases": {},
              "id": "IS-01-AC-EX-02",
              "legacyId": "1ykpcgs-u943fd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g07",
                  "g08",
                  "g09",
                  "g10",
                  "g05",
                  "g11"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "수학적 귀납법을 적용할 때 주어진 명제를 수학적으로 증명하는 과정을 설명하는 방법보다는 귀납 가정 부분이 재귀함수 호출과 어떤 관계가 있는지를 다양한 예를 통해서 이해할 수 있도록 하여 실제 문제를 해결할 때 재귀구조를 활용할 수 있음을 인식하도록 한다.",
              "easy": [
                "수학적 귀납법",
                "가정",
                "재귀함수 호출",
                "재귀구조"
              ],
              "normal": [
                "수학적 귀납법",
                "명제",
                "증명",
                "설명",
                "귀납 가정",
                "재귀함수 호출",
                "관계",
                "문제를 해결",
                "문제",
                "해결",
                "재귀구조",
                "활용"
              ],
              "aliases": {},
              "id": "IS-01-AC-CO-01",
              "legacyId": "1dahci5-gfzbsa",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g12",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g06",
                  "n66-f25a5515",
                  "g02",
                  "g03",
                  "g07",
                  "n66-463f43e9",
                  "g08",
                  "g09",
                  "g04",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g11",
                  "g12"
                ]
              },
              "yaho": [
                "주어진 명제를 수학적으로 증명하는 과정을 설명하는 방법보다는 귀납 가정",
                "부분이 재귀함수 호출과 어떤 관계가 있는지를 다양한 예를 통해서 이해할 수 있도록 하여",
                "실제 문제를 해결할 때 재귀구조를 활용할 수 있음을 인식하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "최소 성취수준을 보장하기 위해 주어진 문제로부터 재귀관계를 파악하지 못하더라도 반복구조로 작성된 프로그램을 재귀함수로 변환하여 구현하는 방식의 활동을 제공하도록 한다.",
              "easy": [
                "최소 성취수준",
                "재귀관계",
                "반복구조",
                "재귀함수"
              ],
              "normal": [
                "최소 성취수준",
                "보장",
                "문제",
                "재귀관계",
                "파악",
                "반복구조",
                "프로그램",
                "재귀함수",
                "변환",
                "구현",
                "방식"
              ],
              "aliases": {},
              "id": "IS-01-AC-CO-02",
              "legacyId": "1dahci5-if13av",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "n66-a81747ba",
                  "g05",
                  "g02",
                  "n66-296a881f",
                  "g03",
                  "g06",
                  "g04",
                  "g07",
                  "g08",
                  "n66-477245a0"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "yaho": [
                "최소 성취수준을 보장하기 위해 주어진 문제로부터 재귀관계를 파악하지 못하더라도",
                "반복구조로 작성된 프로그램을 재귀함수로 변환하여 구현하는 방식의 활동을 제공하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            }
          ]
        }
      ]
    },
    "데이터 구조": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "문제에 따라 해결에 적합한 데이터 구조를 선택하는 것이 중요하다.",
              "easy": [
                "적합한 데이터 구조",
                "선택"
              ],
              "normal": [
                "문제",
                "해결",
                "적합한 데이터 구조",
                "선택",
                "중요"
              ],
              "aliases": {},
              "id": "IS-02-CS-KI-01",
              "legacyId": "19een0-p45cqk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g05",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g05",
                  "g03",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "데이터들의 관계를 파악하고, 특성에 맞도록 구조화하는 것은 문제를 효율적으로 해결하는 데 도움을 준다.",
              "easy": [
                "데이터들의 관계",
                "특성",
                "구조화"
              ],
              "normal": [
                "데이터들의 관계",
                "데이터",
                "관계",
                "파악",
                "특성",
                "구조화",
                "문제",
                "효율적으로 해결",
                "도움"
              ],
              "aliases": {},
              "id": "IS-02-CS-KI-02",
              "legacyId": "19een0-1olsqqn",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "c66-31d3ccec",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "n66-31d3ccec",
                  "g01",
                  "g02",
                  "g07",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "n66-b1ead655"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g06": [
                  "g08",
                  "g09"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "스택과 큐",
              "easy": [
                "스택",
                "큐"
              ],
              "normal": [
                "스택",
                "큐"
              ],
              "aliases": {},
              "id": "IS-02-CS-KN-01",
              "legacyId": "1gji2b-1ym8e82",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "트리와 그래프",
              "easy": [
                "트리",
                "그래프"
              ],
              "normal": [
                "트리",
                "그래프"
              ],
              "aliases": {},
              "id": "IS-02-CS-KN-02",
              "legacyId": "1gji2b-18rfo9b",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "순차적인 데이터 구조를 이용하여 스택, 큐 구현하기",
              "easy": [
                "순차적인",
                "데이터 구조",
                "스택",
                "큐",
                "구현"
              ],
              "normal": [
                "순차적인 데이터 구조",
                "스택",
                "큐",
                "구현"
              ],
              "aliases": {},
              "id": "IS-02-CS-PF-01",
              "legacyId": "1eyoxrk-qwpot2",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g05",
                  "g06",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "스택, 큐를 활용하여 해결할 수 있는 문제 탐색하기",
              "easy": [
                "스택",
                "탐색"
              ],
              "normal": [
                "스택",
                "큐",
                "해결할 수 있는 문제",
                "문제",
                "탐색"
              ],
              "aliases": {},
              "id": "IS-02-CS-PF-02",
              "legacyId": "1eyoxrk-1h461cc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-ea51363e",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인접행렬과 인접리스트로 트리, 그래프 구현하기",
              "easy": [
                "인접행렬",
                "인접리스트"
              ],
              "normal": [
                "인접행렬",
                "인접리스트",
                "트리",
                "그래프",
                "구현"
              ],
              "aliases": {},
              "id": "IS-02-CS-PF-03",
              "legacyId": "1eyoxrk-oawjmg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "트리, 그래프를 활용하여 해결할 수 있는 문제 탐색하기",
              "easy": [
                "트리",
                "그래프"
              ],
              "normal": [
                "트리",
                "그래프",
                "해결할 수 있는 문제",
                "문제",
                "탐색"
              ],
              "aliases": {},
              "id": "IS-02-CS-PF-04",
              "legacyId": "1eyoxrk-fmth6b",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-16d657f4",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "데이터 구조화를 통해 문제를 해결하는 태도",
              "easy": [
                "데이터 구조화"
              ],
              "normal": [
                "데이터 구조화",
                "문제",
                "해결",
                "태도"
              ],
              "aliases": {},
              "id": "IS-02-CS-VA-01",
              "legacyId": "j8myzy-1mhvz7a",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "효율적 문제 해결을 위한 데이터 구조화의 중요성 인식",
              "easy": [
                "데이터 구조화",
                "중요성"
              ],
              "normal": [
                "효율적 문제 해결",
                "데이터 구조화",
                "중요성",
                "인식"
              ],
              "aliases": {},
              "id": "IS-02-CS-VA-02",
              "legacyId": "j8myzy-gdh2j3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정과02-01] 스택과 큐의 원리를 이해하고, 순차적인 데이터 구조를 이용하여 스택과 큐를 구현한다.",
              "easy": [
                "스택",
                "원리",
                "순차적인",
                "데이터 구조"
              ],
              "normal": [
                "스택",
                "큐",
                "원리",
                "순차적인 데이터 구조",
                "구현"
              ],
              "aliases": {},
              "id": "IS-02-AC-ST-01",
              "legacyId": "1rmtuks-8wicst",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12정과02-02] 스택, 큐를 활용하여 문제를 효율적으로 해결하는 프로그램을 작성한다.",
              "easy": [
                "스택",
                "효율적으로",
                "프로그램"
              ],
              "normal": [
                "스택",
                "큐",
                "문제",
                "효율적으로 해결",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "IS-02-AC-ST-02",
              "legacyId": "1rmtuks-ccpvxx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g07",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "[12정과02-03] 인접행렬과 인접리스트를 활용하여 트리와 그래프를 구현한다.",
              "easy": [
                "인접행렬",
                "인접리스트",
                "그래프"
              ],
              "normal": [
                "인접행렬",
                "인접리스트",
                "트리",
                "그래프",
                "구현"
              ],
              "aliases": {},
              "id": "IS-02-AC-ST-03",
              "legacyId": "1rmtuks-1bf53vb",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정과02-04] 트리, 그래프를 활용하여 문제를 효율적으로 해결하는 프로그램을 작성한다.",
              "easy": [
                "트리",
                "그래프",
                "효율적으로"
              ],
              "normal": [
                "트리",
                "그래프",
                "문제",
                "효율적으로 해결",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "IS-02-AC-ST-04",
              "legacyId": "1rmtuks-s62mik",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정과02-01] 선입선출, 후입선출 구조를 활용하면 복잡한 문제를 간단하게 해결할 수 있음을 이해할 수 있어야 한다. 프로그래밍 언어의 특성에 따라 배열이나 리스트를 활용하여 대표적인 선입선출, 후입선출 구조인 스택과 큐를 구현하고 문제를 해결하는 데 활용할 수 있어야 한다.",
              "easy": [
                "선입선출",
                "후입선출",
                "배열",
                "리스트",
                "스택",
                "큐"
              ],
              "normal": [
                "선입선출",
                "후입선출",
                "활용",
                "복잡한 문제",
                "문제",
                "해결",
                "프로그래밍 언어",
                "배열",
                "리스트",
                "스택",
                "큐",
                "구현"
              ],
              "aliases": {},
              "id": "IS-02-AC-EX-01",
              "legacyId": "1ykpcgs-l5p701",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g11",
                  "g09",
                  "g07",
                  "g08",
                  "n66-ffb836d5",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g10"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "스택과 큐를 배열이나 리스트로 구현하는 활동을 통하여 원리를 이해할 수 있도록 하고, 이후 진행되는 문제 해결 활동에서는 프로그래밍 언어별로 활용 가능한 스택과 큐의 라이브러리를 활용하여 구현하는 방법도 활용하도록 한다.",
              "easy": [
                "스택",
                "배열",
                "리스트",
                "프로그래밍 언어",
                "라이브러리"
              ],
              "normal": [
                "스택",
                "큐",
                "배열",
                "리스트",
                "구현",
                "원리",
                "문제 해결 활동",
                "프로그래밍 언어",
                "활용",
                "라이브러리"
              ],
              "aliases": {},
              "id": "IS-02-AC-CO-01",
              "legacyId": "1dahci5-81l5qu",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g09",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g07",
                  "g05",
                  "g08",
                  "g09",
                  "g10",
                  "g06"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "구현하는 활동을 통하여 원리를 이해할 수 있도록 하고",
                "이후 진행되는 문제 해결 활동에서는 프로그래밍 언어별로 활용 가능한 스택과",
                "큐의 라이브러리를 활용하여 구현하는 방법도 활용하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "인접리스트는 트리와 그래프를 만드는 도구로서의 활용이 목적이므로 구조체와 포인터 등으로 직접 구현하는 방법보다는 프로그래밍 언어별로 제공하는 벡터(vector)와 같은 라이브러리를 이용하여 구현하는 방법도 활용하도록 한다.",
              "easy": [
                "인접리스트",
                "트리",
                "그래프",
                "프로그래밍 언어",
                "라이브러리"
              ],
              "normal": [
                "인접리스트",
                "트리",
                "그래프",
                "구조체",
                "포인터",
                "직접 구현",
                "구현",
                "프로그래밍 언어",
                "벡터(vector)",
                "라이브러리"
              ],
              "aliases": {},
              "id": "IS-02-AC-CO-02",
              "legacyId": "1dahci5-10s3ju1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g08",
                  "g11",
                  "g09",
                  "g10",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "만드는 도구로서의 활용이 목적이므로 구조체와 포인터 등으로 직접 구현하는",
                "방법보다는 프로그래밍 언어별로 제공하는 벡터(vector)와 같은 라이브러리를 이용하여",
                "구현하는 방법도 활용하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "데이터 구조의 원리를 이해하고 구현하는 과정이 궁극적으로는 문제를 효율적으로 해결하는 방법임을 이해하고 학습을 진행하는 것이 필요하다. 따라서 데이터 구조를 활용한 실생활의 문제 해결 활동과 예제를 제공하는 방식으로 교수·학습을 구성하고 해당 맥락에서 데이터 구조를 활용하는 능력을 향상하도록 한다.",
              "easy": [
                "구조",
                "원리",
                "효율적으로"
              ],
              "normal": [
                "데이터 구조",
                "원리",
                "구현",
                "문제",
                "효율적으로 해결",
                "학습",
                "실생활",
                "문제 해결 활동",
                "방식",
                "교수·학습",
                "활용하는 능력"
              ],
              "aliases": {},
              "id": "IS-02-AC-CO-03",
              "legacyId": "1dahci5-3er2j3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g11",
                  "g02",
                  "g12"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "n66-a94e0713",
                  "g05",
                  "g07",
                  "n66-48fabed5",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g10",
                  "g11"
                ],
                "g04": [
                  "g12",
                  "g13"
                ]
              }
            }
          ]
        }
      ]
    },
    "알고리즘": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "자동화를 고려해 설계된 알고리즘은 컴퓨터가 이해할 수 있는 언어로 구현되어 문제 해결에 도움을 준다.",
              "easy": [
                "자동화",
                "알고리즘",
                "언어",
                "문제 해결"
              ],
              "normal": [
                "자동화",
                "알고리즘",
                "컴퓨터",
                "이해할 수 있는 언어",
                "언어",
                "구현",
                "문제 해결"
              ],
              "aliases": {},
              "id": "IS-03-CS-KI-01",
              "legacyId": "19een0-1yfai4k",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "n66-d92ac3b3",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "문제를 효율적으로 해결하기 위해서는 적합한 알고리즘 설계 전략을 선택하는 것이 중요하다.",
              "easy": [
                "알고리즘 설계",
                "선택"
              ],
              "normal": [
                "문제",
                "효율적으로 해결",
                "알고리즘 설계 전략",
                "선택",
                "중요"
              ],
              "aliases": {},
              "id": "IS-03-CS-KI-02",
              "legacyId": "19een0-8mc9aw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g06",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "알고리즘 효율을 개선하기 위해 알고리즘의 성능을 정량적으로 분석한다.",
              "easy": [
                "알고리즘",
                "성능",
                "정량적으로 분석"
              ],
              "normal": [
                "알고리즘 효율",
                "알고리즘",
                "개선",
                "성능",
                "정량적으로 분석"
              ],
              "aliases": {},
              "id": "IS-03-CS-KI-03",
              "legacyId": "19een0-1mo9epx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "탐색기반 알고리즘",
              "easy": [
                "탐색기반 알고리즘"
              ],
              "normal": [
                "탐색기반 알고리즘"
              ],
              "aliases": {},
              "id": "IS-03-CS-KN-01",
              "legacyId": "1gji2b-19otona",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "관계기반 알고리즘",
              "easy": [
                "관계기반 알고리즘"
              ],
              "normal": [
                "관계기반 알고리즘"
              ],
              "aliases": {},
              "id": "IS-03-CS-KN-02",
              "legacyId": "1gji2b-gz4gaj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "알고리즘 복잡도",
              "easy": [
                "알고리즘 복잡도"
              ],
              "normal": [
                "알고리즘 복잡도"
              ],
              "aliases": {},
              "id": "IS-03-CS-KN-03",
              "legacyId": "1gji2b-15x33n7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "문제 상태 공간을 탐색하고, 알고리즘 설계하기",
              "easy": [
                "상태 공간",
                "알고리즘"
              ],
              "normal": [
                "문제",
                "상태 공간",
                "탐색",
                "알고리즘",
                "설계"
              ],
              "aliases": {},
              "id": "IS-03-CS-PF-01",
              "legacyId": "1eyoxrk-1m0g8co",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "문제를 분해하고, 모델링하기",
              "easy": [
                "분해",
                "모델링"
              ],
              "normal": [
                "문제",
                "분해",
                "모델링"
              ],
              "aliases": {},
              "id": "IS-03-CS-PF-02",
              "legacyId": "1eyoxrk-o4ijgg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "빅오 표기법으로 알고리즘 성능 비교하기",
              "easy": [
                "알고리즘",
                "성능",
                "비교"
              ],
              "normal": [
                "빅오 표기법",
                "알고리즘",
                "성능",
                "비교"
              ],
              "aliases": {},
              "id": "IS-03-CS-PF-03",
              "legacyId": "1eyoxrk-1wggytv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "문제 해결 상황에 적절한 알고리즘을 적용하는 유연한 태도",
              "easy": [
                "알고리즘",
                "유연한 태도"
              ],
              "normal": [
                "문제 해결 상황",
                "적절한 알고리즘",
                "적용",
                "유연한 태도"
              ],
              "aliases": {},
              "id": "IS-03-CS-VA-01",
              "legacyId": "j8myzy-7wweb0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "정량적인 분석을 통해 알고리즘의 성능을 객관적으로 평가하는 자세",
              "easy": [
                "알고리즘",
                "객관적으로"
              ],
              "normal": [
                "정량적인 분석",
                "알고리즘",
                "성능",
                "객관적으로 평가",
                "자세"
              ],
              "aliases": {},
              "id": "IS-03-CS-VA-02",
              "legacyId": "j8myzy-1rrpzgx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ],
                "g04": [
                  "g08",
                  "g09"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정과03-01] 문제를 분석하여 상태 공간으로 구조화하고, 상태 공간을 모두 탐색하여 문제를 해결하는 알고리즘을 설계한다.",
              "easy": [
                "상태 공간",
                "구조화",
                "모두 탐색",
                "알고리즘"
              ],
              "normal": [
                "문제",
                "분석",
                "상태 공간",
                "구조화",
                "모두 탐색",
                "해결",
                "알고리즘",
                "설계"
              ],
              "aliases": {},
              "id": "IS-03-AC-ST-01",
              "legacyId": "1rmtuks-13vd14w",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g07",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g03",
                  "g07",
                  "g08",
                  "g05",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정과03-02] 문제의 상태 공간 일부를 배제하는 알고리즘을 설계하고, 기존의 탐색기반 알고리즘과 비교·분석한다.",
              "easy": [
                "상태 공간",
                "배제",
                "알고리즘",
                "탐색기반 알고리즘"
              ],
              "normal": [
                "상태 공간",
                "일부",
                "배제",
                "알고리즘",
                "설계",
                "탐색기반 알고리즘",
                "비교·분석"
              ],
              "aliases": {},
              "id": "IS-03-AC-ST-02",
              "legacyId": "1rmtuks-12ixr5s",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정과03-03] 전체 문제를 부분 문제로 분해하고, 전체 문제와 부분 문제의 관계를 발견한다.",
              "easy": [
                "전체 문제",
                "부분 문제",
                "분해",
                "관계"
              ],
              "normal": [
                "전체 문제",
                "부분 문제",
                "분해",
                "관계",
                "발견"
              ],
              "aliases": {},
              "id": "IS-03-AC-ST-03",
              "legacyId": "1rmtuks-bqi05q",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정과03-04] 부분 문제를 해결한 결과를 이용하여 전체 문제를 해결하는 알고리즘을 설계한다.",
              "easy": [
                "부분 문제",
                "전체 문제",
                "알고리즘"
              ],
              "normal": [
                "부분 문제",
                "해결한 결과",
                "해결",
                "전체 문제",
                "알고리즘",
                "설계"
              ],
              "aliases": {},
              "id": "IS-03-AC-ST-04",
              "legacyId": "1rmtuks-1y0z1xy",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g07"
                ]
              }
            },
            {
              "text": "[12정과03-05] 부분 문제가 중복으로 적용되지 않는 알고리즘을 설계하고 기존의 관계기반 알고리즘과 비교·분석한다.",
              "easy": [
                "부분 문제",
                "중복",
                "알고리즘",
                "관계기반 알고리즘"
              ],
              "normal": [
                "부분 문제",
                "중복",
                "알고리즘",
                "설계",
                "관계기반 알고리즘",
                "비교·분석"
              ],
              "aliases": {},
              "id": "IS-03-AC-ST-05",
              "legacyId": "1rmtuks-10zecoo",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정과03-06] 알고리즘의 복잡도를 빅오 표기법으로 표현하고 다른 알고리즘과 비교한다.",
              "easy": [
                "알고리즘",
                "빅오 표기법",
                "비교"
              ],
              "normal": [
                "알고리즘",
                "복잡도",
                "빅오 표기법",
                "표현",
                "다른 알고리즘",
                "비교"
              ],
              "aliases": {},
              "id": "IS-03-AC-ST-06",
              "legacyId": "1rmtuks-1otx1rr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g06",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정과03-02] 상태 공간 일부를 배제하고도 정확한 답을 구할 수 있는 분기한정법과 탐욕법 등의 알고리즘 설계 방법이 상태 공간을 배제하는 원리를 설명하고, 이를 활용하여 문제를 해결할 수 있는 알고리즘을 설계할 수 있어야 한다.",
              "easy": [
                "상태 공간",
                "배제",
                "분기한정법",
                "탐욕법",
                "알고리즘 설계"
              ],
              "normal": [
                "상태 공간",
                "일부",
                "배제",
                "정확한 답",
                "분기한정법",
                "탐욕법",
                "알고리즘 설계 방법",
                "알고리즘",
                "설계",
                "원리",
                "문제",
                "해결"
              ],
              "aliases": {},
              "id": "IS-03-AC-EX-01",
              "legacyId": "1ykpcgs-1ot1phl",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g08",
                  "g02",
                  "g09",
                  "g03",
                  "g04",
                  "g10",
                  "g12",
                  "g13",
                  "g11",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "정확한 답을 구할 수 있는 분기한정법과 탐욕법 등의 알고리즘 설계 방법이",
                "상태 공간을 배제하는 원리를 설명하고, 이를 활용하여",
                "문제를 해결할 수 있는 알고리즘을 설계할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "[12정과03-04] 퀵 정렬, 합병 정렬 등을 활용하여 분할정복법이 문제를 해결하는 원리를 이해하고, 분할정복법을 활용하여 해결할 수 있는 문제를 탐색하여 해결 알고리즘을 설계할 수 있어야 한다.",
              "easy": [
                "퀵 정렬",
                "합병",
                "분할정복법",
                "알고리즘"
              ],
              "normal": [
                "퀵 정렬",
                "합병 정렬",
                "분할정복법",
                "문제",
                "해결",
                "원리",
                "탐색",
                "알고리즘",
                "설계"
              ],
              "aliases": {},
              "id": "IS-03-AC-EX-02",
              "legacyId": "1ykpcgs-r6wlzm",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g10",
                  "g03",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g07",
                  "g08",
                  "g06",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g10",
                  "g11"
                ]
              },
              "yaho": [
                "퀵 정렬, 합병 정렬 등을 활용하여 분할정복법이 문제를 해결하는 원리를 이해하고",
                "분할정복법을 활용하여 해결할 수 있는 문제를 탐색하여 해결 알고리즘을 설계할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "[12정과03-05] 배열 등을 활용하여 중복으로 계산되는 부분 문제들의 답을 저장하여 효율을 높이는 동적계획법의 원리를 설명하고, 이를 활용하여 문제를 해결하는 알고리즘을 설계할 수 있어야 한다. 동적계획법과 분할정복법을 기반으로 한 알고리즘 간의 차이를 여러 측면에서 설명할 수 있어야 한다.",
              "easy": [
                "배열",
                "중복",
                "부분 문제",
                "저장",
                "동적계획법",
                "분할정복법"
              ],
              "normal": [
                "배열",
                "중복",
                "부분 문제",
                "문제",
                "답",
                "저장",
                "효율",
                "동적계획법",
                "원리",
                "문제를 해결하는",
                "해결",
                "알고리즘",
                "설계",
                "분할정복법",
                "차이",
                "여러 측면"
              ],
              "aliases": {},
              "id": "IS-03-AC-EX-03",
              "legacyId": "1ykpcgs-1d42nbt",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g10",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g09",
                  "n66-e0fe5151",
                  "g11",
                  "g12",
                  "g13",
                  "g08",
                  "g14",
                  "n66-26b804cc"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "yaho": [
                "배열 등을 활용하여 중복으로 계산되는 부분 문제들의 답을 저장하여",
                "효율을 높이는 동적계획법의 원리를 설명하고, 이를 활용하여",
                "문제를 해결하는 알고리즘을 설계할 수 있어야 한다",
                "동적계획법과 분할정복법을 기반으로 한 알고리즘 간의 차이를 여러 측면에서 설명할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "탐색으로 알고리즘을 설계하는 방법은 인공지능 분야의 탐색과 추론영역과 연계됨을 인식하고 교수·학습을 구성할 때 관련된 용어가 명확하게 사용되는지 유의하도록 한다.",
              "easy": [
                "탐색",
                "알고리즘",
                "인공지능 분야",
                "추론",
                "용어"
              ],
              "normal": [
                "탐색",
                "알고리즘",
                "설계",
                "인공지능 분야",
                "추론영역",
                "연계",
                "용어",
                "명확하게 사용"
              ],
              "aliases": {},
              "id": "IS-03-AC-CO-01",
              "legacyId": "1dahci5-57jq3b",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g07",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g07",
                  "g08",
                  "g09",
                  "g05",
                  "g10"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "알고리즘 영역에서 제시되는 구체적인 알고리즘은 정보학의 문제 해결 과정에서 중요하게 활용되고 있음을 이해할 수 있도록 실제적인 예시를 통해 교수·학습을 구성하도록 한다. 이때 실제 알고리즘이 적용된 프로그램이나 시각적인 자료를 통해 학습자가 더욱 직관적으로 효율성을 인식하도록 구성하는 방식도 고려할 수 있다.",
              "easy": [
                "알고리즘",
                "구체적인 알고리즘",
                "정보학",
                "문제 해결 과정",
                "시각적인",
                "효율성"
              ],
              "normal": [
                "알고리즘 영역",
                "알고리즘",
                "구체적인 알고리즘",
                "정보학",
                "문제 해결 과정",
                "실제적인 예시",
                "프로그램",
                "시각적인 자료",
                "학습자",
                "직관적으로",
                "효율성"
              ],
              "aliases": {},
              "id": "IS-03-AC-CO-02",
              "legacyId": "1dahci5-735qbn",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g08",
                  "g02",
                  "g03",
                  "g14",
                  "g06"
                ],
                "normal": [
                  "g07",
                  "g01",
                  "g08",
                  "g02",
                  "g03",
                  "g09",
                  "g04",
                  "g05",
                  "g10",
                  "g11",
                  "g06"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g12",
                  "g13"
                ],
                "g05": [
                  "g14",
                  "g15"
                ]
              },
              "yaho": [
                "알고리즘 영역에서 제시되는 구체적인 알고리즘은 정보학의 문제 해결 과정에서",
                "중요하게 활용되고 있음을 이해할 수 있도록 실제적인 예시를 통해 교수·학습을 구성하도록 한다",
                "이때 실제 알고리즘이 적용된 프로그램이나 시각적인 자료를 통해 학습자가 더욱",
                "직관적으로 효율성을 인식하도록 구성하는 방식도 고려할 수 있다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "알고리즘을 적용한 프로그램의 평가 시 알고리즘의 효과성과 효율성을 종합적으로 평가하도록 한다. 특히 다양한 프로그램 환경이나 데이터를 활용하여 설계한 알고리즘이 동일하게 효율적으로 작동하는지를 평가하여 학습 내용이 확장·전이되었는지를 확인하도록 한다.",
              "easy": [
                "알고리즘",
                "효과성",
                "효율성",
                "프로그램 환경",
                "데이터",
                "확장·전이"
              ],
              "normal": [
                "알고리즘",
                "프로그램",
                "평가",
                "효과성",
                "효율성",
                "종합적으로 평가",
                "프로그램 환경",
                "데이터",
                "동일하게",
                "효율적으로 작동",
                "확장·전이",
                "확인"
              ],
              "aliases": {},
              "id": "IS-03-AC-CO-03",
              "legacyId": "1dahci5-5gfpsc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g10",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g08",
                  "g03",
                  "g04",
                  "g09",
                  "g10",
                  "g06",
                  "g13",
                  "g14",
                  "g07",
                  "g12"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "normalSplitMigrations": {
                "g11": [
                  "g13",
                  "g14"
                ]
              }
            },
            {
              "text": "최소 성취수준을 보장하기 위하여 알고리즘을 경험할 수 있는 다양한 시뮬레이션 자료를 제공하고, 프로그래밍 언어가 제공하는 라이브러리 활용 방법을 안내하여 최소한의 알고리즘 적용 활동을 진행할 수 있도록 한다.",
              "easy": [
                "최소 성취수준",
                "알고리즘",
                "시뮬레이션",
                "프로그래밍 언어",
                "라이브러리"
              ],
              "normal": [
                "최소 성취수준",
                "알고리즘",
                "시뮬레이션 자료",
                "프로그래밍 언어",
                "라이브러리",
                "활용 방법",
                "알고리즘 적용 활동"
              ],
              "aliases": {},
              "id": "IS-03-AC-CO-04",
              "legacyId": "1dahci5-hbauxm",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g09",
                  "g06",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g09",
                  "g10"
                ],
                "g05": [
                  "g11",
                  "g12"
                ]
              },
              "yaho": [
                "알고리즘을 경험할 수 있는 다양한 시뮬레이션 자료를 제공하고",
                "프로그래밍 언어가 제공하는 라이브러리 활용 방법을 안내하여",
                "최소한의 알고리즘 적용 활동을 진행할 수 있도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        }
      ]
    },
    "정보과학 프로젝트": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "정보과학 프로젝트를 수행하는 것은 다양한 학문 분야의 문제를 컴퓨팅 관점에서 해결하는 데 필요하다.",
              "easy": [
                "정보과학 프로젝트",
                "학문 분야",
                "컴퓨팅",
                "관점"
              ],
              "normal": [
                "정보과학 프로젝트",
                "다양한 학문 분야",
                "학문 분야",
                "문제",
                "컴퓨팅 관점",
                "해결"
              ],
              "aliases": {},
              "id": "IS-04-CS-KI-01",
              "legacyId": "19een0-odl3t",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "n66-91bcbd20",
                  "g02",
                  "g04",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "프로젝트를 수행할 때, 오픈소스의 활용, 수행된 프로젝트의 공유, 다양한 사람들과의 협업 등은 더 좋은 사회를 만드는 데 도움을 준다.",
              "easy": [
                "프로젝트",
                "오픈소스",
                "공유",
                "협업"
              ],
              "normal": [
                "프로젝트",
                "오픈소스",
                "활용",
                "공유",
                "협업",
                "더 좋은 사회",
                "도움"
              ],
              "aliases": {},
              "id": "IS-04-CS-KI-02",
              "legacyId": "19een0-1wbw83u",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "g07",
                  "n66-0c4865ab"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "문제 발견",
              "easy": [
                "문제 발견"
              ],
              "normal": [
                "문제 발견"
              ],
              "aliases": {},
              "id": "IS-04-CS-KN-01",
              "legacyId": "1gji2b-1q5l4hv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "프로젝트 설계",
              "easy": [
                "프로젝트 설계"
              ],
              "normal": [
                "프로젝트 설계"
              ],
              "aliases": {},
              "id": "IS-04-CS-KN-02",
              "legacyId": "1gji2b-asfz0w",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "오픈소스와 공유",
              "easy": [
                "오픈소스",
                "공유"
              ],
              "normal": [
                "오픈소스",
                "공유"
              ],
              "aliases": {},
              "id": "IS-04-CS-KN-03",
              "legacyId": "1gji2b-5fh90k",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "테스트와 디버깅",
              "easy": [
                "테스트",
                "디버깅"
              ],
              "normal": [
                "테스트",
                "디버깅"
              ],
              "aliases": {},
              "id": "IS-04-CS-KN-04",
              "legacyId": "1gji2b-i5llty",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "다양한 학문 분야에서 컴퓨터과학의 원리를 바탕으로 해결 가능한 문제 탐색하기",
              "easy": [
                "학문 분야",
                "컴퓨터과학",
                "원리"
              ],
              "normal": [
                "다양한 학문 분야",
                "학문 분야",
                "컴퓨터과학",
                "원리",
                "해결 가능한 문제",
                "탐색"
              ],
              "aliases": {},
              "id": "IS-04-CS-PF-01",
              "legacyId": "1eyoxrk-15i8zc9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "n66-2126fb37",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g06",
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "문제를 분석하고, 문제 해결을 위한 프로젝트 설계하기",
              "easy": [
                "문제 해결",
                "프로젝트"
              ],
              "normal": [
                "문제",
                "분석",
                "문제 해결",
                "프로젝트 설계",
                "프로젝트",
                "설계"
              ],
              "aliases": {},
              "id": "IS-04-CS-PF-02",
              "legacyId": "1eyoxrk-quri51",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "n66-00da3f03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "공유된 오픈소스를 활용하여 문제를 해결하는 프로그램 작성하기",
              "easy": [
                "공유",
                "오픈소스"
              ],
              "normal": [
                "공유",
                "오픈소스",
                "활용",
                "문제",
                "해결",
                "프로그램 작성하기",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "IS-04-CS-PF-03",
              "legacyId": "1eyoxrk-1mmaytz",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "n66-2a2d7e17",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "프로젝트 산출물을 평가하고 공유하기",
              "easy": [
                "프로젝트 산출물",
                "평가"
              ],
              "normal": [
                "프로젝트 산출물",
                "평가",
                "공유"
              ],
              "aliases": {},
              "id": "IS-04-CS-PF-04",
              "legacyId": "1eyoxrk-1bab2rm",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "협력적으로 문제를 해결하고 공유하는 태도",
              "easy": [
                "협력적으로",
                "공유"
              ],
              "normal": [
                "협력적으로",
                "문제",
                "해결",
                "공유",
                "태도"
              ],
              "aliases": {},
              "id": "IS-04-CS-VA-01",
              "legacyId": "j8myzy-erszfd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "프로젝트를 수행하는 과정에서 윤리 문제 등 사회적 영향 인식",
              "easy": [
                "윤리 문제",
                "사회적 영향"
              ],
              "normal": [
                "프로젝트",
                "수행",
                "윤리 문제",
                "사회적 영향",
                "인식"
              ],
              "aliases": {},
              "id": "IS-04-CS-VA-02",
              "legacyId": "j8myzy-1jzgd57",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정과04-01] 다양한 학문 분야에서 컴퓨터과학의 기본 개념과 원리를 바탕으로 해결할 수 있는 실생활의 문제를 발견한다.",
              "easy": [
                "학문 분야",
                "컴퓨터과학",
                "기본 개념",
                "원리"
              ],
              "normal": [
                "다양한 학문 분야",
                "학문 분야",
                "컴퓨터과학",
                "기본 개념",
                "원리",
                "실생활",
                "문제",
                "발견"
              ],
              "aliases": {},
              "id": "IS-04-AC-ST-01",
              "legacyId": "1rmtuks-pccu3k",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "n66-f63f047d",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정과04-02] 발견한 문제를 분석하고, 문제를 해결하기 위한 프로젝트 수행 과정을 설계한다.",
              "easy": [
                "분석",
                "수행 과정"
              ],
              "normal": [
                "문제",
                "분석",
                "해결",
                "프로젝트 수행 과정",
                "설계"
              ],
              "aliases": {},
              "id": "IS-04-AC-ST-02",
              "legacyId": "1rmtuks-1jhxua",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12정과04-03] 다양한 오픈소스 및 라이브러리를 활용하여 협력적으로 문제를 해결하기 위한 프로그램을 작성한다.",
              "easy": [
                "오픈소스",
                "라이브러리",
                "협력적으로",
                "프로그램"
              ],
              "normal": [
                "오픈소스",
                "라이브러리",
                "활용",
                "협력적으로",
                "문제",
                "해결",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "IS-04-AC-ST-03",
              "legacyId": "1rmtuks-1kmvlqb",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g07",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정과04-04] 완성도 높은 프로그램을 구현하기 위하여 테스트와 디버깅 과정을 통해 검증한다.",
              "easy": [
                "완성도 높은 프로그램",
                "테스트",
                "디버깅",
                "검증"
              ],
              "normal": [
                "완성도 높은 프로그램",
                "구현",
                "테스트",
                "디버깅",
                "과정",
                "검증"
              ],
              "aliases": {},
              "id": "IS-04-AC-ST-04",
              "legacyId": "1rmtuks-fbn4e9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g06",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "[12정과04-05] 프로젝트의 산출물을 기능적, 윤리적 관점에서 평가하고 결과를 공유한다.",
              "easy": [
                "기능적",
                "윤리적",
                "관점"
              ],
              "normal": [
                "프로젝트",
                "산출물",
                "기능적",
                "윤리적 관점",
                "평가",
                "결과",
                "공유"
              ],
              "aliases": {},
              "id": "IS-04-AC-ST-05",
              "legacyId": "1rmtuks-12dfv21",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g03",
                  "g08",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g07",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g08",
                  "g09"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정과04-02] 프로젝트 수행 과정은 프로그래밍을 활용한 문제 해결 절차 즉, 문제 분석 및 구조화, 효율적으로 해결할 수 있는 알고리즘 설계, 프로그래밍을 통한 자동화, 그리고 검증하는 단계까지 포함하고 있음을 이해하고, 절차에 맞게 문제 해결 과정을 설계할 수 있어야 한다.",
              "easy": [
                "수행 과정",
                "프로그래밍",
                "문제 분석",
                "구조화",
                "알고리즘 설계",
                "검증"
              ],
              "normal": [
                "프로젝트 수행 과정",
                "프로그래밍",
                "문제 해결 절차",
                "문제 분석",
                "구조화",
                "효율적으로 해결",
                "알고리즘 설계",
                "설계",
                "자동화",
                "검증",
                "문제 해결 과정"
              ],
              "aliases": {},
              "id": "IS-04-AC-EX-01",
              "legacyId": "1ykpcgs-lf3pcg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g13",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g08",
                  "g02",
                  "g03",
                  "g09",
                  "g04",
                  "g11",
                  "g06",
                  "g07",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g12",
                  "g13"
                ]
              },
              "yaho": [
                "활용한 문제 해결 절차 즉, 문제 분석 및 구조화, 효율적으로 해결할 수 있는 알고리즘 설계",
                "프로그래밍을 통한 자동화, 그리고 검증하는 단계까지 포함하고 있음을 이해하고",
                "절차에 맞게 문제 해결 과정을 설계할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "실생활의 다양한 문제를 발견하는 활동에서는 환경, 생태, 자연의 위기 등 생태 관련 주제도 포함될 수 있음을 안내하고, 이를 효율적으로 해결하는 것은 에너지 절약을 비롯한 환경을 보호하는 것과 관계가 있음을 인식할 수 있도록 한다.",
              "easy": [
                "환경",
                "생태",
                "자연",
                "위기",
                "에너지 절약"
              ],
              "normal": [
                "실생활",
                "문제",
                "환경",
                "생태",
                "자연의 위기",
                "생태 관련 주제",
                "효율적으로 해결",
                "에너지 절약",
                "보호",
                "관계"
              ],
              "aliases": {},
              "id": "IS-04-AC-CO-01",
              "legacyId": "1dahci5-t2eafa",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g11",
                  "g12",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g09",
                  "g05",
                  "g06",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g11",
                  "g12"
                ]
              },
              "yaho": [
                "활동에서는 환경, 생태, 자연의 위기 등 생태 관련 주제도 포함될 수 있음을 안내하고",
                "이를 효율적으로 해결하는 것은 에너지 절약을 비롯한 환경을 보호하는 것과",
                "관계가 있음을 인식할 수 있도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "프로젝트 활동은 주어진 문제를 해결하기 위한 알고리즘 설계 및 프로그래밍 과정을 포함하도록 교수·학습을 구성하며 주제 선정, 프로그래밍 언어 선정 등의 절차는 학습자 간의 협의를 통하여 민주적 절차로 이루어질 수 있도록 한다.",
              "easy": [
                "프로젝트 활동",
                "알고리즘 설계",
                "프로그래밍",
                "주제 선정",
                "프로그래밍 언어"
              ],
              "normal": [
                "프로젝트 활동",
                "문제",
                "알고리즘 설계",
                "프로그래밍",
                "주제 선정",
                "프로그래밍 언어 선정",
                "절차",
                "학습자",
                "협의",
                "민주적 절차"
              ],
              "aliases": {},
              "id": "IS-04-AC-CO-02",
              "legacyId": "1dahci5-i5l8ip",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g08",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g13",
                  "g09",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g10",
                  "g11"
                ],
                "g07": [
                  "g12",
                  "g13"
                ]
              },
              "yaho": [
                "해결하기 위한 알고리즘 설계 및 프로그래밍 과정을 포함하도록 교수·학습을 구성하며",
                "주제 선정, 프로그래밍 언어 선정 등의 절차는 학습자 간의 협의를 통하여",
                "민주적 절차로 이루어질 수 있도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "프로젝트를 해결하는 과정은 가능한 모둠별로 진행하고, 자신이 맡은 역할에 충실한 방식으로 협업이 원활하게 진행되도록 교사가 중재하도록 한다. 프로그래밍 과정에서는 세부적인 기능들을 모두 구현하는 것보다는 공개된 프로그램 코드나 프로그래밍 언어에서 제공하는 라이브러리를 적극적으로 활용하여, 목표로 하는 기능을 충분히 구현하고 프로젝트 과제를 해결할 수 있도록 한다.",
              "easy": [
                "모둠",
                "협업",
                "프로그램 코드",
                "프로그래밍 언어",
                "라이브러리",
                "프로젝트 과제"
              ],
              "normal": [
                "해결",
                "모둠",
                "역할",
                "협업",
                "교사",
                "중재",
                "프로그래밍 과정",
                "프로그래밍",
                "세부적인 기능",
                "기능",
                "구현",
                "공개된 프로그램 코드",
                "프로그래밍 언어",
                "라이브러리",
                "적극적으로 활용",
                "활용",
                "프로젝트 과제"
              ],
              "aliases": {},
              "id": "IS-04-AC-CO-03",
              "legacyId": "1dahci5-12xpwgj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g13",
                  "g05",
                  "g07"
                ],
                "normal": [
                  "g16",
                  "g01",
                  "g02",
                  "g03",
                  "g08",
                  "g09",
                  "n66-daa966fe",
                  "g10",
                  "g11",
                  "g06",
                  "g15",
                  "g12",
                  "g13",
                  "g05",
                  "n66-b41dd11b",
                  "g14",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "yaho": [
                "프로젝트를 해결하는 과정은 가능한 모둠별로 진행하고",
                "자신이 맡은 역할에 충실한 방식으로 협업이 원활하게 진행되도록 교사가 중재하도록 한다",
                "세부적인 기능들을 모두 구현하는 것보다는 공개된 프로그램 코드나",
                "프로그래밍 언어에서 제공하는 라이브러리를 적극적으로 활용하여",
                "목표로 하는 기능을 충분히 구현하고 프로젝트 과제를 해결할 수 있도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "프로젝트 주제에 따라 목적에 맞는 소프트웨어를 제작하는 활동이나 특정 문제를 해결하는 알고리즘을 설계하는 등 다양한 수준의 활동이 가능함을 이해하고 학생들의 역량과 환경에 따라 적절한 형태로 운영할 수 있도록 다양한 사례를 제시하고 활용하도록 한다.",
              "easy": [
                "프로젝트 주제",
                "소프트웨어",
                "알고리즘",
                "역량",
                "환경"
              ],
              "normal": [
                "프로젝트 주제",
                "목적",
                "소프트웨어",
                "제작",
                "활동",
                "문제",
                "알고리즘",
                "설계",
                "다양한 수준의 활동",
                "학생",
                "역량",
                "환경",
                "적절한 형태",
                "사례"
              ],
              "aliases": {},
              "id": "IS-04-AC-CO-04",
              "legacyId": "1dahci5-16azxuu",
              "sourceDoc": "교육부 고시 제2022-33호 [별책20] 과학 계열 선택 과목 교육과정(정보과학)",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g02",
                  "g08",
                  "g04",
                  "g09",
                  "g03",
                  "g10",
                  "g11",
                  "g12",
                  "g05",
                  "g06",
                  "g13",
                  "g14"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "맞는 소프트웨어를 제작하는 활동이나 특정 문제를 해결하는 알고리즘을 설계하는",
                "등 다양한 수준의 활동이 가능함을 이해하고",
                "학생들의 역량과 환경에 따라 적절한 형태로 운영할 수 있도록 다양한 사례를 제시하고 활용하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        }
      ]
    },
    "과목 공통": {
      "character-goal": [
        {
          "title": "성격",
          "lines": [
            {
              "id": "IS-CG-CHAR-01",
              "text": "‘정보과학’은 컴퓨터과학과 소프트웨어 공학에 대한 깊이 있는 학문적 이해를 바탕으로 디지털 사회의 복잡한 문제를 이해하고, 미래 사회에 발생 가능한 문제를 해결하는 데 도움이 되는 문제 분석, 구조화, 해결을 위한 알고리즘 설계가 프로그래밍을 통해 구체화되는 과정을 경험할 수 있게 한다.",
              "easy": [
                "컴퓨터과학",
                "소프트웨어 공학",
                "문제 분석, 구조화",
                "알고리즘 설계",
                "프로그래밍"
              ],
              "normal": [
                "컴퓨터과학",
                "소프트웨어 공학",
                "문제 분석, 구조화",
                "알고리즘 설계",
                "프로그래밍",
                "깊이 있는 학문적 이해"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-jzqeu4",
                  "g-xa92tf",
                  "g-1900sjo",
                  "g-1r1qtbb",
                  "g-1dt4rs"
                ],
                "normal": [
                  "g-jzqeu4",
                  "g-xa92tf",
                  "g-1900sjo",
                  "g-1r1qtbb",
                  "g-1dt4rs",
                  "g-136lovj"
                ]
              }
            },
            {
              "id": "IS-CG-CHAR-02",
              "text": "소프트웨어에 대한 깊이 있는 학습을 기반으로 대학의 소프트웨어 관련 다양한 전공과 연계되는 기초 지식을 습득하고, 컴퓨팅의 기본 개념과 원리, 컴퓨팅 시스템 등을 활용한 심도 있는 문제 해결 역량을 함양한다.",
              "easy": [
                "전공과 연계되는 기초 지식",
                "컴퓨팅의 기본 개념과 원리",
                "심도 있는 문제 해결 역량"
              ],
              "normal": [
                "전공과 연계되는 기초 지식",
                "컴퓨팅의 기본 개념과 원리",
                "심도 있는 문제 해결 역량"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-dyvgji",
                  "g-w5p9t7",
                  "g-1oirt8c"
                ],
                "normal": [
                  "g-dyvgji",
                  "g-w5p9t7",
                  "g-1oirt8c"
                ]
              }
            },
            {
              "id": "IS-CG-CHAR-03",
              "text": "이를 통해 실세계 및 타 학문 분야의 문제를 융합적이고 창의적으로 해결할 수 있는 역량을 갖춘 디지털 민주시민으로 성장하게 된다.",
              "easy": [
                "융합적이고 창의적으로 해결",
                "디지털 민주시민"
              ],
              "normal": [
                "융합적이고 창의적으로 해결",
                "디지털 민주시민"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-pge38w",
                  "g-17uegvv"
                ],
                "normal": [
                  "g-pge38w",
                  "g-17uegvv"
                ]
              }
            }
          ]
        },
        {
          "title": "목표",
          "lines": [
            {
              "id": "IS-CG-GOAL-00",
              "text": "고등학교 ‘정보과학’은 컴퓨터과학의 기본 개념과 원리, 컴퓨팅 기술을 기반으로 디지털 사회를 살아가는 데 필요한 기본 역량을 함양하고, 실생활에서 발생하는 문제와 다양한 학문 분야의 문제를 융합적으로 해결하기 위한 정보과학적 방법론을 습득하여 해결할 수 있는 능력을 기르는 데 중점을 둔다.",
              "easy": [
                "컴퓨터과학의 기본 개념과 원리",
                "컴퓨팅 기술",
                "정보과학적 방법론",
                "융합적으로 해결"
              ],
              "normal": [
                "컴퓨터과학의 기본 개념과 원리",
                "컴퓨팅 기술",
                "정보과학적 방법론",
                "융합적으로 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1dqyloq",
                  "g-1m9vb5y",
                  "g-wpuztu",
                  "g-1kmarjk"
                ],
                "normal": [
                  "g-1dqyloq",
                  "g-1m9vb5y",
                  "g-wpuztu",
                  "g-1kmarjk"
                ]
              }
            },
            {
              "id": "IS-CG-GOAL-01",
              "text": "(1) 문제를 해결하기 위한 프로그래밍 과정을 통해 정확하고 효율적으로 작동하는 소프트웨어를 개발할 수 있는 능력을 기른다.",
              "easy": [
                "프로그래밍 과정",
                "정확하고 효율적으로",
                "소프트웨어를 개발"
              ],
              "normal": [
                "프로그래밍 과정",
                "정확하고 효율적으로",
                "소프트웨어를 개발"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-o9l0kg",
                  "g-13lanxr",
                  "g-min7le"
                ],
                "normal": [
                  "g-o9l0kg",
                  "g-13lanxr",
                  "g-min7le"
                ]
              }
            },
            {
              "id": "IS-CG-GOAL-02",
              "text": "(2) 데이터의 처리를 위해 선행되어야 할 데이터의 구조에 대해 파악하고 효율적인 문제 해결을 위한 데이터 구조화의 가치를 파악하는 태도를 기른다.",
              "easy": [
                "데이터의 구조",
                "데이터 구조화의 가치"
              ],
              "normal": [
                "데이터의 구조",
                "데이터 구조화의 가치",
                "효율적인 문제 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-fx5r0n",
                  "g-1t040uz"
                ],
                "normal": [
                  "g-fx5r0n",
                  "g-1t040uz",
                  "g-u2ngt0"
                ]
              }
            },
            {
              "id": "IS-CG-GOAL-03",
              "text": "(3) 실생활 및 다양한 학문 분야의 문제를 해결하는 과정을 통해 알고리즘 설계 및 구현 능력을 기른다.",
              "easy": [
                "알고리즘 설계 및 구현"
              ],
              "normal": [
                "알고리즘 설계 및 구현",
                "실생활 및 다양한 학문 분야"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-5xgvzn"
                ],
                "normal": [
                  "g-5xgvzn",
                  "g-16r6g5m"
                ]
              }
            },
            {
              "id": "IS-CG-GOAL-04",
              "text": "(4) 컴퓨터과학의 기본 개념과 원리에 기반하여 타 학문 분야의 문제를 해결하기 위한 융합적 설계, 새로운 방법론 활용 등의 능력을 기른다.",
              "easy": [
                "융합적 설계",
                "새로운 방법론 활용"
              ],
              "normal": [
                "융합적 설계",
                "새로운 방법론 활용",
                "컴퓨터과학의 기본 개념과 원리"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ksj02w",
                  "g-wugnze"
                ],
                "normal": [
                  "g-1ksj02w",
                  "g-wugnze",
                  "g-1gj0zj2"
                ]
              }
            }
          ]
        }
      ],
      "teaching-evaluation": [
        {
          "title": "교수·학습의 방향",
          "lines": [
            {
              "id": "IS-TE-DIR-01",
              "text": "(라) ‘정보과학’ 과목의 교수·학습은 컴퓨터과학 분야의 깊이 있는 이해를 바탕으로 문제를 효율적으로 해결하는 역량을 향상하는 데 중점을 둔다. 또한 ‘정보과학’ 과목 내의 내용 영역, 다른 교과 및 비교과 활동과의 융합을 통해 정보 관련 역량의 확장을 꾀하고 학생의 역량이 다양한 분야에 전이될 수 있도록 한다.",
              "easy": [
                "컴퓨터과학 분야의 깊이 있는 이해",
                "효율적으로 해결",
                "정보 관련 역량의 확장",
                "다양한 분야에 전이"
              ],
              "normal": [
                "컴퓨터과학 분야의 깊이 있는 이해",
                "효율적으로 해결",
                "정보 관련 역량의 확장",
                "다양한 분야에 전이"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ypgaju",
                  "g-1r1g6xw",
                  "g-1q8utsg",
                  "g-wpq0ou"
                ],
                "normal": [
                  "g-1ypgaju",
                  "g-1r1g6xw",
                  "g-1q8utsg",
                  "g-wpq0ou"
                ]
              }
            }
          ]
        },
        {
          "title": "교수·학습 방법",
          "lines": [
            {
              "id": "IS-TE-MET-01",
              "text": "(가) 컴퓨팅 사고력 및 인공지능 소양을 함양하기 위해 문제기반학습, 프로젝트 기반학습, 디자인기반학습, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
              "easy": [
                "컴퓨팅 사고력",
                "인공지능 소양",
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "탐구학습"
              ],
              "normal": [
                "컴퓨팅 사고력",
                "인공지능 소양",
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "탐구학습"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1q8av04",
                  "g-15y2nfv",
                  "g-1eoevya",
                  "g-17rhukh",
                  "g-1bldaq",
                  "g-pwhws2"
                ],
                "normal": [
                  "g-1q8av04",
                  "g-15y2nfv",
                  "g-1eoevya",
                  "g-17rhukh",
                  "g-1bldaq",
                  "g-pwhws2"
                ]
              }
            },
            {
              "id": "IS-TE-MET-02",
              "text": "(다) 개인적인 발전과 함께 협력적인 문제 해결력을 기르기 위해 프로젝트 학습 시에는 모둠 프로젝트, 짝 프로그래밍, 집단 탐구(GI) 등 목표 달성을 위한 적절한 협력적 교수·학습 방법을 선택하여 활용한다.",
              "easy": [
                "모둠 프로젝트",
                "짝 프로그래밍",
                "집단 탐구(GI)",
                "협력적 교수·학습 방법"
              ],
              "normal": [
                "모둠 프로젝트",
                "짝 프로그래밍",
                "집단 탐구(GI)",
                "협력적 교수·학습 방법"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1xu6dfs",
                  "g-oknqil",
                  "g-9kwynt",
                  "g-17ct7ur"
                ],
                "normal": [
                  "g-1xu6dfs",
                  "g-oknqil",
                  "g-9kwynt",
                  "g-17ct7ur"
                ]
              }
            }
          ]
        },
        {
          "title": "평가의 방향",
          "lines": [
            {
              "id": "IS-TE-EVD-01",
              "text": "(다) 구체적인 평가 루브릭을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
              "easy": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "normal": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-b7vzfl",
                  "g-1csmb8",
                  "g-dtcn4o"
                ],
                "normal": [
                  "g-b7vzfl",
                  "g-1csmb8",
                  "g-dtcn4o"
                ]
              }
            },
            {
              "id": "IS-TE-EVD-02",
              "text": "(라) 단순하고 지엽적인 지식의 평가보다는 문제를 해결하는 과정을 통합적으로 관찰하고 평가할 수 있는 계획을 수립한다.",
              "easy": [
                "단순하고 지엽적인 지식의 평가",
                "문제를 해결하는 과정",
                "통합적으로 관찰하고 평가"
              ],
              "normal": [
                "단순하고 지엽적인 지식의 평가",
                "문제를 해결하는 과정",
                "통합적으로 관찰하고 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1uegio0",
                  "g-3csbrj",
                  "g-jjnzac"
                ],
                "normal": [
                  "g-1uegio0",
                  "g-3csbrj",
                  "g-jjnzac"
                ]
              }
            },
            {
              "id": "IS-TE-EVD-03",
              "text": "(마) 개념적이거나 기능적으로 명확하게 파악할 수 있는 부분은 정량적 평가를 실시하고, 결과물의 품질이나 심미적 부분을 평가할 때는 정성적 평가를 실시한다.",
              "easy": [
                "정량적 평가",
                "정성적 평가"
              ],
              "normal": [
                "정량적 평가",
                "정성적 평가",
                "결과물의 품질이나 심미적 부분"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1b5nwj",
                  "g-1wqe9zv"
                ],
                "normal": [
                  "g-1b5nwj",
                  "g-1wqe9zv",
                  "g-1nvh9kw"
                ]
              }
            }
          ]
        },
        {
          "title": "평가 방법",
          "lines": [
            {
              "id": "IS-TE-EVM-01",
              "text": "(가) 성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 평가 포트폴리오를 계획한다. 예를 들면, 관찰 평가, 서술형평가, 수행평가 등을 활용하거나, 자기 평가, 동료 평가 등과 같은 다면적 평가를 실행한다.",
              "easy": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행평가",
                "자기 평가",
                "동료 평가"
              ],
              "normal": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행평가",
                "자기 평가",
                "동료 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-bkes4t",
                  "g-1r524ct",
                  "g-8dhmri",
                  "g-fp87bi",
                  "g-1vehem5",
                  "g-10a5l2i"
                ],
                "normal": [
                  "g-bkes4t",
                  "g-1r524ct",
                  "g-8dhmri",
                  "g-fp87bi",
                  "g-1vehem5",
                  "g-10a5l2i"
                ]
              }
            },
            {
              "id": "IS-TE-EVM-02",
              "text": "(나) 평가 내용이나 방법에 따라 다양한 디지털 도구(프로그램 자동 평가시스템(online judge 등), 학습관리시스템(LMS) 등)를 활용할 수 있으며, 평가 이전에 학생이 디지털 도구를 다룰 수 있도록 교육하여 평가의 불이익이 없도록 계획한다.",
              "easy": [
                "프로그램 자동 평가시스템",
                "online judge",
                "학습관리시스템(LMS)",
                "평가의 불이익이 없도록"
              ],
              "normal": [
                "프로그램 자동 평가시스템",
                "online judge",
                "학습관리시스템(LMS)",
                "평가의 불이익이 없도록"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-nixoap",
                  "g-njd2of",
                  "g-1oblzly",
                  "g-1m4bk82"
                ],
                "normal": [
                  "g-nixoap",
                  "g-njd2of",
                  "g-1oblzly",
                  "g-1m4bk82"
                ]
              }
            },
            {
              "id": "IS-TE-EVM-03",
              "text": "(다) 알고리즘을 평가할 때 가능하면 프로그램 자동 평가시스템을 활용하여 컴퓨팅 시스템에서 실제로 구현되는 결과를 평가하도록 하며, 해당 방법을 활용하기 어려운 경우 대표성을 지니는 데이터를 선정하여 평가 문항과 루브릭을 구성하고, 지필평가나 수행평가의 형태로 평가를 진행하여 공정한 평가가 되도록 한다.",
              "easy": [
                "프로그램 자동 평가시스템",
                "실제로 구현되는 결과",
                "대표성을 지니는 데이터",
                "평가 문항과 루브릭",
                "공정한 평가"
              ],
              "normal": [
                "프로그램 자동 평가시스템",
                "실제로 구현되는 결과",
                "대표성을 지니는 데이터",
                "평가 문항과 루브릭",
                "공정한 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1fke1ce",
                  "g-j5gd92",
                  "g-grs3xj",
                  "g-1sjbkeh",
                  "g-kel8ep"
                ],
                "normal": [
                  "g-1fke1ce",
                  "g-j5gd92",
                  "g-grs3xj",
                  "g-1sjbkeh",
                  "g-kel8ep"
                ]
              }
            }
          ]
        }
      ]
    }
  },
  "high-info": {
    "컴퓨팅 시스템": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "하드웨어와 소프트웨어의 유기적 연결을 통해 동작하는 컴퓨팅 시스템은 사회적, 기술적 가치를 높이는 데 활용된다.",
              "easy": [
                "하드웨어",
                "소프트웨어",
                "컴퓨팅 시스템",
                "기술적 가치"
              ],
              "normal": [
                "하드웨어",
                "소프트웨어",
                "유기적 연결",
                "컴퓨팅 시스템",
                "사회적",
                "기술적 가치"
              ],
              "id": "HI-01-CS-KI-01",
              "legacyId": "19een0-vygxwv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "네트워크는 여러 개의 컴퓨팅 시스템 간 연결의 원리를 파악하고 통신을 통해 데이터 공유를 가능하게 한다.",
              "easy": [
                "네트워크",
                "컴퓨팅 시스템",
                "통신",
                "데이터 공유"
              ],
              "normal": [
                "네트워크",
                "컴퓨팅 시스템",
                "연결의 원리",
                "통신",
                "데이터 공유"
              ],
              "id": "HI-01-CS-KI-02",
              "legacyId": "19een0-14tpl33",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "네트워크의 구성",
              "easy": [
                "네트워크",
                "구성"
              ],
              "normal": [
                "네트워크",
                "구성"
              ],
              "id": "HI-01-CS-KN-01",
              "legacyId": "1gji2b-ka370i",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "사물인터넷 시스템의 구성 및 동작 원리",
              "easy": [
                "사물인터넷 시스템",
                "구성",
                "동작 원리"
              ],
              "normal": [
                "사물인터넷 시스템",
                "구성",
                "동작 원리"
              ],
              "id": "HI-01-CS-KN-02",
              "legacyId": "1gji2b-1eibtre",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "컴퓨팅 시스템 간 네트워크를 구성하고 공유 설정하기",
              "easy": [
                "컴퓨팅 시스템",
                "네트워크"
              ],
              "normal": [
                "컴퓨팅 시스템",
                "네트워크",
                "구성",
                "공유 설정"
              ],
              "id": "HI-01-CS-PF-01",
              "legacyId": "1eyoxrk-1z083o7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "문제 해결에 적합한 사물인터넷 시스템 설계하기",
              "easy": [
                "문제 해결",
                "사물인터넷 시스템"
              ],
              "normal": [
                "문제 해결",
                "사물인터넷 시스템",
                "설계"
              ],
              "id": "HI-01-CS-PF-02",
              "legacyId": "1eyoxrk-1lbotge",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "협력적 의사소통을 위해 네트워크 환경을 적극적으로 활용하는 자세",
              "easy": [
                "의사소통",
                "네트워크 환경"
              ],
              "normal": [
                "협력적 의사소통",
                "네트워크 환경",
                "적극적으로 활용",
                "자세"
              ],
              "id": "HI-01-CS-VA-01",
              "legacyId": "j8myzy-w4j31a",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g07",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "사물인터넷 시스템으로 인한 사회 변화에 대처하는 능동적 태도",
              "easy": [
                "사물인터넷 시스템",
                "사회 변화"
              ],
              "normal": [
                "사물인터넷 시스템",
                "사회 변화",
                "대처",
                "능동적 태도"
              ],
              "id": "HI-01-CS-VA-02",
              "legacyId": "j8myzy-1qgv5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정01-01] 유·무선 네트워크의 특성을 이해하고, 컴퓨팅 시스템 간 공유, 협력, 소통을 위한 네트워크 환경을 구성한다.",
              "easy": [
                "공유",
                "협력",
                "소통",
                "네트워크 환경"
              ],
              "normal": [
                "유·무선 네트워크",
                "특성",
                "컴퓨팅 시스템",
                "공유",
                "협력",
                "소통",
                "네트워크 환경",
                "구성"
              ],
              "aliases": {},
              "id": "HI-01-AC-ST-01",
              "legacyId": "1rmtuks-1cc4qbe",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g07",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정01-02] 사물인터넷의 구성과 동작 원리를 분석하고, 사물인터넷 기술로 인한 개인의 삶과 사회의 변화를 예측한다.",
              "easy": [
                "사물인터넷",
                "동작 원리",
                "사물인터넷 기술",
                "개인"
              ],
              "normal": [
                "사물인터넷",
                "구성",
                "동작 원리",
                "분석",
                "사물인터넷 기술",
                "개인의 삶",
                "사회",
                "변화",
                "예측"
              ],
              "aliases": {},
              "id": "HI-01-AC-ST-02",
              "legacyId": "1rmtuks-2a7gy2",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g08",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g07",
                  "g08",
                  "g04",
                  "g05",
                  "g06",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "[12정01-03] 문제 해결에 적합한 피지컬 컴퓨팅 시스템 장치를 선택하여 사물인터넷 시스템을 설계한다.",
              "easy": [
                "문제 해결",
                "피지컬 컴퓨팅",
                "장치",
                "사물인터넷 시스템"
              ],
              "normal": [
                "문제 해결",
                "피지컬 컴퓨팅 시스템",
                "장치",
                "선택",
                "사물인터넷 시스템",
                "설계"
              ],
              "aliases": {},
              "id": "HI-01-AC-ST-03",
              "legacyId": "1rmtuks-121ljkk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g08",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g07",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g08",
                  "g09"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정01-01] 네트워크의 개념과 구성요소, 유·무선 통신의 특성 등을 구체적인 예를 들어 설명하고 다양한 컴퓨팅 시스템 및 사물인터넷 장치에서 활용 가능한 유·무선 네트워크 환경을 구성할 수 있어야 한다.",
              "easy": [
                "네트워크",
                "구성요소",
                "유·무선 통신",
                "사물인터넷 장치",
                "네트워크 환경"
              ],
              "normal": [
                "네트워크",
                "개념",
                "구성요소",
                "구성",
                "유·무선 통신",
                "특성",
                "컴퓨팅 시스템",
                "사물인터넷 장치",
                "유·무선 네트워크 환경"
              ],
              "aliases": {},
              "id": "HI-01-AC-EX-01",
              "legacyId": "1ykpcgs-m14yyw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g11"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g09",
                  "g03",
                  "g07",
                  "g08",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g10",
                  "g11"
                ]
              },
              "yaho": [
                "유·무선 통신의 특성 등을 구체적인 예를 들어 설명하고",
                "다양한 컴퓨팅 시스템 및 사물인터넷 장치에서 활용 가능한",
                "유·무선 네트워크 환경을 구성할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "중학교에서 학습한 피지컬 컴퓨팅 시스템 및 프로그래밍 언어를 활용하거나 ‘알고리즘과 프로그래밍’ 영역과 연계하는 등 학습자의 수준과 학습 환경을 고려하여 교육과정을 재구성할 수 있다.",
              "easy": [
                "피지컬 컴퓨팅",
                "프로그래밍 언어",
                "알고리즘",
                "학습자",
                "학습 환경"
              ],
              "normal": [
                "중학교",
                "피지컬 컴퓨팅 시스템",
                "프로그래밍 언어",
                "알고리즘과 프로그래밍",
                "학습자",
                "수준",
                "학습 환경",
                "교육과정",
                "재구성"
              ],
              "aliases": {},
              "id": "HI-01-AC-CO-01",
              "legacyId": "1dahci5-10qyvxc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g10",
                  "g02",
                  "g12",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g07",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g10",
                  "g11"
                ],
                "g03": [
                  "g12",
                  "g13"
                ]
              },
              "yaho": [
                "중학교에서 학습한 피지컬 컴퓨팅 시스템 및 프로그래밍 언어를 활용하거나",
                "‘알고리즘과 프로그래밍’ 영역과 연계하는 등 학습자의 수준과 학습 환경을 고려하여",
                "교육과정을 재구성할 수 있다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "네트워크 이론이나 유·무선 통신 등의 개념적인 내용보다는 사물인터넷 장치를 이해하고 구성하기 위한 관점에서 유·무선 네트워크를 활용할 수 있도록 교수·학습을 구성하도록 한다.",
              "easy": [
                "네트워크",
                "유·무선 통신",
                "사물인터넷 장치",
                "유·무선 네트워크"
              ],
              "normal": [
                "네트워크 이론",
                "유·무선 통신",
                "개념적인 내용",
                "사물인터넷 장치",
                "구성",
                "관점",
                "유·무선 네트워크",
                "활용"
              ],
              "aliases": {},
              "id": "HI-01-AC-CO-02",
              "legacyId": "1dahci5-11wc8pj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g09",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g06",
                  "g07",
                  "g04",
                  "g08"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g09",
                  "g10"
                ]
              },
              "yaho": [
                "네트워크 이론이나 유·무선 통신 등의 개념적인 내용보다는 사물인터넷 장치를 이해하고",
                "구성하기 위한 관점에서 유·무선 네트워크를 활용할 수 있도록 교수·학습을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "사물인터넷 시스템 구현 시 복잡한 통신 및 회로 설계 등 피지컬 컴퓨팅 시스템의 하드웨어를 구성하는 내용보다는 네트워크를 통한 데이터의 이동과 이를 활용한 창의적인 아이디어를 구현하는 과정에 중점을 두어 활동을 구성하고 설계 과정과 구현 결과를 다양한 방식으로 누적한 후 평가하여 최소 성취수준을 보장하도록 한다.",
              "easy": [
                "사물인터넷 시스템",
                "피지컬 컴퓨팅",
                "하드웨어",
                "네트워크",
                "창의적인",
                "아이디어"
              ],
              "normal": [
                "사물인터넷 시스템",
                "구현",
                "통신",
                "회로 설계",
                "피지컬 컴퓨팅 시스템",
                "하드웨어",
                "네트워크",
                "데이터의 이동",
                "창의적인 아이디어",
                "설계 과정",
                "구현 결과",
                "누적",
                "평가",
                "최소 성취수준"
              ],
              "aliases": {},
              "id": "HI-01-AC-CO-03",
              "legacyId": "1dahci5-1easw2o",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g15",
                  "g03",
                  "g04",
                  "g19",
                  "g20"
                ],
                "normal": [
                  "g01",
                  "g10",
                  "g08",
                  "g09",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g11",
                  "g12",
                  "g13",
                  "g14",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g15",
                  "g16"
                ],
                "g05": [
                  "g17",
                  "g18"
                ],
                "g06": [
                  "g19",
                  "g20"
                ]
              },
              "yaho": [
                "통신 및 회로 설계 등 피지컬 컴퓨팅 시스템의 하드웨어를 구성하는 내용보다는",
                "네트워크를 통한 데이터의 이동과 이를 활용한 창의적인 아이디어를 구현하는",
                "과정에 중점을 두어 활동을 구성하고 설계 과정과 구현 결과를 다양한 방식으로 누적한 후 평가하여",
                "최소 성취수준을 보장하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            }
          ]
        }
      ]
    },
    "데이터": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "데이터의 압축과 암호화는 데이터를 효율적으로 관리하고 보호하는 데 도움을 준다.",
              "easy": [
                "압축",
                "암호화",
                "보호"
              ],
              "normal": [
                "데이터",
                "압축",
                "암호화",
                "효율적으로 관리",
                "보호"
              ],
              "id": "HI-02-CS-KI-01",
              "legacyId": "19een0-1tew42u",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "수집된 데이터 간의 관계를 파악하여 구조화하는 것은 데이터를 통해 새로운 지식을 찾는 데 도움을 준다.",
              "easy": [
                "데이터",
                "관계",
                "구조화",
                "지식"
              ],
              "normal": [
                "데이터 간의 관계",
                "데이터",
                "관계",
                "파악",
                "구조화",
                "새로운 지식",
                "찾는 데 도움"
              ],
              "id": "HI-02-CS-KI-02",
              "legacyId": "19een0-1x1zjqg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g07"
                ],
                "normal": [
                  "n66-ce891404",
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04",
                  "n66-32ea2efa"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "빅데이터 기술을 활용하여 데이터를 수집, 처리, 관리하는 과정에서 윤리적인 문제를 고려해서 수행해야 올바른 결과가 도출된다.",
              "easy": [
                "빅데이터",
                "수집",
                "처리",
                "관리"
              ],
              "normal": [
                "빅데이터 기술",
                "데이터",
                "수집",
                "처리",
                "관리",
                "윤리적인 문제",
                "고려",
                "올바른 결과"
              ],
              "id": "HI-02-CS-KI-03",
              "legacyId": "19een0-gqeujp",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g08",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "n66-06cd6e9c",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g08",
                  "g09"
                ],
                "g06": [
                  "g10",
                  "g11"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "디지털 데이터 압축과 암호화",
              "easy": [
                "디지털 데이터",
                "압축",
                "암호화"
              ],
              "normal": [
                "디지털 데이터",
                "압축",
                "암호화"
              ],
              "id": "HI-02-CS-KN-01",
              "legacyId": "1gji2b-po9rvl",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "빅데이터 개념과 분석",
              "easy": [
                "빅데이터",
                "개념",
                "분석"
              ],
              "normal": [
                "빅데이터",
                "개념",
                "분석"
              ],
              "id": "HI-02-CS-KN-02",
              "legacyId": "1gji2b-pnezhb",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "디지털 데이터 압축의 효율성을 분석하고 평가하기",
              "easy": [
                "디지털 데이터",
                "압축"
              ],
              "normal": [
                "디지털 데이터 압축",
                "효율성",
                "분석",
                "평가"
              ],
              "id": "HI-02-CS-PF-01",
              "legacyId": "1eyoxrk-57bv6a",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "암호화 활용 사례 탐색하기",
              "easy": [
                "암호화",
                "활용 사례",
                "탐색"
              ],
              "normal": [
                "암호화",
                "활용 사례",
                "탐색"
              ],
              "id": "HI-02-CS-PF-02",
              "legacyId": "1eyoxrk-1qk2d8t",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g05"
                ]
              }
            },
            {
              "text": "빅데이터 기술을 활용하여 데이터를 분석하고 시각화하기",
              "easy": [
                "빅데이터",
                "시각화"
              ],
              "normal": [
                "빅데이터 기술",
                "데이터",
                "분석",
                "시각화"
              ],
              "id": "HI-02-CS-PF-03",
              "legacyId": "1eyoxrk-j7jce1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g05",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "효율적인 데이터 표현의 긍정적 측면을 활용하려는 자세",
              "easy": [
                "효율적인 데이터 표현",
                "긍정적 측면"
              ],
              "normal": [
                "효율적인 데이터 표현",
                "긍정적 측면",
                "활용",
                "자세"
              ],
              "id": "HI-02-CS-VA-01",
              "legacyId": "j8myzy-2pt2s5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g02"
                ],
                "normal": [
                  "g04",
                  "g02",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "데이터를 안전하게 관리하고 보호하는 태도",
              "easy": [
                "안전하게 관리",
                "보호하는 태도"
              ],
              "normal": [
                "데이터",
                "안전하게 관리",
                "보호하는 태도",
                "보호",
                "태도"
              ],
              "id": "HI-02-CS-VA-02",
              "legacyId": "j8myzy-vspy61",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "c66-4ae978be"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-4ae978be",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "빅데이터 분석의 가치에 대한 사회적, 윤리적 측면의 성찰",
              "easy": [
                "사회적",
                "윤리적"
              ],
              "normal": [
                "빅데이터 분석",
                "가치",
                "사회적",
                "윤리적 측면",
                "성찰"
              ],
              "id": "HI-02-CS-VA-03",
              "legacyId": "j8myzy-194ujg9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정02-01] 디지털 데이터 압축의 개념과 필요성을 이해하고, 압축의 효율성을 분석하여 평가한다.",
              "easy": [
                "디지털 데이터",
                "압축",
                "필요성",
                "효율성"
              ],
              "normal": [
                "디지털 데이터 압축",
                "압축",
                "개념",
                "필요성",
                "효율성",
                "분석",
                "평가"
              ],
              "aliases": {},
              "id": "HI-02-AC-ST-01",
              "legacyId": "1rmtuks-1es6fhv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g07",
                  "g08",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g08",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "[12정02-02] 암호화의 개념을 이해하고, 암호화를 활용하여 데이터를 안전하게 관리하는 사례를 비교·분석한다.",
              "easy": [
                "암호화",
                "데이터",
                "안전하게",
                "비교·분석"
              ],
              "normal": [
                "암호화",
                "개념",
                "데이터",
                "안전하게 관리",
                "사례",
                "비교·분석"
              ],
              "aliases": {},
              "id": "HI-02-AC-ST-02",
              "legacyId": "1rmtuks-624g01",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g07",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "[12정02-03] 빅데이터의 개념과 특징에 대한 이해를 바탕으로 문제 해결에 적합한 데이터를 수집한다.",
              "easy": [
                "빅데이터",
                "특징",
                "문제 해결",
                "수집"
              ],
              "normal": [
                "빅데이터",
                "데이터",
                "개념",
                "특징",
                "문제 해결",
                "적합한 데이터",
                "수집"
              ],
              "aliases": {},
              "id": "HI-02-AC-ST-03",
              "legacyId": "1rmtuks-1fzbor8",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "n66-2bc745d7",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정02-04] 빅데이터 분석 도구를 활용하여 데이터를 시각화하고 그 의미와 가치를 해석한다.",
              "easy": [
                "빅데이터 분석",
                "시각화",
                "의미",
                "가치"
              ],
              "normal": [
                "빅데이터 분석 도구",
                "데이터",
                "시각화",
                "의미",
                "가치",
                "해석"
              ],
              "aliases": {},
              "id": "HI-02-AC-ST-04",
              "legacyId": "1rmtuks-a1ouwb",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g07",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정02-01] 문자, 이미지, 소리 데이터 등의 기본적인 압축 원리를 이해하고 간단한 데이터에 압축 기법을 적용하여 원본 데이터와 품질 및 용량 분석, 압축 방법 간의 효율성을 비교·분석할 수 있어야 한다.",
              "easy": [
                "문자",
                "이미지",
                "소리",
                "원본",
                "품질",
                "용량"
              ],
              "normal": [
                "문자",
                "이미지",
                "소리 데이터",
                "데이터",
                "압축 원리",
                "압축 기법",
                "원본 데이터",
                "품질",
                "용량",
                "압축 방법",
                "효율성",
                "비교·분석"
              ],
              "aliases": {},
              "id": "HI-02-AC-EX-01",
              "legacyId": "1ykpcgs-tj60d2",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g13",
                  "g14",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g10",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08",
                  "g11",
                  "g09",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g13",
                  "g10"
                ],
                "g06": [
                  "g14",
                  "g10"
                ]
              },
              "yaho": [
                "등의 기본적인 압축 원리를 이해하고 간단한 데이터에 압축 기법을 적용하여",
                "원본 데이터와 품질 및 용량 분석, 압축 방법 간의 효율성을 비교·분석할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "[12정02-02] 비교적 간단한 치환형, 전치형 등의 암호 기법을 활용하여 암호화·복호화의 과정을 이해하고 데이터 암호화를 활용하는 사례 분석을 통해 개인과 사회를 보호하기 위한 수단으로 암호화의 중요성과 필요성을 설명할 수 있어야 한다.",
              "easy": [
                "치환형",
                "전치형",
                "암호 기법",
                "암호화",
                "복호화"
              ],
              "normal": [
                "치환형",
                "전치형",
                "암호 기법",
                "암호화·복호화",
                "암호화",
                "과정",
                "데이터 암호화",
                "사례 분석",
                "개인",
                "사회",
                "보호",
                "수단",
                "중요성",
                "필요성"
              ],
              "aliases": {},
              "id": "HI-02-AC-EX-02",
              "legacyId": "1ykpcgs-16e3f4q",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g10",
                  "g04",
                  "g11",
                  "g12",
                  "g13",
                  "g06",
                  "g07",
                  "g14",
                  "g15",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "등의 암호 기법을 활용하여 암호화·복호화의 과정을 이해하고",
                "데이터 암호화를 활용하는 사례 분석을 통해 개인과 사회를 보호하기 위한",
                "수단으로 암호화의 중요성과 필요성을 설명할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "압축이나 암호화가 실제로 구현되는 과정을 프로그래밍 과정에서 확인할 수 있도록 ‘알고리즘과 프로그래밍’ 영역과 연계하여 교수·학습 과정을 설계하도록 한다. 최소 성취수준을 보장하기 위하여 학습자의 수준에 따라 미리 작성된 코드에 데이터를 입력하고 출력되는 결과를 분석하는 활동을 제시할 수 있다.",
              "easy": [
                "압축",
                "암호화",
                "프로그래밍 과정",
                "알고리즘",
                "최소 성취수준"
              ],
              "normal": [
                "압축",
                "암호화",
                "프로그래밍 과정",
                "알고리즘과 프로그래밍",
                "교수·학습 과정",
                "최소 성취수준",
                "미리 작성된 코드",
                "데이터",
                "입력",
                "출력되는 결과",
                "분석"
              ],
              "aliases": {},
              "id": "HI-02-AC-CO-01",
              "legacyId": "1dahci5-lcj6g0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g06",
                  "g13",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g04",
                  "g07",
                  "g05",
                  "g08",
                  "g09",
                  "g10",
                  "g11",
                  "g12"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g13",
                  "g03"
                ]
              }
            },
            {
              "text": "피지컬 컴퓨팅이나 스마트 기기를 활용한 센서 데이터 수집, 설문조사 등을 통한 직접 수집, 공개된 공공 데이터나 민간 데이터 활용 등 다양한 데이터 수집 방법을 경험할 수 있도록 활동을 구성하며, 빅데이터를 통해 다양한 해석이 가능하도록 프로젝트 방식으로 과제를 수행하고 평가하도록 한다.",
              "easy": [
                "피지컬 컴퓨팅",
                "스마트",
                "기기",
                "공공 데이터",
                "민간 데이터",
                "빅데이터"
              ],
              "normal": [
                "피지컬 컴퓨팅",
                "스마트 기기",
                "센서 데이터",
                "수집",
                "설문조사",
                "직접 수집",
                "공공 데이터",
                "민간 데이터",
                "데이터 수집 방법",
                "빅데이터",
                "다양한 해석",
                "프로젝트"
              ],
              "aliases": {},
              "id": "HI-02-AC-CO-02",
              "legacyId": "1dahci5-uda9dk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g13",
                  "g14",
                  "g05",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g04",
                  "g10",
                  "g05",
                  "g06",
                  "g11",
                  "g07",
                  "g12",
                  "g08"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g13",
                  "g14"
                ],
                "g03": [
                  "g15",
                  "g16"
                ]
              },
              "yaho": [
                "활용한 센서 데이터 수집, 설문조사 등을 통한 직접 수집",
                "공개된 공공 데이터나 민간 데이터 활용 등 다양한 데이터 수집 방법을 경험할",
                "수 있도록 활동을 구성하며, 빅데이터를 통해 다양한 해석이 가능하도록",
                "프로젝트 방식으로 과제를 수행하고 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "데이터의 생성, 저장, 송·수신, 활용 등의 활동에 디지털 자원과 전기 에너지가 소요됨을 인식하고, 데이터 압축 및 암호화를 통해 컴퓨팅 자원 절약과 탄소중립 실천에 영향을 미칠 수 있음을 안내하도록 한다.",
              "easy": [
                "디지털",
                "자원",
                "전기 에너지",
                "데이터 압축",
                "암호화"
              ],
              "normal": [
                "데이터",
                "생성",
                "저장",
                "송·수신",
                "활용",
                "디지털 자원",
                "전기 에너지",
                "데이터 압축",
                "암호화",
                "컴퓨팅 자원",
                "절약",
                "탄소중립",
                "실천"
              ],
              "aliases": {},
              "id": "HI-02-AC-CO-03",
              "legacyId": "1dahci5-rdr577",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g14",
                  "g15",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g07",
                  "g08",
                  "g09",
                  "g10",
                  "g11",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g12",
                  "g06",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15"
                ],
                "g05": [
                  "g16",
                  "g15"
                ]
              },
              "yaho": [
                "활용 등의 활동에 디지털 자원과 전기 에너지가 소요됨을 인식하고",
                "데이터 압축 및 암호화를 통해 컴퓨팅 자원 절약과 탄소중립 실천에 영향을",
                "미칠 수 있음을 안내하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "수집한 데이터와 분석 방법에 따라 특정 문제에 대한 해석이 다를 수 있음을 인정하고, 다른 사람의 의견을 존중하면서 데이터에 기반하여 자신의 주장을 펼치는 민주적인 토의·토론 문화를 조성하도록 한다.",
              "easy": [
                "분석 방법",
                "해석",
                "존중",
                "주장",
                "토의·토론"
              ],
              "normal": [
                "데이터",
                "분석 방법",
                "해석",
                "다른 사람의 의견",
                "존중",
                "데이터에 기반",
                "주장",
                "민주적인",
                "토의·토론 문화"
              ],
              "aliases": {},
              "id": "HI-02-AC-CO-04",
              "legacyId": "1dahci5-xixpv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g05",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g08",
                  "g05",
                  "g09",
                  "g06",
                  "g11",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "normalSplitMigrations": {
                "g10": [
                  "g11",
                  "g12"
                ]
              },
              "yaho": [
                "따라 특정 문제에 대한 해석이 다를 수 있음을 인정하고",
                "다른 사람의 의견을 존중하면서 데이터에 기반하여",
                "자신의 주장을 펼치는 민주적인 토의·토론 문화를 조성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        }
      ]
    },
    "알고리즘과 프로그래밍": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "문제를 효율적으로 해결하기 위해서는 문제를 추상화하고 프로그래밍을 위한 알고리즘을 설계한다.",
              "easy": [
                "추상화",
                "프로그래밍",
                "알고리즘"
              ],
              "normal": [
                "문제",
                "효율적으로 해결",
                "추상화",
                "프로그래밍",
                "알고리즘",
                "설계"
              ],
              "id": "HI-03-CS-KI-01",
              "legacyId": "19een0-g6tp34",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 모델링을 하기 위해 문제 해결에 필요한 데이터 간의 관계를 분석하고 정의한다.",
              "easy": [
                "데이터 모델링",
                "문제 해결",
                "정의"
              ],
              "normal": [
                "데이터 모델링",
                "데이터",
                "문제 해결",
                "관계",
                "분석",
                "정의"
              ],
              "id": "HI-03-CS-KI-02",
              "legacyId": "19een0-a9c0c6",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g03",
                  "g02",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "프로그래밍을 통한 자동화는 다양한 학문 분야의 문제를 해결하는 데 도움을 준다.",
              "easy": [
                "프로그래밍",
                "자동화",
                "학문 분야"
              ],
              "normal": [
                "프로그래밍",
                "자동화",
                "다양한 학문 분야",
                "학문 분야",
                "문제",
                "해결"
              ],
              "id": "HI-03-CS-KI-03",
              "legacyId": "19een0-1da0asc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-5f57fad5",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "문제 분해와 모델링",
              "easy": [
                "문제 분해",
                "모델링"
              ],
              "normal": [
                "문제 분해",
                "모델링"
              ],
              "id": "HI-03-CS-KN-01",
              "legacyId": "1gji2b-1emlawm",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "정렬, 탐색 알고리즘",
              "easy": [
                "정렬",
                "탐색 알고리즘"
              ],
              "normal": [
                "정렬",
                "탐색 알고리즘"
              ],
              "id": "HI-03-CS-KN-02",
              "legacyId": "1gji2b-mqsyv5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "자료형",
              "easy": [
                "자료형"
              ],
              "normal": [
                "자료형"
              ],
              "id": "HI-03-CS-KN-03",
              "legacyId": "1gji2b-1rzvh6s",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "표준입출력과 파일입출력",
              "easy": [
                "표준입출력",
                "파일입출력"
              ],
              "normal": [
                "표준입출력",
                "파일입출력"
              ],
              "id": "HI-03-CS-KN-04",
              "legacyId": "1gji2b-r30blh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "다차원 데이터 활용",
              "easy": [
                "다차원",
                "데이터",
                "활용"
              ],
              "normal": [
                "다차원 데이터",
                "활용"
              ],
              "id": "HI-03-CS-KN-05",
              "legacyId": "1gji2b-1yud5yu",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g03",
                  "g04"
                ]
              }
            },
            {
              "text": "제어 구조의 응용",
              "easy": [
                "제어 구조",
                "응용"
              ],
              "normal": [
                "제어 구조",
                "응용"
              ],
              "id": "HI-03-CS-KN-06",
              "legacyId": "1gji2b-wh66i5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "클래스와 인스턴스",
              "easy": [
                "클래스",
                "인스턴스"
              ],
              "normal": [
                "클래스",
                "인스턴스"
              ],
              "id": "HI-03-CS-KN-07",
              "legacyId": "1gji2b-12sv5wb",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "문제를 분해하고 모델링하기",
              "easy": [
                "분해",
                "모델링"
              ],
              "normal": [
                "문제",
                "분해",
                "모델링"
              ],
              "id": "HI-03-CS-PF-01",
              "legacyId": "1eyoxrk-lvl12y",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "알고리즘의 수행 과정 및 효율성 비교·분석하기",
              "easy": [
                "수행 과정",
                "효율성",
                "비교·분석"
              ],
              "normal": [
                "알고리즘",
                "수행 과정",
                "효율성",
                "비교·분석"
              ],
              "id": "HI-03-CS-PF-02",
              "legacyId": "1eyoxrk-1pa55zp",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "문제 해결에 적합한 자료형과 입출력 구조를 활용하여 프로그램 작성하기",
              "easy": [
                "자료형",
                "입출력",
                "구조"
              ],
              "normal": [
                "문제 해결",
                "자료형",
                "입출력 구조",
                "활용",
                "프로그램",
                "작성"
              ],
              "id": "HI-03-CS-PF-03",
              "legacyId": "1eyoxrk-14p2z4h",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g08",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "복잡한 문제를 해결하기 위해 제어 구조와 다차원 데이터 구조를 복합적으로 활용하기",
              "easy": [
                "제어 구조",
                "데이터 구조",
                "복합적으로"
              ],
              "normal": [
                "복잡한 문제",
                "해결",
                "제어 구조",
                "다차원 데이터 구조",
                "복합적으로 활용"
              ],
              "id": "HI-03-CS-PF-04",
              "legacyId": "1eyoxrk-140m94p",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g09",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ],
                "g03": [
                  "g08",
                  "g09"
                ],
                "g04": [
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "클래스를 정의하고 인스턴스를 생성하여 문제 해결에 적합한 객체를 구현하기",
              "easy": [
                "클래스",
                "인스턴스"
              ],
              "normal": [
                "클래스",
                "정의",
                "인스턴스",
                "생성",
                "문제 해결",
                "적합한",
                "객체",
                "구현"
              ],
              "id": "HI-03-CS-PF-05",
              "legacyId": "1eyoxrk-km7sev",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g06",
                  "g07",
                  "n66-7e084ea5",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "문제 해결 모델을 구성하고 적극적으로 표현하는 자세",
              "easy": [
                "문제 해결 모델",
                "적극적으로 표현"
              ],
              "normal": [
                "문제 해결 모델",
                "구성",
                "적극적으로 표현",
                "자세"
              ],
              "id": "HI-03-CS-VA-01",
              "legacyId": "j8myzy-kp4jln",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "알고리즘 효율의 가치와 영향력을 인식하고 적극적으로 탐구하는 태도",
              "easy": [
                "알고리즘 효율",
                "영향력"
              ],
              "normal": [
                "알고리즘 효율",
                "가치",
                "영향력",
                "인식",
                "적극적으로 탐구",
                "태도"
              ],
              "id": "HI-03-CS-VA-02",
              "legacyId": "j8myzy-w6d72u",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "다양한 학문 분야의 문제 해결을 위해 설계한 알고리즘을 프로그램으로 구현하는 실천적 자세",
              "easy": [
                "학문 분야",
                "문제 해결",
                "알고리즘"
              ],
              "normal": [
                "학문 분야",
                "문제 해결",
                "설계",
                "알고리즘",
                "프로그램",
                "구현",
                "실천적 자세"
              ],
              "id": "HI-03-CS-VA-03",
              "legacyId": "j8myzy-laokp4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "디지털 사회의 민주시민으로서 협력적 문제 해결력의 중요성을 인식하는 자세",
              "easy": [
                "디지털 사회",
                "문제 해결력"
              ],
              "normal": [
                "디지털 사회",
                "민주시민",
                "협력적 문제 해결력",
                "중요성",
                "인식",
                "자세"
              ],
              "id": "HI-03-CS-VA-04",
              "legacyId": "j8myzy-18wpxqw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정03-01] 복잡한 문제를 해결 가능한 작은 문제로 분해하고 모델링한다.",
              "easy": [
                "해결 가능한 작은 문제",
                "분해",
                "모델링"
              ],
              "normal": [
                "복잡한 문제",
                "해결 가능한 작은 문제",
                "분해",
                "모델링"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-01",
              "legacyId": "1rmtuks-gncszh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g05",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ],
                "g02": [
                  "g08",
                  "g07"
                ]
              }
            },
            {
              "text": "[12정03-02] 데이터를 정렬하는 다양한 알고리즘의 특징과 효율을 비교·분석한다.",
              "easy": [
                "정렬",
                "알고리즘",
                "특징"
              ],
              "normal": [
                "데이터",
                "정렬",
                "다양한 알고리즘",
                "특징",
                "효율",
                "비교·분석"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-02",
              "legacyId": "1rmtuks-ufxqj5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정03-03] 데이터를 탐색하는 다양한 알고리즘의 특징과 효율을 비교·분석한다.",
              "easy": [
                "알고리즘",
                "특징",
                "효율"
              ],
              "normal": [
                "데이터",
                "탐색",
                "다양한 알고리즘",
                "특징",
                "효율",
                "비교·분석"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-03",
              "legacyId": "1rmtuks-109ekc0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정03-04] 자료형의 종류와 특성을 알고 적합한 자료형을 선택하여 프로그램을 작성한다.",
              "easy": [
                "자료형",
                "종류",
                "특성"
              ],
              "normal": [
                "자료형",
                "종류",
                "특성",
                "적합한 자료형",
                "선택",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-04",
              "legacyId": "1rmtuks-1wiyq2h",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정03-05] 표준입출력과 파일입출력을 활용한 프로그램을 작성한다.",
              "easy": [
                "표준입출력",
                "파일입출력",
                "프로그램"
              ],
              "normal": [
                "표준입출력",
                "파일입출력",
                "활용",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-05",
              "legacyId": "1rmtuks-12lq0dn",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정03-06] 다차원 데이터 구조를 활용한 프로그램을 작성한다.",
              "easy": [
                "데이터 구조",
                "프로그램"
              ],
              "normal": [
                "다차원 데이터 구조",
                "활용",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-06",
              "legacyId": "1rmtuks-q26fmo",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g06",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g03",
                  "g02",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "[12정03-07] 다양한 제어 구조를 복합적으로 활용한 프로그램을 작성한다.",
              "easy": [
                "제어 구조",
                "복합적으로",
                "프로그램"
              ],
              "normal": [
                "다양한 제어 구조",
                "복합적으로 활용",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-07",
              "legacyId": "1rmtuks-1hq1off",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g06",
                  "g03"
                ],
                "normal": [
                  "g04",
                  "g02",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12정03-08] 객체를 구현하는 클래스와 인스턴스를 활용하여 프로그램을 작성한다.",
              "easy": [
                "객체",
                "클래스",
                "인스턴스"
              ],
              "normal": [
                "객체",
                "구현",
                "클래스",
                "인스턴스",
                "활용",
                "프로그램",
                "작성"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-08",
              "legacyId": "1rmtuks-1scp1yn",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정03-09] 실생활 및 다양한 학문 분야의 문제 해결을 위한 프로그램을 협력적으로 설계·구현한다.",
              "easy": [
                "학문 분야",
                "문제 해결",
                "프로그램",
                "협력적"
              ],
              "normal": [
                "실생활",
                "학문 분야",
                "문제 해결",
                "프로그램",
                "협력적으로",
                "설계·구현"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-09",
              "legacyId": "1rmtuks-vz2zaq",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정03-10] 문제 해결을 위한 프로그램의 성능을 평가하고 공유한다.",
              "easy": [
                "문제 해결",
                "성능",
                "평가"
              ],
              "normal": [
                "문제 해결",
                "프로그램",
                "성능",
                "평가",
                "공유"
              ],
              "aliases": {},
              "id": "HI-03-AC-ST-10",
              "legacyId": "1rmtuks-1d4lx5m",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정03-01] 복잡한 문제를 분석하는 단계에서 좀 더 작은 문제로 분해하는 과정을 수행하며 해결하기 용이하도록 단순화나 구조화하는 모델링 단계를 수행할 수 있어야 한다. 작은 문제의 해결 결과를 종합하는 과정에서 작은 문제를 모두 수행했을 때 전체 문제 해결이 원활하게 이루어지는지, 오류가 없는지를 확인할 수 있어야 한다.",
              "easy": [
                "분해",
                "단순화",
                "구조화",
                "모델링",
                "전체 문제",
                "오류"
              ],
              "normal": [
                "복잡한 문제",
                "분석",
                "작은 문제",
                "분해",
                "해결하기",
                "해결",
                "단순화",
                "구조화",
                "모델링",
                "작은 문제의 해결 결과",
                "종합",
                "전체 문제 해결",
                "오류",
                "확인"
              ],
              "aliases": {},
              "id": "HI-03-AC-EX-01",
              "legacyId": "1ykpcgs-149yepd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g16",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g09",
                  "g02",
                  "g03",
                  "n66-64816d15",
                  "g17",
                  "g04",
                  "g05",
                  "g06",
                  "g10",
                  "g11",
                  "g07",
                  "g08",
                  "g12"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g13",
                  "g14"
                ],
                "g02": [
                  "g15",
                  "g14"
                ],
                "g07": [
                  "g16",
                  "g17"
                ]
              }
            },
            {
              "text": "[12정03-02], [12정03-03] 여러 가지 정렬, 탐색 알고리즘을 적용하여 실생활의 간단한 데이터의 정렬, 탐색 문제를 해결할 수 있어야 한다. 정렬, 탐색 알고리즘의 수행 과정을 분석해보고 문제에 따라 알고리즘의 효율성이 다를 수 있음을 설명할 수 있어야 한다.",
              "easy": [
                "정렬",
                "탐색 알고리즘",
                "데이터",
                "수행 과정",
                "효율성"
              ],
              "normal": [
                "정렬",
                "탐색 알고리즘",
                "실생활",
                "데이터",
                "문제를 해결",
                "문제",
                "해결",
                "수행 과정",
                "분석",
                "효율성",
                "설명"
              ],
              "aliases": {},
              "id": "HI-03-AC-EX-02",
              "legacyId": "1ykpcgs-nenecq",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g07",
                  "g03",
                  "n66-2ebb21da",
                  "g04",
                  "g08",
                  "g05",
                  "g09",
                  "g06",
                  "g10"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              }
            },
            {
              "text": "[12정03-08] 실생활의 사례를 활용하여 객체 지향의 기본 개념을 이해하고 필요성을 설명할 수 있어야 한다. 클래스와 객체를 생성하고 문제 해결을 위한 프로그램 구현에 활용할 수 있어야 한다.",
              "easy": [
                "객체",
                "기본 개념",
                "필요성",
                "클래스",
                "프로그램"
              ],
              "normal": [
                "실생활",
                "활용",
                "객체 지향",
                "객체",
                "기본 개념",
                "필요성",
                "클래스",
                "생성",
                "문제 해결",
                "프로그램",
                "구현"
              ],
              "aliases": {},
              "id": "HI-03-AC-EX-03",
              "legacyId": "1ykpcgs-149405b",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g07",
                  "g11",
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g09",
                  "g06",
                  "g10"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "제시된 문제 상황을 컴퓨팅 시스템으로 해결할 수 있도록 문제 분해, 모델링, 알고리즘 설계 등의 추상화 과정 및 프로그램 작성, 실행 결과 평가, 오류 수정 등의 자동화 과정이 유기적으로 연결되도록 나선형으로 교수·학습을 제시하고 과정 전반을 평가하도록 한다.",
              "easy": [
                "문제 분해",
                "모델링",
                "알고리즘 설계",
                "추상화",
                "프로그램 작성",
                "실행 결과 평가",
                "오류",
                "수정"
              ],
              "normal": [
                "컴퓨팅 시스템",
                "문제 분해",
                "모델링",
                "알고리즘 설계",
                "추상화 과정",
                "프로그램 작성",
                "실행 결과 평가",
                "평가",
                "오류 수정",
                "자동화 과정",
                "유기적으로 연결",
                "나선형",
                "과정 전반"
              ],
              "aliases": {},
              "id": "HI-03-AC-CO-01",
              "legacyId": "1dahci5-2xmpax",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g11",
                  "g16",
                  "g17"
                ],
                "normal": [
                  "g09",
                  "g01",
                  "g02",
                  "g03",
                  "g10",
                  "g05",
                  "g11",
                  "g06",
                  "g07",
                  "g12",
                  "g13",
                  "g14",
                  "g15"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g07": [
                  "g16",
                  "g17"
                ]
              },
              "yaho": [
                "컴퓨팅 시스템으로 해결할 수 있도록 문제 분해, 모델링",
                "알고리즘 설계 등의 추상화 과정 및 프로그램 작성, 실행 결과 평가",
                "오류 수정 등의 자동화 과정이 유기적으로 연결되도록 나선형으로 교수·학습을 제시하고",
                "과정 전반을 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "정렬, 탐색 알고리즘 학습 과정에서 정렬, 탐색의 효율적인 부분을 효과적으로 이해할 수 있도록 실제 대규모 데이터를 정렬하고 탐색하는 과정을 교수·학습 과정에 충분히 포함하도록 한다.",
              "easy": [
                "정렬",
                "탐색 알고리즘",
                "효율적인 부분",
                "대규모 데이터"
              ],
              "normal": [
                "정렬",
                "탐색 알고리즘",
                "탐색",
                "효율적인 부분",
                "대규모 데이터",
                "교수·학습 과정"
              ],
              "aliases": {},
              "id": "HI-03-AC-CO-02",
              "legacyId": "1dahci5-1ek0l32",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g05",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g05",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g08",
                  "g09"
                ]
              },
              "yaho": [
                "정렬, 탐색 알고리즘 학습 과정에서 정렬",
                "탐색의 효율적인 부분을 효과적으로 이해할 수 있도록 실제 대규모 데이터를 정렬하고",
                "탐색하는 과정을 교수·학습 과정에 충분히 포함하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "다차원 데이터 구조 학습 과정에서 프로그래밍 언어에 따라 2차원 혹은 그 이상의 배열이나 리스트를 활용하도록 하며, 다차원 데이터를 활용하는 이유를 이해하기 쉽도록 실제로 사용되는 데이터의 예시를 충분히 제공하도록 한다.",
              "easy": [
                "데이터 구조",
                "프로그래밍 언어",
                "2차원",
                "배열",
                "리스트"
              ],
              "normal": [
                "다차원 데이터 구조",
                "다차원 데이터",
                "프로그래밍 언어",
                "2차원",
                "배열",
                "리스트",
                "활용",
                "이유",
                "실제로 사용되는 데이터"
              ],
              "aliases": {},
              "id": "HI-03-AC-CO-03",
              "legacyId": "1dahci5-1m3f96k",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g11",
                  "g06",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g06",
                  "g02",
                  "g03",
                  "g04",
                  "g07",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g10",
                  "g11"
                ],
                "g05": [
                  "g10",
                  "g12"
                ]
              },
              "yaho": [
                "프로그래밍 언어에 따라 2차원 혹은 그 이상의 배열이나 리스트를 활용하도록",
                "하며, 다차원 데이터를 활용하는 이유를 이해하기 쉽도록",
                "실제로 사용되는 데이터의 예시를 충분히 제공하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "프로그래밍 학습 시 최소 성취수준을 보장하기 위하여 프로그래밍 관련 학습 개념을 우선 이해할 수 있도록 미리 제작된 코드를 제공하거나 프로그래밍 언어에서 활용할 수 있는 여러 라이브러리를 활용하는 방안을 구상하도록 한다. 기본적인 프로그래밍 개념이 부족한 학생을 위해 수준에 맞게 스스로 학습을 진행할 수 있는 추가적인 교육 내용을 제공하는 것도 고려하도록 한다.",
              "easy": [
                "최소 성취수준",
                "학습 개념",
                "미리 제작된 코드",
                "프로그래밍 언어",
                "라이브러리",
                "추가적인"
              ],
              "normal": [
                "프로그래밍 학습",
                "최소 성취수준",
                "프로그래밍 관련",
                "학습 개념",
                "미리 제작된 코드",
                "프로그래밍 언어",
                "라이브러리",
                "프로그래밍 개념",
                "스스로 학습",
                "추가적인 교육 내용"
              ],
              "aliases": {},
              "id": "HI-03-AC-CO-04",
              "legacyId": "1dahci5-1iq3xkm",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g09",
                  "g05",
                  "g15"
                ],
                "normal": [
                  "g07",
                  "g01",
                  "g18",
                  "g03",
                  "g04",
                  "g09",
                  "g05",
                  "g20",
                  "g11",
                  "g06"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g12",
                  "g13",
                  "g14"
                ],
                "g06": [
                  "g15",
                  "g16",
                  "g17"
                ]
              },
              "normalSplitMigrations": {
                "g08": [
                  "g18",
                  "g03"
                ],
                "g10": [
                  "g19",
                  "g20"
                ]
              },
              "yaho": [
                "보장하기 위하여 프로그래밍 관련 학습 개념을 우선 이해할 수 있도록",
                "미리 제작된 코드를 제공하거나 프로그래밍 언어에서 활용할 수 있는 여러",
                "라이브러리를 활용하는 방안을 구상하도록 한다",
                "기본적인 프로그래밍 개념이 부족한 학생을 위해",
                "수준에 맞게 스스로 학습을 진행할 수 있는 추가적인 교육 내용을 제공하는 것도 고려하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05"
                ]
              }
            }
          ]
        }
      ]
    },
    "인공지능": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "지능 에이전트는 외부와의 상호 작용을 통해 기존에 해결할 수 없었던 복잡하고 어려운 문제를 해결하는 데 활용된다.",
              "easy": [
                "지능 에이전트",
                "상호 작용"
              ],
              "normal": [
                "지능 에이전트",
                "외부",
                "상호 작용",
                "해결",
                "복잡하고 어려운 문제",
                "활용"
              ],
              "id": "HI-04-CS-KI-01",
              "legacyId": "19een0-i4x5f9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g04",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "기계학습 기반의 인공지능을 구현하기 위해서는 문제 해결에 적합한 데이터와 기계학습 모델을 활용한다.",
              "easy": [
                "기계학습",
                "문제 해결",
                "적합한 데이터",
                "기계학습 모델"
              ],
              "normal": [
                "기계학습 기반",
                "인공지능",
                "문제 해결",
                "적합한 데이터",
                "기계학습 모델",
                "활용"
              ],
              "id": "HI-04-CS-KI-02",
              "legacyId": "19een0-x2kp36",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g07",
                  "g05"
                ],
                "normal": [
                  "g06",
                  "g02",
                  "g03",
                  "g07",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "지능 에이전트의 역할",
              "easy": [
                "지능 에이전트",
                "역할"
              ],
              "normal": [
                "지능 에이전트",
                "역할"
              ],
              "id": "HI-04-CS-KN-01",
              "legacyId": "1gji2b-1v34drj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "기계학습의 개념과 유형",
              "easy": [
                "기계학습",
                "개념",
                "유형"
              ],
              "normal": [
                "기계학습",
                "개념",
                "유형"
              ],
              "id": "HI-04-CS-KN-02",
              "legacyId": "1gji2b-19ovg00",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "인공지능 제품이나 서비스에서 지능 에이전트의 역할 탐색하기",
              "easy": [
                "서비스",
                "지능 에이전트"
              ],
              "normal": [
                "인공지능 제품",
                "서비스",
                "지능 에이전트",
                "역할",
                "탐색"
              ],
              "id": "HI-04-CS-PF-01",
              "legacyId": "1eyoxrk-1gdkfxu",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "기계학습으로 해결할 수 있는 문제의 유형 비교하기",
              "easy": [
                "기계학습",
                "비교"
              ],
              "normal": [
                "기계학습",
                "해결할 수 있는 문제",
                "유형",
                "비교"
              ],
              "id": "HI-04-CS-PF-02",
              "legacyId": "1eyoxrk-1bkqyog",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "인간과 인공지능의 관계에 대한 올바른 인식",
              "easy": [
                "인간과 인공지능의 관계",
                "올바른 인식"
              ],
              "normal": [
                "인간과 인공지능의 관계",
                "인간",
                "인공지능",
                "관계",
                "올바른 인식"
              ],
              "id": "HI-04-CS-VA-01",
              "legacyId": "j8myzy-12f5odk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "c66-1e7e2459",
                  "g04"
                ],
                "normal": [
                  "n66-1e7e2459",
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "사회문제를 해결하기 위해 기계학습을 적극적으로 활용하는 자세",
              "easy": [
                "사회문제",
                "기계학습"
              ],
              "normal": [
                "사회문제",
                "해결",
                "기계학습",
                "적극적으로 활용",
                "자세"
              ],
              "id": "HI-04-CS-VA-02",
              "legacyId": "j8myzy-mms4sh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정04-01] 지능 에이전트의 개념과 특성을 이해하고 인간과 인공지능의 관계를 분석한다.",
              "easy": [
                "지능 에이전트",
                "특성",
                "인간"
              ],
              "normal": [
                "지능 에이전트",
                "개념",
                "특성",
                "인간",
                "인공지능",
                "관계",
                "분석"
              ],
              "aliases": {},
              "id": "HI-04-AC-ST-01",
              "legacyId": "1rmtuks-8yk89r",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정04-02] 기계학습의 개념을 이해하고 지도학습과 비지도학습의 차이를 비교·분석한다.",
              "easy": [
                "기계학습",
                "지도학습",
                "비지도학습"
              ],
              "normal": [
                "기계학습",
                "개념",
                "지도학습",
                "비지도학습",
                "차이",
                "비교·분석"
              ],
              "aliases": {},
              "id": "HI-04-AC-ST-02",
              "legacyId": "1rmtuks-zzayfi",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12정04-03] 기계학습을 활용하여 해결할 수 있는 문제와 그렇지 않은 문제를 구분하고 사회문제 해결에 기계학습을 적용한다.",
              "easy": [
                "기계학습",
                "구분",
                "사회문제",
                "적용"
              ],
              "normal": [
                "기계학습",
                "해결할 수 있는 문제",
                "그렇지 않은 문제",
                "구분",
                "사회문제 해결",
                "적용"
              ],
              "aliases": {},
              "id": "HI-04-AC-ST-03",
              "legacyId": "1rmtuks-12al0x7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g07",
                  "g03",
                  "g08",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정04-01] 에이전트와 지능 에이전트를 인식, 학습, 추론, 행동 등 인공지능 관점에서 구분하고 인공지능 발전 현황에 비추어 인간과 인공지능의 역할에 대해 탐색할 수 있어야 한다.",
              "easy": [
                "지능 에이전트",
                "학습",
                "추론",
                "행동",
                "인간"
              ],
              "normal": [
                "에이전트",
                "지능 에이전트",
                "인식",
                "학습",
                "추론",
                "행동",
                "인공지능 관점",
                "인공지능",
                "구분",
                "발전 현황",
                "인간",
                "역할",
                "탐색"
              ],
              "aliases": {},
              "id": "HI-04-AC-EX-01",
              "legacyId": "1ykpcgs-fqf9sr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g10",
                  "g08",
                  "g11",
                  "g12",
                  "g07",
                  "g09",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "yaho": [
                "에이전트와 지능 에이전트를 인식, 학습, 추론, 행동 등 인공지능 관점에서 구분하고",
                "인공지능 발전 현황에 비추어 인간과 인공지능의 역할에 대해 탐색할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "[12정04-03] 회귀, 분류, 군집 등 기계학습 유형을 이해하고 이를 통해 해결할 수 있는 실생활 및 사회문제를 선별하여 해결책을 적용할 수 있어야 한다.",
              "easy": [
                "회귀",
                "분류",
                "군집",
                "기계학습 유형",
                "사회문제"
              ],
              "normal": [
                "회귀",
                "분류",
                "군집",
                "기계학습 유형",
                "실생활",
                "사회문제",
                "선별",
                "해결책",
                "적용"
              ],
              "aliases": {},
              "id": "HI-04-AC-EX-02",
              "legacyId": "1ykpcgs-1cofl7w",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "프로그래밍으로 자동화하기 어려웠던 문제를 해결하기 위해, 문제 해결의 방법으로 인공지능을 적용해 볼 수 있도록 교수·학습을 구성하도록 한다.",
              "easy": [
                "자동화",
                "문제 해결",
                "인공지능",
                "적용"
              ],
              "normal": [
                "프로그래밍",
                "자동화",
                "문제를 해결",
                "문제 해결",
                "인공지능",
                "적용",
                "교수·학습"
              ],
              "aliases": {},
              "id": "HI-04-AC-CO-01",
              "legacyId": "1dahci5-1fo2eff",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g05",
                  "g01",
                  "n66-66519277",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능 에이전트를 학습자가 직접 프로그래밍하기는 어려우므로 학습자가 접근하기 쉬운 인공지능 플랫폼이나 기계학습 라이브러리를 활용하여 기계학습 모델을 구현하도록 한다. 인공지능 개념을 설명하는 수식이나 프로그래밍 코드에 대한 설명보다는 인공지능을 활용한 실생활의 문제 해결 사례를 통해 인공지능의 개념과 동작 원리를 자연스럽게 학습할 수 있도록 한다.",
              "easy": [
                "인공지능 에이전트",
                "인공지능 플랫폼",
                "기계학습",
                "라이브러리",
                "기계학습 모델",
                "문제 해결 사례"
              ],
              "normal": [
                "인공지능 에이전트",
                "인공지능",
                "프로그래밍",
                "인공지능 플랫폼",
                "기계학습 라이브러리",
                "기계학습 모델",
                "구현",
                "개념",
                "수식",
                "프로그래밍 코드",
                "실생활",
                "문제 해결 사례",
                "동작 원리"
              ],
              "aliases": {},
              "id": "HI-04-AC-CO-02",
              "legacyId": "1dahci5-1w0dd2j",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g14",
                  "g15",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g13",
                  "g08",
                  "g02",
                  "g03",
                  "g04",
                  "g09",
                  "g06",
                  "g10",
                  "g11",
                  "g12",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g14",
                  "g15"
                ],
                "g05": [
                  "g16",
                  "g17"
                ]
              },
              "yaho": [
                "인공지능 에이전트를 학습자가 직접 프로그래밍하기는 어려우므로 학습자가 접근하기",
                "쉬운 인공지능 플랫폼이나 기계학습 라이브러리를 활용하여 기계학습 모델을 구현하도록 한다",
                "인공지능 개념을 설명하는 수식이나 프로그래밍 코드에 대한 설명보다는 인공지능을",
                "활용한 실생활의 문제 해결 사례를 통해 인공지능의 개념과 동작 원리를",
                "자연스럽게 학습할 수 있도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "기계학습으로 해결 가능한 지속가능발전목표(SDGs) 관련 문제를 탐색하여 인공지능이 사회 문제 해결에 도움이 되는 경험을 제공하도록 한다.",
              "easy": [
                "기계학습",
                "지속가능발전목표",
                "사회 문제 해결"
              ],
              "normal": [
                "기계학습",
                "지속가능발전목표",
                "SDGs",
                "문제",
                "탐색",
                "인공지능",
                "사회 문제 해결",
                "경험"
              ],
              "aliases": {},
              "id": "HI-04-AC-CO-03",
              "legacyId": "1dahci5-4srzl9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g11",
                  "g05",
                  "g06",
                  "g07",
                  "g03",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g09",
                  "g10"
                ]
              },
              "normalSplitMigrations": {
                "g04": [
                  "g02",
                  "g11"
                ]
              }
            }
          ]
        }
      ]
    },
    "디지털 문화": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "디지털 세상에서의 직업이나 진로는 기술의 발전에 따라 변화되므로 기술과 사회 변화의 관계를 파악하는 것이 중요하다.",
              "easy": [
                "직업",
                "진로",
                "기술",
                "사회 변화"
              ],
              "normal": [
                "디지털 세상",
                "직업",
                "진로",
                "기술의 발전",
                "기술",
                "발전",
                "사회 변화",
                "관계",
                "파악",
                "중요"
              ],
              "id": "HI-05-CS-KI-01",
              "legacyId": "19een0-cs3dgr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g06",
                  "g01",
                  "g02",
                  "n66-5d92abec",
                  "g03",
                  "g07",
                  "g04",
                  "g05",
                  "g08",
                  "n66-db783b42"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "디지털 사회를 안전하게 살아가기 위해서는 정보 보호와 정보보안의 규칙을 우리 모두가 지켜야 한다.",
              "easy": [
                "디지털 사회",
                "정보 보호",
                "정보보안"
              ],
              "normal": [
                "디지털 사회",
                "안전하게",
                "정보 보호",
                "정보보안",
                "규칙",
                "지켜야"
              ],
              "id": "HI-05-CS-KI-02",
              "legacyId": "19een0-ox7ehy",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "디지털 사회와 진로",
              "easy": [
                "디지털 사회",
                "진로"
              ],
              "normal": [
                "디지털 사회",
                "진로"
              ],
              "id": "HI-05-CS-KN-01",
              "legacyId": "1gji2b-z8ald5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "정보 보호와 보안",
              "easy": [
                "정보 보호",
                "보안"
              ],
              "normal": [
                "정보 보호",
                "보안"
              ],
              "id": "HI-05-CS-KN-02",
              "legacyId": "1gji2b-192i99g",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "디지털 기술의 발전에 따른 사회 변화와 연계하여 진로 설계하기",
              "easy": [
                "사회 변화",
                "진로 설계"
              ],
              "normal": [
                "디지털 기술",
                "발전",
                "사회 변화",
                "연계",
                "진로 설계"
              ],
              "id": "HI-05-CS-PF-01",
              "legacyId": "1eyoxrk-w1h9id",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g05",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "정보 보호와 보안 기술의 적용이 필요한 문제를 발견하고 해결 방법 적용하기",
              "easy": [
                "정보 보호",
                "보안",
                "기술"
              ],
              "normal": [
                "정보 보호",
                "보안 기술",
                "적용",
                "문제",
                "발견",
                "해결 방법"
              ],
              "id": "HI-05-CS-PF-02",
              "legacyId": "1eyoxrk-1vju2ty",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g06",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ],
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "미래 사회의 발전 방향에 대해 예측하고 통찰하는 자세",
              "easy": [
                "미래 사회",
                "통찰"
              ],
              "normal": [
                "미래 사회",
                "발전 방향",
                "예측",
                "통찰",
                "자세"
              ],
              "id": "HI-05-CS-VA-01",
              "legacyId": "j8myzy-lvjgml",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "올바른 정보 보호 및 보안 의식",
              "easy": [
                "정보 보호",
                "보안",
                "의식"
              ],
              "normal": [
                "올바른 정보 보호",
                "보안 의식"
              ],
              "id": "HI-05-CS-VA-02",
              "legacyId": "j8myzy-gwkkay",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g03",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g05"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12정05-01] 디지털 기술이 사회에 미치는 영향력을 분석하고 발전 방향을 예측하여 진로를 설계한다.",
              "easy": [
                "디지털 기술",
                "영향력",
                "방향",
                "진로"
              ],
              "normal": [
                "디지털 기술",
                "사회",
                "영향력",
                "분석",
                "발전 방향",
                "예측",
                "진로",
                "설계"
              ],
              "aliases": {},
              "id": "HI-05-AC-ST-01",
              "legacyId": "1rmtuks-12d0zlx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g10",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g07",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "[12정05-02] 보호해야 할 정보와 공유해야 할 정보를 구분하고, 올바른 정보 보호 방법을 실천한다.",
              "easy": [
                "보호해야 할 정보",
                "공유해야 할 정보",
                "정보 보호"
              ],
              "normal": [
                "보호해야 할 정보",
                "공유해야 할 정보",
                "구분",
                "올바른 정보 보호 방법",
                "실천"
              ],
              "aliases": {},
              "id": "HI-05-AC-ST-02",
              "legacyId": "1rmtuks-1libbm3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ],
                "g02": [
                  "g09",
                  "g08"
                ],
                "g03": [
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "[12정05-03] 정보보안의 필요성을 이해하고 보안 기술을 활용하여 디지털 윤리를 실천한다.",
              "easy": [
                "정보보안",
                "필요성",
                "디지털 윤리"
              ],
              "normal": [
                "정보보안",
                "필요성",
                "보안 기술",
                "활용",
                "디지털 윤리",
                "실천"
              ],
              "aliases": {},
              "id": "HI-05-AC-ST-03",
              "legacyId": "1rmtuks-1ufo32f",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12정05-02] 정보 보호와 정보공개의 가치와 영향력을 인식할 수 있어야 하며 자신뿐만 아니라 타인의 정보 역시 중요함을 이해하고 개인 정보 보호, 오·남용 방지 대책 등 실사례를 탐색하며 개인 정보를 포함하여 정보 보호 방법을 실천할 수 있어야 한다.",
              "easy": [
                "정보 보호",
                "정보공개",
                "타인",
                "개인 정보",
                "오·남용",
                "정보 보호 방법"
              ],
              "normal": [
                "정보 보호",
                "정보공개",
                "가치",
                "영향력",
                "타인의 정보",
                "개인 정보 보호",
                "개인 정보",
                "오·남용 방지 대책",
                "실사례",
                "정보 보호 방법",
                "실천"
              ],
              "aliases": {},
              "id": "HI-05-AC-EX-01",
              "legacyId": "1ykpcgs-w77hi2",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g11",
                  "g13",
                  "g15",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g07",
                  "g03",
                  "g04",
                  "g13",
                  "g05",
                  "g08",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g11",
                  "g12"
                ],
                "g04": [
                  "g13",
                  "g14"
                ],
                "g05": [
                  "g15",
                  "g16",
                  "g17"
                ]
              },
              "yaho": [
                "영향력을 인식할 수 있어야 하며 자신뿐만 아니라 타인의 정보 역시 중요함을 이해하고",
                "개인 정보 보호, 오·남용 방지 대책 등 실사례를 탐색하며 개인 정보를 포함하여",
                "정보 보호 방법을 실천할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "사물인터넷, 클라우드, 빅데이터, 인공지능 등 학습 과정을 통해 생성한 결과물을 바탕으로 정보과학기술과 자신의 진로와의 연관성을 탐색할 수 있는 활동을 제시하고 진로설계 시 활용할 수 있도록 한다.",
              "easy": [
                "사물인터넷",
                "클라우드",
                "빅데이터",
                "인공지능",
                "정보과학기술"
              ],
              "normal": [
                "사물인터넷",
                "클라우드",
                "빅데이터",
                "인공지능",
                "결과물",
                "정보과학기술",
                "진로",
                "연관성",
                "탐색",
                "진로설계"
              ],
              "aliases": {},
              "id": "HI-05-AC-CO-01",
              "legacyId": "1dahci5-1dtm9cg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g07",
                  "g05",
                  "g06",
                  "g08",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "yaho": [
                "인공지능 등 학습 과정을 통해 생성한 결과물을 바탕으로 정보과학기술과 자신의",
                "진로와의 연관성을 탐색할 수 있는 활동을 제시하고 진로설계 시 활용할 수 있도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "개인 정보를 포함하여 정보 보호 및 보안의 중요성을 이해하기 위해 공급자 측면과 사용자 측면을 두루 살펴보고 개인 암호 설정 및 변경, 기기 및 클라우드 접근제어, 바이러스 백신 등 학습자가 실천할 수 있는 활동을 제시하여 학습 과정을 누적하여 기록하거나 서·논술형으로 평가하도록 한다.",
              "easy": [
                "개인 정보",
                "정보 보호",
                "공급자",
                "사용자",
                "접근제어",
                "바이러스"
              ],
              "normal": [
                "개인 정보",
                "정보 보호",
                "보안",
                "중요성",
                "공급자 측면",
                "사용자 측면",
                "개인 암호 설정",
                "변경",
                "기기",
                "클라우드",
                "접근제어",
                "바이러스 백신",
                "실천",
                "누적",
                "서·논술형",
                "평가"
              ],
              "aliases": {},
              "id": "HI-05-AC-CO-02",
              "legacyId": "1dahci5-12uvjok",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g05",
                  "g07",
                  "g22"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g10",
                  "g11",
                  "g12",
                  "g13",
                  "g14",
                  "g15",
                  "g07",
                  "g08",
                  "g16",
                  "g17",
                  "g18",
                  "g19"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g06": [
                  "g20",
                  "g21"
                ],
                "g08": [
                  "g22",
                  "g23"
                ]
              },
              "yaho": [
                "정보 보호 및 보안의 중요성을 이해하기 위해",
                "공급자 측면과 사용자 측면을 두루 살펴보고 개인 암호 설정 및 변경",
                "기기 및 클라우드 접근제어, 바이러스 백신 등 학습자가 실천할 수 있는 활동을 제시하여",
                "학습 과정을 누적하여 기록하거나 서·논술형으로 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            },
            {
              "text": "디지털 사회에서 발생하는 여러 문제에 대한 다양한 견해가 있을 수 있음을 인식하고, 디지털 환경에서 지켜야 할 규칙을 민주적인 방식으로 함께 수립해 볼 수 있는 활동을 제시하도록 한다.",
              "easy": [
                "디지털 사회",
                "견해",
                "규칙",
                "민주적인"
              ],
              "normal": [
                "디지털 사회",
                "문제",
                "다양한 견해",
                "인식",
                "디지털 환경",
                "규칙",
                "민주적인 방식",
                "수립",
                "활동"
              ],
              "aliases": {},
              "id": "HI-05-AC-CO-03",
              "legacyId": "1dahci5-1dzvfm6",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g11",
                  "g04",
                  "g12"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g07",
                  "g04",
                  "g05",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g10",
                  "g11"
                ],
                "g05": [
                  "g12",
                  "g13"
                ]
              },
              "yaho": [
                "디지털 사회에서 발생하는 여러 문제에 대한 다양한 견해가 있을 수 있음을 인식하고",
                "디지털 환경에서 지켜야 할 규칙을 민주적인 방식으로 함께 수립해 볼 수 있는 활동을 제시하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            }
          ]
        }
      ]
    },
    "과목 공통": {
      "character-goal": [
        {
          "title": "성격",
          "lines": [
            {
              "id": "HI-CG-CHAR-01",
              "text": "고등학교 ‘정보’는 미래 사회가 요구하는 데이터에 대한 이해를 기반으로 소프트웨어와 인공지능에 대한 기본 역량과 자기주도성을 갖도록 한다.",
              "easy": [
                "데이터에 대한 이해",
                "소프트웨어와 인공지능",
                "자기주도성"
              ],
              "normal": [
                "데이터에 대한 이해",
                "소프트웨어와 인공지능",
                "자기주도성",
                "기본 역량"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-yoas7e",
                  "g-1w61wei",
                  "g-9ucy1t"
                ],
                "normal": [
                  "g-yoas7e",
                  "g-1w61wei",
                  "g-9ucy1t",
                  "g-6anrxc"
                ]
              }
            },
            {
              "id": "HI-CG-CHAR-02",
              "text": "컴퓨팅을 통한 문제 해결을 전제로 문제를 발견, 분석, 해결해 가는 컴퓨팅 사고력에 기반하여 지식정보처리, 창의적 사고, 타인과 협업하고 공유하는 협력적 소통 역량과 공동체 역량 등을 갖춘 디지털 민주시민으로 성장하게 한다.",
              "easy": [
                "컴퓨팅 사고력",
                "협력적 소통 역량",
                "공동체 역량",
                "디지털 민주시민"
              ],
              "normal": [
                "컴퓨팅 사고력",
                "협력적 소통 역량",
                "공동체 역량",
                "디지털 민주시민",
                "문제를 발견, 분석, 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-17wosaj",
                  "g-1p87f29",
                  "g-asnup5",
                  "g-l7opy5"
                ],
                "normal": [
                  "g-17wosaj",
                  "g-1p87f29",
                  "g-asnup5",
                  "g-l7opy5",
                  "g-2dtjsi"
                ]
              }
            },
            {
              "id": "HI-CG-CHAR-03",
              "text": "중학교 ‘정보’와 연계해 불확실한 미래 사회의 문제를 해결하기 위한 사고력을 강화하고, 정보 과목의 내용이 필요한 분야의 진로를 탐색하여 자신을 성장시키는 데 도움이 되는 능력과 태도를 함양한다.",
              "easy": [
                "중학교 ‘정보’와 연계",
                "사고력을 강화",
                "진로를 탐색"
              ],
              "normal": [
                "중학교 ‘정보’와 연계",
                "사고력을 강화",
                "진로를 탐색"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1f5adea",
                  "g-d0uh0u",
                  "g-1obh8sf"
                ],
                "normal": [
                  "g-1f5adea",
                  "g-d0uh0u",
                  "g-1obh8sf"
                ]
              }
            }
          ]
        },
        {
          "title": "목표",
          "lines": [
            {
              "id": "HI-CG-GOAL-00",
              "text": "고등학교 ‘정보’는 인공지능과 더불어 살아가게 될 미래 사회에서 독립적으로 살아가는 데 필요한 정보 관련 능력을 함양하여, 다양한 학문 분야 및 실생활에 필요한 컴퓨팅 장치, 정보처리, 인공지능 등과 같은 ‘정보’과의 전문 지식을 기반으로 컴퓨팅 사고력을 함양할 수 있도록 하는 데 중점을 둔다.",
              "easy": [
                "정보 관련 능력",
                "컴퓨팅 사고력"
              ],
              "normal": [
                "정보 관련 능력",
                "컴퓨팅 사고력",
                "컴퓨팅 장치",
                "정보처리",
                "인공지능"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ffq2ez",
                  "g-1csrpnk"
                ],
                "normal": [
                  "g-1ffq2ez",
                  "g-1csrpnk",
                  "g-1clozho",
                  "g-1gl02xq",
                  "g-pxjab4"
                ]
              }
            },
            {
              "id": "HI-CG-GOAL-01",
              "text": "(1) 디지털 세상을 연결하는 컴퓨팅 시스템 간의 연결 원리를 파악하고, 정보를 다루는 시스템에 의해 처리·생성된 결과가 공유되도록 하는 시스템 제어 능력을 기른다.",
              "easy": [
                "컴퓨팅 시스템 간의 연결 원리",
                "시스템 제어 능력"
              ],
              "normal": [
                "컴퓨팅 시스템 간의 연결 원리",
                "시스템 제어 능력",
                "처리·생성된 결과가 공유"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1esnb30",
                  "g-1fvcp6h"
                ],
                "normal": [
                  "g-1esnb30",
                  "g-1fvcp6h",
                  "g-pcbrkd"
                ]
              }
            },
            {
              "id": "HI-CG-GOAL-02",
              "text": "(2) 컴퓨팅을 활용한 문제 해결을 위해 목적에 맞는 데이터를 수집하고, 데이터 간의 관계를 파악하여 구조화하고, 빅데이터를 처리하고 시각화할 수 있는 능력을 기른다.",
              "easy": [
                "목적에 맞는 데이터를 수집",
                "구조화",
                "빅데이터",
                "시각화"
              ],
              "normal": [
                "목적에 맞는 데이터를 수집",
                "구조화",
                "빅데이터",
                "시각화",
                "데이터 간의 관계"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-ppok3p",
                  "g-163w7au",
                  "g-1yu8ucr",
                  "g-1enisyf"
                ],
                "normal": [
                  "g-ppok3p",
                  "g-163w7au",
                  "g-1yu8ucr",
                  "g-1enisyf",
                  "g-nugi4y"
                ]
              }
            },
            {
              "id": "HI-CG-GOAL-03",
              "text": "(3) 다양한 학문 분야의 문제 해결에 필요한 데이터의 관계를 모델링하고 알고리즘을 효율적으로 설계하여 프로그램으로 구현, 평가, 개선하는 과정에서 협력과 공유의 문화를 실천하는 태도를 기른다.",
              "easy": [
                "데이터의 관계를 모델링",
                "알고리즘을 효율적으로 설계",
                "구현, 평가, 개선",
                "협력과 공유"
              ],
              "normal": [
                "데이터의 관계를 모델링",
                "알고리즘을 효율적으로 설계",
                "구현, 평가, 개선",
                "협력과 공유"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ogn730",
                  "g-1583w6u",
                  "g-1ow7osu",
                  "g-1ii6rzk"
                ],
                "normal": [
                  "g-1ogn730",
                  "g-1583w6u",
                  "g-1ow7osu",
                  "g-1ii6rzk"
                ]
              }
            },
            {
              "id": "HI-CG-GOAL-04",
              "text": "(4) 지능 에이전트의 관점에서 인공지능을 이해하고, 기계학습을 통한 인공지능으로 문제를 해결하는 방법을 체득하고 적용하는 능력을 기른다.",
              "easy": [
                "지능 에이전트",
                "기계학습",
                "체득하고 적용"
              ],
              "normal": [
                "지능 에이전트",
                "기계학습",
                "체득하고 적용"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1stc41t",
                  "g-7czu2a",
                  "g-1yvvjnz"
                ],
                "normal": [
                  "g-1stc41t",
                  "g-7czu2a",
                  "g-1yvvjnz"
                ]
              }
            },
            {
              "id": "HI-CG-GOAL-05",
              "text": "(5) 디지털 기술로 인한 사회의 발전과 변화를 이해하고, 정보 보호와 정보보안의 중요성을 인식하여 실천하는 태도와 능력을 기른다.",
              "easy": [
                "사회의 발전과 변화",
                "정보 보호",
                "정보보안",
                "실천하는 태도와 능력"
              ],
              "normal": [
                "사회의 발전과 변화",
                "정보 보호",
                "정보보안",
                "실천하는 태도와 능력"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-rnzohx",
                  "g-ir46xc",
                  "g-rdkdag",
                  "g-1qpkjxp"
                ],
                "normal": [
                  "g-rnzohx",
                  "g-ir46xc",
                  "g-rdkdag",
                  "g-1qpkjxp"
                ]
              }
            }
          ]
        }
      ],
      "teaching-evaluation": [
        {
          "title": "교수·학습의 방향",
          "lines": [
            {
              "id": "HI-TE-DIR-01",
              "text": "(가) 실제적인 삶의 맥락에서 컴퓨팅을 통해 문제를 해결하도록 하는 학습 과제를 제시하여 학습자가 과제를 스스로 해결하는 과정에서 자연스럽게 컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양을 함양할 수 있도록 지도한다.",
              "easy": [
                "실제적인 삶의 맥락",
                "컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양"
              ],
              "normal": [
                "실제적인 삶의 맥락",
                "컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양",
                "과제를 스스로 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1hpvl7x",
                  "g-8z2gn6"
                ],
                "normal": [
                  "g-1hpvl7x",
                  "g-8z2gn6",
                  "g-1o563l4"
                ]
              }
            },
            {
              "id": "HI-TE-DIR-02",
              "text": "(마) 온라인 학습 플랫폼을 활용하는 디지털 기반 학습 이력을 활용하여 언제 어디서나 학습의 연장이 가능하도록 하며, 네트워크 기반의 온라인 활동을 통해 협력적으로 문제를 해결할 수 있는 역량을 함양하도록 활동을 구성한다.",
              "easy": [
                "디지털 기반 학습 이력",
                "학습의 연장",
                "협력적으로 문제를 해결"
              ],
              "normal": [
                "디지털 기반 학습 이력",
                "학습의 연장",
                "협력적으로 문제를 해결",
                "온라인 학습 플랫폼"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1bxv8ci",
                  "g-1obcp9y",
                  "g-1l3tzwo"
                ],
                "normal": [
                  "g-1bxv8ci",
                  "g-1obcp9y",
                  "g-1l3tzwo",
                  "g-1kmvju"
                ]
              }
            }
          ]
        },
        {
          "title": "교수·학습 방법",
          "lines": [
            {
              "id": "HI-TE-MET-01",
              "text": "(가) 정보 교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, 디자인기반학습, 짝 프로그래밍, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
              "easy": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습"
              ],
              "normal": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습",
                "핵심 아이디어"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-5czylv",
                  "g-580zse",
                  "g-fvp6px",
                  "g-3npfyr",
                  "g-doerkb"
                ],
                "normal": [
                  "g-5czylv",
                  "g-580zse",
                  "g-fvp6px",
                  "g-3npfyr",
                  "g-doerkb",
                  "g-zl2e74"
                ]
              }
            },
            {
              "id": "HI-TE-MET-02",
              "text": "(나) 학습자 개인별로 학습하는 속도가 다양할 수 있음을 고려하고, 최소 성취수준을 보장할 수 있도록 학습관리시스템(LMS)을 활용하여 온라인 학습자료를 제작 및 제공함으로써 학습격차를 최소화하도록 노력한다.",
              "easy": [
                "최소 성취수준",
                "학습관리시스템(LMS)",
                "학습격차를 최소화"
              ],
              "normal": [
                "최소 성취수준",
                "학습관리시스템(LMS)",
                "학습격차를 최소화",
                "온라인 학습자료"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-d6wl6f",
                  "g-fd2spb",
                  "g-d0bxa7"
                ],
                "normal": [
                  "g-d6wl6f",
                  "g-fd2spb",
                  "g-d0bxa7",
                  "g-9lwlv8"
                ]
              }
            },
            {
              "id": "HI-TE-MET-03",
              "text": "(마) 프로그래밍에서 언어를 암기하여 습득하는 데 집중하기보다는 문제를 해결하는 과정에 초점을 두며, 학습자가 흥미롭게 느낄 실생활이나 교과 관련 주제를 선정하여 과제로 제시하고, 이를 학습자가 스스로 해결하도록 교수·학습을 구성한다.",
              "easy": [
                "언어를 암기하여 습득",
                "문제를 해결하는 과정",
                "학습자가 스스로 해결"
              ],
              "normal": [
                "언어를 암기하여 습득",
                "문제를 해결하는 과정",
                "학습자가 스스로 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-vu4bwb",
                  "g-74zcim",
                  "g-i709mb"
                ],
                "normal": [
                  "g-vu4bwb",
                  "g-74zcim",
                  "g-i709mb"
                ]
              }
            }
          ]
        },
        {
          "title": "평가의 방향",
          "lines": [
            {
              "id": "HI-TE-EVD-01",
              "text": "(가) 평가 항목은 컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양의 하위 요소를 기반으로 구체화한다.",
              "easy": [
                "컴퓨팅 사고력",
                "디지털 문화 소양",
                "인공지능 소양",
                "하위 요소"
              ],
              "normal": [
                "컴퓨팅 사고력",
                "디지털 문화 소양",
                "인공지능 소양",
                "하위 요소"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1icinp2",
                  "g-7c31nh",
                  "g-a1iz19",
                  "g-6dkwxe"
                ],
                "normal": [
                  "g-1icinp2",
                  "g-7c31nh",
                  "g-a1iz19",
                  "g-6dkwxe"
                ]
              }
            },
            {
              "id": "HI-TE-EVD-02",
              "text": "(다) 구체적인 평가 루브릭을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
              "easy": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "normal": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1j6mxkb",
                  "g-1niv9ei",
                  "g-1qm6u9m"
                ],
                "normal": [
                  "g-1j6mxkb",
                  "g-1niv9ei",
                  "g-1qm6u9m"
                ]
              }
            },
            {
              "id": "HI-TE-EVD-03",
              "text": "(라) 성취기준의 도달 수준을 파악하기 위한 평가뿐만 아니라 학습한 내용의 전이를 통해 학습한 내용을 적용할 수 있는 과제를 제시하여 이해와 사고를 통합적으로 평가한다.",
              "easy": [
                "학습한 내용의 전이",
                "적용할 수 있는 과제",
                "통합적으로 평가"
              ],
              "normal": [
                "학습한 내용의 전이",
                "적용할 수 있는 과제",
                "통합적으로 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1j4uw2t",
                  "g-1qbquvq",
                  "g-1j7ma56"
                ],
                "normal": [
                  "g-1j4uw2t",
                  "g-1qbquvq",
                  "g-1j7ma56"
                ]
              }
            }
          ]
        },
        {
          "title": "평가 방법",
          "lines": [
            {
              "id": "HI-TE-EVM-01",
              "text": "(가) 성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 평가 포트폴리오를 계획한다. 예를 들면, 관찰 평가, 서술형평가, 수행 평가 등을 활용하거나, 자기 평가, 동료 평가 등과 같은 다면적 평가를 실행한다.",
              "easy": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행 평가",
                "자기 평가",
                "동료 평가"
              ],
              "normal": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행 평가",
                "자기 평가",
                "동료 평가",
                "다면적 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-c8kat8",
                  "g-1but2fy",
                  "g-3nflb1",
                  "g-1os5le7",
                  "g-yhecj2",
                  "g-10n4w61"
                ],
                "normal": [
                  "g-c8kat8",
                  "g-1but2fy",
                  "g-3nflb1",
                  "g-1os5le7",
                  "g-yhecj2",
                  "g-10n4w61",
                  "g-trwq8l"
                ]
              }
            },
            {
              "id": "HI-TE-EVM-02",
              "text": "(나) 평가 내용이나 방법에 따라 다양한 디지털 도구(프로그램 자동 평가시스템(online judge 등), 학습관리시스템(LMS) 등)를 활용할 수 있으며, 평가 이전에 학생이 디지털 도구를 다룰 수 있도록 교육하여 평가의 불이익이 없도록 계획한다.",
              "easy": [
                "프로그램 자동 평가시스템",
                "online judge",
                "학습관리시스템",
                "평가의 불이익이 없도록"
              ],
              "normal": [
                "프로그램 자동 평가시스템",
                "online judge",
                "학습관리시스템",
                "평가의 불이익이 없도록"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-wpnt06",
                  "g-1w8yc36",
                  "g-hoyg5c",
                  "g-159v9wb"
                ],
                "normal": [
                  "g-wpnt06",
                  "g-1w8yc36",
                  "g-hoyg5c",
                  "g-159v9wb"
                ]
              }
            },
            {
              "id": "HI-TE-EVM-03",
              "text": "(다) 실생활 및 다양한 학문 분야에서 해결할 수 있는 문제를 스스로 발견하도록 하고, 학생이 해결하는 수행 과정을 보고서나 포트폴리오 형태로 누적하여 평가가 지속적으로 이루어지고 과정에 초점을 맞추도록 한다.",
              "easy": [
                "보고서나 포트폴리오",
                "누적",
                "과정에 초점을"
              ],
              "normal": [
                "보고서나 포트폴리오",
                "누적",
                "과정에 초점을",
                "평가가 지속적으로"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1jzfk2n",
                  "g-glu4ug",
                  "g-6jpdxs"
                ],
                "normal": [
                  "g-1jzfk2n",
                  "g-glu4ug",
                  "g-6jpdxs",
                  "g-19pbiro"
                ]
              }
            },
            {
              "id": "HI-TE-EVM-04",
              "text": "(마) 문제 해결에 적합한 소프트웨어를 활용하여 데이터 수집, 가공, 분석 등 컴퓨팅 시스템을 통한 과정평가로 디지털 문해력을 함양하도록 한다.",
              "easy": [
                "데이터 수집, 가공, 분석",
                "과정평가",
                "디지털 문해력"
              ],
              "normal": [
                "데이터 수집, 가공, 분석",
                "과정평가",
                "디지털 문해력"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-4ceer7",
                  "g-16gv77m",
                  "g-1aa6xkf"
                ],
                "normal": [
                  "g-4ceer7",
                  "g-16gv77m",
                  "g-1aa6xkf"
                ]
              }
            }
          ]
        }
      ]
    }
  },
  "ai-basic": {
    "인공지능의 이해": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "인공지능은 인간의 지능적인 행동을 모방하는 것으로 실생활에 도움을 준다.",
              "easy": [
                "인공지능",
                "지능적인 행동",
                "모방"
              ],
              "normal": [
                "인공지능",
                "인간",
                "지능적인 행동",
                "모방",
                "실생활",
                "도움"
              ],
              "id": "AI-01-CS-KI-01",
              "legacyId": "19een0-13nfn16",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g05",
                  "g03",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "탐색과 추론으로 문제를 해결하는 인공지능을 구현하는 것은 다양한 학문 분야에 활용된다.",
              "easy": [
                "탐색",
                "추론",
                "학문 분야"
              ],
              "normal": [
                "탐색",
                "추론",
                "문제",
                "해결",
                "인공지능",
                "구현",
                "다양한 학문 분야",
                "학문 분야",
                "활용"
              ],
              "id": "AI-01-CS-KI-02",
              "legacyId": "19een0-13s536i",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g07",
                  "n66-b62dd5b6",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "인공지능의 원리",
              "easy": [
                "인공지능",
                "원리"
              ],
              "normal": [
                "인공지능의 원리"
              ],
              "id": "AI-01-CS-KN-01",
              "legacyId": "1gji2b-1cbx27t",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              }
            },
            {
              "text": "인공지능과 탐색",
              "easy": [
                "인공지능",
                "탐색"
              ],
              "normal": [
                "인공지능",
                "탐색"
              ],
              "id": "AI-01-CS-KN-02",
              "legacyId": "1gji2b-1nxrkim",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "지식의 표현과 추론",
              "easy": [
                "지식",
                "표현",
                "추론"
              ],
              "normal": [
                "지식의 표현",
                "추론"
              ],
              "id": "AI-01-CS-KN-03",
              "legacyId": "1gji2b-11w7nfi",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g03",
                  "g04"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "인공지능 기반 문제 해결 사례 탐색하기",
              "easy": [
                "인공지능 기반",
                "문제 해결 사례"
              ],
              "normal": [
                "인공지능 기반",
                "문제 해결 사례",
                "탐색"
              ],
              "id": "AI-01-CS-PF-01",
              "legacyId": "1eyoxrk-h1vmp4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g04",
                  "g05"
                ],
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "탐색 알고리즘을 문제 해결에 적용하기",
              "easy": [
                "탐색 알고리즘",
                "문제 해결"
              ],
              "normal": [
                "탐색 알고리즘",
                "문제 해결",
                "적용"
              ],
              "id": "AI-01-CS-PF-02",
              "legacyId": "1eyoxrk-apy7is",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "추론을 통해 새로운 지식을 생성하는 방법 탐색하기",
              "easy": [
                "추론",
                "생성"
              ],
              "normal": [
                "추론",
                "새로운 지식",
                "생성",
                "방법",
                "탐색"
              ],
              "id": "AI-01-CS-PF-03",
              "legacyId": "1eyoxrk-k52veg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "인공지능의 필요성과 적용 가능성 인식",
              "easy": [
                "필요성",
                "적용 가능성"
              ],
              "normal": [
                "인공지능",
                "필요성",
                "적용 가능성",
                "인식"
              ],
              "id": "AI-01-CS-VA-01",
              "legacyId": "j8myzy-8q056n",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "인공지능을 활용하여 실생활 및 다양한 학문 분야의 문제를 해결하는 자세",
              "easy": [
                "인공지능",
                "학문 분야"
              ],
              "normal": [
                "인공지능",
                "실생활",
                "다양한 학문 분야",
                "학문 분야",
                "문제",
                "해결",
                "자세"
              ],
              "id": "AI-01-CS-VA-02",
              "legacyId": "j8myzy-r390c0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-52c8c246",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12인기01-01] 인공지능의 지능적 판단에 대한 이해를 바탕으로 인공지능을 활용한 실생활 및 다양한 학문 분야의 문제 해결 사례를 비교·분석한다.",
              "easy": [
                "지능적 판단",
                "학문 분야",
                "문제 해결 사례"
              ],
              "normal": [
                "인공지능",
                "지능적 판단",
                "실생활",
                "학문 분야",
                "문제 해결 사례",
                "비교·분석"
              ],
              "aliases": {},
              "id": "AI-01-AC-ST-01",
              "legacyId": "1rmtuks-1o0ypvj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g05",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ],
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "[12인기01-02] 인공지능에서 탐색의 중요성을 이해하고 문제 해결을 위한 탐색 과정을 설계한다.",
              "easy": [
                "중요성",
                "문제 해결",
                "탐색 과정"
              ],
              "normal": [
                "인공지능",
                "탐색",
                "중요성",
                "문제 해결",
                "탐색 과정",
                "설계"
              ],
              "aliases": {},
              "id": "AI-01-AC-ST-02",
              "legacyId": "1rmtuks-1gh133t",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g05",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12인기01-03] 맹목적 탐색과 정보 이용 탐색의 차이를 중심으로 지능적 탐색의 원리를 파악한다.",
              "easy": [
                "맹목적 탐색",
                "정보 이용",
                "차이",
                "지능적 탐색"
              ],
              "normal": [
                "맹목적 탐색",
                "정보 이용 탐색",
                "차이",
                "지능적 탐색",
                "원리",
                "파악"
              ],
              "aliases": {},
              "id": "AI-01-AC-ST-03",
              "legacyId": "1rmtuks-1c09pm7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g07",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "[12인기01-04] 지능적 탐색이 필요한 문제를 찾아보고 문제 해결을 위해 정보 이용 탐색 알고리즘을 적용한다.",
              "easy": [
                "지능적 탐색",
                "정보 이용",
                "탐색 알고리즘"
              ],
              "normal": [
                "지능적 탐색",
                "문제",
                "문제 해결",
                "정보 이용",
                "탐색 알고리즘",
                "적용"
              ],
              "aliases": {},
              "id": "AI-01-AC-ST-04",
              "legacyId": "1rmtuks-ipijai",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g06",
                  "g07",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              },
              "normalSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12인기01-05] 규칙과 사실을 활용하여 지식을 표현하고 새로운 지식을 추론하여 생성한다.",
              "easy": [
                "규칙",
                "사실",
                "추론"
              ],
              "normal": [
                "규칙",
                "사실",
                "지식",
                "표현",
                "새로운 지식",
                "추론",
                "생성"
              ],
              "aliases": {},
              "id": "AI-01-AC-ST-05",
              "legacyId": "1rmtuks-1lav635",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g05",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g08",
                  "g03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12인기01-01] 인공지능의 개념과 특성을 이해하고 튜링 테스트를 통해 인공지능의 지능적 판단에 대해 고찰하며 인공지능이 활용된 최신 사례를 분석하여 인공지능의 활용 범위와 중요성을 설명할 수 있어야 한다.",
              "easy": [
                "개념",
                "특성",
                "튜링 테스트",
                "지능적",
                "활용 범위"
              ],
              "normal": [
                "인공지능",
                "개념",
                "특성",
                "튜링 테스트",
                "지능적 판단",
                "고찰",
                "활용",
                "최신 사례",
                "분석",
                "활용 범위",
                "중요성",
                "설명"
              ],
              "aliases": {},
              "id": "AI-01-AC-EX-01",
              "legacyId": "1ykpcgs-1l2btu3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g12",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g08",
                  "g14",
                  "g09",
                  "g10",
                  "g06",
                  "g07",
                  "g11"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g12",
                  "g13"
                ],
                "g06": [
                  "g14",
                  "g15"
                ]
              },
              "yaho": [
                "튜링 테스트를 통해 인공지능의 지능적 판단에 대해 고찰하며",
                "인공지능이 활용된 최신 사례를 분석하여 인공지능의 활용 범위와 중요성을 설명할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "[12인기01-04] 지능적 탐색을 적용할 수 있는 퍼즐이나 길찾기 문제를 탐색하고, 최상 우선, A* 등의 정보 이용 탐색 방법을 적용한 인공지능 프로그램을 개발할 수 있어야 한다.",
              "easy": [
                "지능적 탐색",
                "최상",
                "우선",
                "A*",
                "정보 이용"
              ],
              "normal": [
                "지능적 탐색",
                "탐색",
                "적용",
                "퍼즐",
                "길찾기 문제",
                "최상 우선",
                "A*",
                "정보 이용 탐색 방법",
                "인공지능 프로그램",
                "개발"
              ],
              "aliases": {},
              "id": "AI-01-AC-EX-02",
              "legacyId": "1ykpcgs-8wyz5y",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g13",
                  "g14",
                  "g05",
                  "g15"
                ],
                "normal": [
                  "g01",
                  "g16",
                  "g09",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g08",
                  "g07",
                  "g10"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g11",
                  "g12"
                ],
                "g04": [
                  "g13",
                  "g14"
                ],
                "g06": [
                  "g15",
                  "g16"
                ],
                "g07": [
                  "g17",
                  "g18"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "인공지능의 다양한 사례를 탐색하여 실제로 많은 분야에 인공지능이 활용되고 있음을 인식하고 인공지능을 구현하는 방법으로서 탐색과 추론 방식에 대한 이해를 바탕으로 문제를 해결할 수 있는 능력을 함양하도록 교수·학습을 계획한다. 특히 탐색 방식으로 문제를 해결하는 과정에서는 탐색 알고리즘을 적용한 프로그램을 개발하는 방식으로 활동을 구성하도록 한다.",
              "easy": [
                "인공지능",
                "추론",
                "탐색 알고리즘",
                "프로그램"
              ],
              "normal": [
                "인공지능",
                "사례",
                "탐색",
                "분야",
                "활용",
                "추론",
                "방식",
                "문제를 해결",
                "문제",
                "해결",
                "능력",
                "함양",
                "학습",
                "문제를 해결하는 과정",
                "탐색 알고리즘",
                "프로그램",
                "개발"
              ],
              "aliases": {},
              "id": "AI-01-AC-CO-01",
              "legacyId": "1dahci5-1mlxe9w",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g08",
                  "g02",
                  "n66-9857d236",
                  "g09",
                  "g03",
                  "n66-1d9fa94c",
                  "n66-33f88d2a",
                  "g04",
                  "g05",
                  "g10",
                  "n66-cc5ae98e",
                  "n66-ca68aa54",
                  "n66-573406d7",
                  "g06",
                  "g07",
                  "g11"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "yaho": [
                "실제로 많은 분야에 인공지능이 활용되고 있음을 인식하고",
                "인공지능을 구현하는 방법으로서 탐색과 추론 방식에 대한 이해를 바탕으로",
                "문제를 해결할 수 있는 능력을 함양하도록 교수·학습을 계획한다",
                "특히 탐색 방식으로 문제를 해결하는 과정에서는 탐색 알고리즘을 적용한",
                "프로그램을 개발하는 방식으로 활동을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "실제 사례를 통해 인공지능의 개념을 정확하게 이해하고 있는지, 인공지능의 중요성을 설명할 수 있는지를 평가한다. 또한 문제 해결에 적합한 탐색 알고리즘을 선택하여 적용하였는지, 개발한 인공지능 프로그램이 문제를 해결하는 데 효과적이었는지에 중점을 두어 평가하도록 한다.",
              "easy": [
                "개념",
                "중요성",
                "탐색 알고리즘",
                "인공지능 프로그램",
                "효과적"
              ],
              "normal": [
                "실제 사례",
                "인공지능",
                "개념",
                "중요성",
                "평가",
                "문제 해결",
                "탐색 알고리즘",
                "선택",
                "적용",
                "인공지능 프로그램",
                "문제를 해결하는",
                "효과적"
              ],
              "aliases": {},
              "id": "AI-01-AC-CO-02",
              "legacyId": "1dahci5-poyyt4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g07",
                  "g01",
                  "g02",
                  "g03",
                  "g11",
                  "g08",
                  "g04",
                  "g09",
                  "g10",
                  "g05",
                  "n66-623c5f83",
                  "g06"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g01",
                  "g12"
                ]
              }
            }
          ]
        }
      ]
    },
    "인공지능과 학습": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "기계학습 기반의 인공지능을 구현하기 위해서는 문제 해결에 적합한 데이터와 기계학습 모델을 활용한다.",
              "easy": [
                "기계학습",
                "문제 해결",
                "적합한 데이터",
                "기계학습 모델"
              ],
              "normal": [
                "기계학습 기반",
                "인공지능",
                "문제 해결",
                "적합한 데이터",
                "기계학습 모델",
                "활용"
              ],
              "id": "AI-02-CS-KI-01",
              "legacyId": "19een0-x2kp36",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g07",
                  "g05"
                ],
                "normal": [
                  "g06",
                  "g02",
                  "g03",
                  "g07",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "딥러닝은 다중의 은닉층으로 구성된 인공신경망으로 복잡한 문제를 효과적으로 해결하는 데 활용된다.",
              "easy": [
                "딥러닝",
                "다중의 은닉층",
                "인공신경망"
              ],
              "normal": [
                "딥러닝",
                "다중의 은닉층",
                "인공신경망",
                "복잡한 문제",
                "효과적으로 해결",
                "활용"
              ],
              "id": "AI-02-CS-KI-02",
              "legacyId": "19een0-63oxqs",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ],
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "기계학습과 데이터",
              "easy": [
                "기계학습",
                "데이터"
              ],
              "normal": [
                "기계학습",
                "데이터"
              ],
              "id": "AI-02-CS-KN-01",
              "legacyId": "1gji2b-odpv5h",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "기계학습 알고리즘",
              "easy": [
                "기계학습 알고리즘"
              ],
              "normal": [
                "기계학습 알고리즘"
              ],
              "id": "AI-02-CS-KN-02",
              "legacyId": "1gji2b-1fuqd3x",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공신경망과 딥러닝",
              "easy": [
                "인공신경망",
                "딥러닝"
              ],
              "normal": [
                "인공신경망",
                "딥러닝"
              ],
              "id": "AI-02-CS-KN-03",
              "legacyId": "1gji2b-1am2oq0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "기계학습을 적용할 문제 정의하기",
              "easy": [
                "기계학습",
                "정의"
              ],
              "normal": [
                "기계학습",
                "문제 정의",
                "문제",
                "정의"
              ],
              "id": "AI-02-CS-PF-01",
              "legacyId": "1eyoxrk-qdq4r2",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "n66-744daa3f",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "해결하고자 하는 문제에 적합한 데이터 탐색하기",
              "easy": [
                "적합한 데이터",
                "탐색"
              ],
              "normal": [
                "문제",
                "적합한 데이터",
                "탐색"
              ],
              "id": "AI-02-CS-PF-02",
              "legacyId": "1eyoxrk-1asadaq",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "문제에 적합한 기계학습 알고리즘을 선정하고 모델 구현하기",
              "easy": [
                "기계학습 알고리즘",
                "모델"
              ],
              "normal": [
                "문제",
                "적합한",
                "기계학습 알고리즘",
                "선정",
                "모델",
                "구현"
              ],
              "id": "AI-02-CS-PF-03",
              "legacyId": "1eyoxrk-km4hfk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g02",
                  "g06",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "normalSplitMigrations": {
                "g05": [
                  "g07",
                  "g02"
                ]
              }
            },
            {
              "text": "딥러닝을 활용한 문제 해결 방법 탐색하고 구현하기",
              "easy": [
                "딥러닝",
                "문제 해결 방법"
              ],
              "normal": [
                "딥러닝",
                "문제 해결 방법",
                "탐색",
                "구현"
              ],
              "id": "AI-02-CS-PF-04",
              "legacyId": "1eyoxrk-nq425b",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "기계학습에 적용하는 데이터의 중요성 판단",
              "easy": [
                "기계학습",
                "중요성"
              ],
              "normal": [
                "기계학습",
                "데이터의 중요성",
                "데이터",
                "중요성",
                "판단"
              ],
              "id": "AI-02-CS-VA-01",
              "legacyId": "j8myzy-1xych2t",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "n66-61695c14",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "학습을 통한 인공지능의 효과성과 효율성 인식",
              "easy": [
                "효과성",
                "효율성"
              ],
              "normal": [
                "학습",
                "인공지능",
                "효과성",
                "효율성",
                "인식"
              ],
              "id": "AI-02-CS-VA-02",
              "legacyId": "j8myzy-tbityn",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12인기02-01] 기계학습을 적용할 문제를 정의하고 문제 해결에 필요한 데이터를 선정하여 수집한다.",
              "easy": [
                "기계학습",
                "데이터",
                "선정",
                "수집"
              ],
              "normal": [
                "기계학습",
                "문제",
                "정의",
                "문제 해결",
                "필요한 데이터",
                "데이터",
                "선정",
                "수집"
              ],
              "aliases": {},
              "id": "AI-02-AC-ST-01",
              "legacyId": "1rmtuks-11cpjav",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g07",
                  "n66-9bd55ad5",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12인기02-02] 수집한 데이터를 가공하여 핵심 속성을 추출한다.",
              "easy": [
                "가공",
                "핵심",
                "속성"
              ],
              "normal": [
                "데이터",
                "가공",
                "핵심 속성",
                "추출"
              ],
              "aliases": {},
              "id": "AI-02-AC-ST-02",
              "legacyId": "1rmtuks-dtvz86",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "[12인기02-03] 문제 해결에 적합한 기계학습의 유형과 알고리즘을 선정한다.",
              "easy": [
                "기계학습",
                "유형",
                "알고리즘"
              ],
              "normal": [
                "문제 해결",
                "적합한 기계학습",
                "유형",
                "알고리즘",
                "선정"
              ],
              "aliases": {},
              "id": "AI-02-AC-ST-03",
              "legacyId": "1rmtuks-1cdy1zk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12인기02-04] 훈련 데이터를 이용하여 학습을 진행하고, 테스트 데이터를 사용하여 성능을 평가한다.",
              "easy": [
                "훈련",
                "학습",
                "테스트 데이터",
                "성능"
              ],
              "normal": [
                "훈련 데이터",
                "학습",
                "테스트 데이터",
                "사용",
                "성능",
                "평가"
              ],
              "aliases": {},
              "id": "AI-02-AC-ST-04",
              "legacyId": "1rmtuks-16ibsk3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g06",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "n66-94f27dc4",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ],
                "g03": [
                  "g08",
                  "g07"
                ]
              }
            },
            {
              "text": "[12인기02-05] 인공신경망과 딥러닝의 특성에 대한 이해를 바탕으로 활용 분야를 탐색한다.",
              "easy": [
                "인공신경망",
                "딥러닝",
                "활용 분야"
              ],
              "normal": [
                "인공신경망",
                "딥러닝",
                "특성",
                "활용 분야",
                "탐색"
              ],
              "aliases": {},
              "id": "AI-02-AC-ST-05",
              "legacyId": "1rmtuks-1m8npuu",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12인기02-06] 딥러닝을 활용하여 실생활 및 다양한 학문 분야의 문제를 해결하고 성능을 평가한다.",
              "easy": [
                "딥러닝",
                "학문 분야",
                "성능"
              ],
              "normal": [
                "딥러닝",
                "실생활",
                "다양한 학문 분야",
                "학문 분야",
                "문제",
                "해결",
                "성능",
                "평가"
              ],
              "aliases": {},
              "id": "AI-02-AC-ST-06",
              "legacyId": "1rmtuks-14yqynp",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-b7a7f71d",
                  "g03",
                  "g04",
                  "g06",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12인기02-01] 전통적 프로그래밍과 대비되는 기계학습의 특성을 이해하여 기계학습 기반의 인공지능을 적용할 문제를 판단하고 문제 해결에 적합한 데이터를 수집할 수 있어야 한다. 이 과정에서 나타날 수 있는 데이터의 편향이 인공지능의 학습에 영향을 미칠 수 있음을 고려하여 데이터의 수집과 활용에 공정성을 추구할 수 있어야 한다.",
              "easy": [
                "전통적 프로그래밍",
                "기계학습",
                "특성",
                "데이터",
                "편향",
                "공정성"
              ],
              "normal": [
                "전통적 프로그래밍",
                "기계학습",
                "특성",
                "인공지능",
                "문제",
                "판단",
                "문제 해결",
                "데이터",
                "수집",
                "편향",
                "인공지능의 학습",
                "활용",
                "공정성"
              ],
              "aliases": {},
              "id": "AI-02-AC-EX-01",
              "legacyId": "1ykpcgs-dxbhl",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g07",
                  "g08",
                  "g09",
                  "g10",
                  "g04",
                  "g11",
                  "g05",
                  "g12",
                  "g13",
                  "g06"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15"
                ]
              }
            },
            {
              "text": "[12인기02-02] 기계학습에 사용할 데이터를 수집한 후 결측치와 이상치의 유무를 파악하고 문제 해결에 필요한 속성이 무엇인지 선별한 다음 문제 해결에 적합한 형태로 전처리할 수 있어야 한다.",
              "easy": [
                "기계학습",
                "결측치",
                "이상치",
                "속성",
                "전처리"
              ],
              "normal": [
                "기계학습",
                "데이터",
                "수집",
                "결측치",
                "이상치",
                "문제 해결",
                "속성",
                "선별",
                "적합한 형태",
                "전처리"
              ],
              "aliases": {},
              "id": "AI-02-AC-EX-02",
              "legacyId": "1ykpcgs-2naae6",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g07",
                  "g03",
                  "g04",
                  "g08",
                  "g05",
                  "g09",
                  "g10",
                  "g06"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "기계학습에 사용할 데이터를 수집한 후 결측치와 이상치의 유무를 파악하고",
                "문제 해결에 필요한 속성이 무엇인지 선별한 다음 문제 해결에 적합한 형태로",
                "전처리할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "[12인기02-03] 기계학습의 유형을 지도학습과 비지도학습, 강화학습 등으로 구분하고 해결해야 하는 문제의 특성을 고려하여 문제 해결에 적합한 유형을 선정할 수 있어야 한다. 또한 분류, 예측, 군집 등에 활용하는 기계학습 알고리즘을 이해하여 문제 해결에 적합한 알고리즘을 선정할 수 있어야 한다.",
              "easy": [
                "지도학습",
                "비지도학습",
                "강화학습",
                "분류",
                "예측",
                "군집"
              ],
              "normal": [
                "기계학습",
                "유형",
                "지도학습",
                "비지도학습",
                "강화학습",
                "문제",
                "특성",
                "선정",
                "분류",
                "예측",
                "군집",
                "기계학습 알고리즘",
                "적합한 알고리즘"
              ],
              "aliases": {},
              "id": "AI-02-AC-EX-03",
              "legacyId": "1ykpcgs-13kohbg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g09",
                  "g02",
                  "g03",
                  "g04",
                  "g10",
                  "g11",
                  "g12",
                  "g05",
                  "g06",
                  "g07",
                  "g13",
                  "g14"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              }
            },
            {
              "text": "[12인기02-06] 딥러닝을 기반으로 하는 컴퓨터 비전, 음성 인식, 자연어처리 기술을 구현하는 방식을 이용하고 적합한 딥러닝 기술을 활용하여 실생활 및 다양한 학문 분야의 문제를 해결할 수 있어야 한다. 문제 해결에 있어 딥러닝을 활용해 문제를 해결하는 경우와 다른 방법으로 문제를 해결한 경우의 차이점을 설명할 수 있어야 한다.",
              "easy": [
                "딥러닝",
                "컴퓨터 비전",
                "음성",
                "자연어처리",
                "학문 분야",
                "차이점"
              ],
              "normal": [
                "딥러닝",
                "컴퓨터 비전",
                "음성 인식",
                "자연어처리 기술",
                "구현",
                "적합한 딥러닝 기술",
                "실생활",
                "학문 분야",
                "문제",
                "해결",
                "다른 방법",
                "차이점",
                "설명"
              ],
              "aliases": {},
              "id": "AI-02-AC-EX-04",
              "legacyId": "1ykpcgs-1f74sop",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g15",
                  "g04",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g08",
                  "g09",
                  "g10",
                  "g05",
                  "g06",
                  "g11",
                  "g12",
                  "g13",
                  "g07",
                  "g14"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g15",
                  "g16"
                ]
              },
              "yaho": [
                "딥러닝을 기반으로 하는 컴퓨터 비전, 음성 인식, 자연어처리 기술을 구현하는 방식을 이용하고",
                "적합한 딥러닝 기술을 활용하여 실생활 및 다양한 학문 분야의 문제를 해결할 수 있어야 한다",
                "문제 해결에 있어 딥러닝을 활용해 문제를 해결하는 경우와 다른 방법으로",
                "문제를 해결한 경우의 차이점을 설명할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "해결하고자 하는 문제에 따라 기계학습의 사용이 적합한지를 판단할 수 있도록 적절한 문제 상황을 선정하도록 하며, 기계학습에서 데이터의 중요성을 인식하고 데이터를 수집하는 과정에서 데이터가 편향되지 않게 충분히 안내하도록 한다.",
              "easy": [
                "기계학습",
                "적합",
                "데이터",
                "중요성",
                "편향"
              ],
              "normal": [
                "문제",
                "기계학습",
                "사용",
                "적합한",
                "판단",
                "적절한",
                "문제 상황",
                "데이터의 중요성",
                "데이터",
                "중요성",
                "수집",
                "편향",
                "안내"
              ],
              "aliases": {},
              "id": "AI-02-AC-CO-01",
              "legacyId": "1dahci5-1e9i6b4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-bb903fe0",
                  "n66-d4973d59",
                  "g07",
                  "n66-c7a8e547",
                  "g08",
                  "n66-65a8aa57",
                  "g04",
                  "g05",
                  "g09",
                  "g06",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "기계학습의 사용이 적합한지를 판단할 수 있도록 적절한 문제 상황을 선정하도록",
                "하며, 기계학습에서 데이터의 중요성을 인식하고",
                "데이터를 수집하는 과정에서 데이터가 편향되지 않게 충분히 안내하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "기계학습과 딥러닝을 구현하는 과정에서 학습자의 수준에 따라 코드 작성의 방식을 달리 구성할 수 있다. 프로그래밍 역량이 낮은 학생은 이미 작성된 코드를 실행시켜 코드를 이해한 후 차츰 코드 일부를 수정하는 방식으로 학습할 수 있도록 하고, 프로그래밍 역량이 높은 학생은 작성이 완료되지 않은 코드를 스스로 완성하여 실행시킬 수 있도록 하는 등 교수·학습 단계를 세부적으로 구성하여 학습자의 흥미가 유지되도록 한다. 또한 기계학습과 딥러닝을 코드로 구현하는 학습을 원활하게 진행하기 위해 다양한 라이브러리 활용 방법을 충분히 안내한다.",
              "easy": [
                "기계학습",
                "딥러닝",
                "코드",
                "프로그래밍 역량",
                "작성된 코드",
                "라이브러리"
              ],
              "normal": [
                "기계학습",
                "학습",
                "딥러닝",
                "학습자",
                "수준",
                "코드 작성",
                "코드",
                "방식",
                "프로그래밍 역량",
                "작성된 코드",
                "실행",
                "일부",
                "수정",
                "완성",
                "교수·학습 단계",
                "흥미",
                "라이브러리",
                "활용 방법"
              ],
              "aliases": {},
              "id": "AI-02-AC-CO-02",
              "legacyId": "1dahci5-mr8329",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g03",
                  "g09",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "n66-898ef9af",
                  "g02",
                  "g06",
                  "g07",
                  "g08",
                  "g04",
                  "n66-784d7dcb",
                  "g03",
                  "g09",
                  "g12",
                  "n66-c096f5cd",
                  "g10",
                  "g11",
                  "g13",
                  "g14",
                  "g05",
                  "g15"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05",
                  "y66-06",
                  "y66-07",
                  "y66-08"
                ]
              },
              "yaho": [
                "기계학습과 딥러닝을 구현하는 과정에서 학습자의 수준에 따라 코드 작성의",
                "방식을 달리 구성할 수 있다",
                "작성된 코드를 실행시켜 코드를 이해한 후 차츰 코드 일부를 수정하는 방식으로",
                "학습할 수 있도록 하고, 프로그래밍 역량이 높은 학생은 작성이 완료되지 않은",
                "코드를 스스로 완성하여 실행시킬 수 있도록 하는 등 교수·학습 단계를 세부적으로 구성하여",
                "학습자의 흥미가 유지되도록 한다",
                "또한 기계학습과 딥러닝을 코드로 구현하는 학습을 원활하게 진행하기 위해",
                "다양한 라이브러리 활용 방법을 충분히 안내한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04",
                  "y66-05",
                  "y66-06"
                ],
                "y03": [
                  "y66-07",
                  "y66-08"
                ]
              }
            },
            {
              "text": "문제 해결에 사용된 데이터와 기계학습 유형, 기계학습 알고리즘이 해결하고자 하는 문제의 특성에 비추어 적합한지를 평가한다. 또한 이미 개발되어 있는 딥러닝 프로그램 코드의 활용을 권장하되 실생활 및 다양한 학문 분야의 문제를 스스로 생각하여 해결할 수 있도록 교수·학습을 구성하고, 학생의 학습 과정과 창의적인 아이디어를 중심으로 평가 루브릭을 작성하여 평가하도록 한다.",
              "easy": [
                "데이터",
                "기계학습 유형",
                "기계학습 알고리즘",
                "딥러닝",
                "프로그램 코드",
                "창의적인",
                "아이디어"
              ],
              "normal": [
                "문제 해결",
                "문제",
                "데이터",
                "기계학습 유형",
                "기계학습 알고리즘",
                "문제의 특성",
                "평가",
                "딥러닝 프로그램 코드",
                "실생활",
                "학문 분야",
                "창의적인 아이디어",
                "평가 루브릭"
              ],
              "aliases": {},
              "id": "AI-02-AC-CO-03",
              "legacyId": "1dahci5-p394hr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g14",
                  "g15",
                  "g16",
                  "g17"
                ],
                "normal": [
                  "g08",
                  "g05",
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g11",
                  "g04",
                  "g12",
                  "g13",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g14",
                  "g15"
                ],
                "g06": [
                  "g16",
                  "g17"
                ]
              },
              "yaho": [
                "문제 해결에 사용된 데이터와 기계학습 유형",
                "기계학습 알고리즘이 해결하고자 하는 문제의 특성에 비추어 적합한지를 평가한다",
                "딥러닝 프로그램 코드의 활용을 권장하되 실생활 및 다양한 학문 분야의 문제를 스스로 생각하여",
                "해결할 수 있도록 교수·학습을 구성하고",
                "학생의 학습 과정과 창의적인 아이디어를 중심으로 평가 루브릭을 작성하여 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            }
          ]
        }
      ]
    },
    "인공지능의 사회적 영향": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "인공지능이 현대 사회에 끼치는 영향력이 커지고 있고 이에 따라 직업의 변화 속도가 빨라지고 있다.",
              "easy": [
                "현대 사회",
                "영향력",
                "직업의 변화 속도"
              ],
              "normal": [
                "인공지능",
                "현대 사회",
                "영향력",
                "직업의 변화 속도",
                "직업",
                "변화 속도"
              ],
              "id": "AI-03-CS-KI-01",
              "legacyId": "19een0-1ng0ned",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "c66-087a5f13"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "n66-087a5f13",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ],
                "g05": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "인공지능을 올바르게 활용하기 위해서는 인공지능에 의해 발생할 수 있는 윤리적 문제에 대한 이해가 필요하다.",
              "easy": [
                "올바르게 활용",
                "윤리적 문제"
              ],
              "normal": [
                "인공지능",
                "올바르게 활용",
                "윤리적 문제",
                "이해"
              ],
              "id": "AI-03-CS-KI-02",
              "legacyId": "19een0-ybpblm",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ],
                "g03": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "인공지능의 발전과 사회 변화",
              "easy": [
                "인공지능",
                "발전",
                "사회 변화"
              ],
              "normal": [
                "인공지능",
                "발전",
                "사회 변화"
              ],
              "id": "AI-03-CS-KN-01",
              "legacyId": "1gji2b-1gzj6b3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능과 진로",
              "easy": [
                "인공지능",
                "진로"
              ],
              "normal": [
                "인공지능",
                "진로"
              ],
              "id": "AI-03-CS-KN-02",
              "legacyId": "1gji2b-cnnvo9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능과 윤리",
              "easy": [
                "인공지능",
                "윤리"
              ],
              "normal": [
                "인공지능",
                "윤리"
              ],
              "id": "AI-03-CS-KN-03",
              "legacyId": "1gji2b-1ylgbux",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "인공지능으로 해결할 수 있는 사회적 문제 탐색하기",
              "easy": [
                "사회적",
                "탐색"
              ],
              "normal": [
                "인공지능",
                "사회적 문제",
                "탐색"
              ],
              "id": "AI-03-CS-PF-01",
              "legacyId": "1eyoxrk-kiy29v",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g05"
                ]
              }
            },
            {
              "text": "인공지능에 의해 변화하는 인간의 삶과 직업의 양상 파악하기",
              "easy": [
                "인간의 삶",
                "직업",
                "양상"
              ],
              "normal": [
                "인공지능",
                "변화",
                "인간의 삶",
                "직업의 양상",
                "파악"
              ],
              "id": "AI-03-CS-PF-02",
              "legacyId": "1eyoxrk-7694yc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "인공지능과 인간의 공존 방안에 대해 탐색하기",
              "easy": [
                "인간",
                "공존 방안"
              ],
              "normal": [
                "인공지능",
                "인간",
                "공존 방안",
                "탐색"
              ],
              "id": "AI-03-CS-PF-03",
              "legacyId": "1eyoxrk-1iz6kcg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능과 관련된 윤리적 딜레마 상황에 대해 논의하기",
              "easy": [
                "윤리적 딜레마 상황",
                "논의"
              ],
              "normal": [
                "인공지능",
                "윤리적 딜레마 상황",
                "논의"
              ],
              "id": "AI-03-CS-PF-04",
              "legacyId": "1eyoxrk-12rcuz6",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g05",
                  "g06"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "진로 및 직업 관점에서 인공지능의 중요성 인식",
              "easy": [
                "직업",
                "중요성"
              ],
              "normal": [
                "진로",
                "직업",
                "관점",
                "인공지능",
                "중요성",
                "인식"
              ],
              "id": "AI-03-CS-VA-01",
              "legacyId": "j8myzy-6fl54x",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능의 다양한 측면에 대한 비판적 자세와 윤리적 태도",
              "easy": [
                "비판적 자세",
                "윤리적 태도"
              ],
              "normal": [
                "인공지능",
                "다양한 측면",
                "비판적 자세",
                "윤리적 태도"
              ],
              "id": "AI-03-CS-VA-02",
              "legacyId": "j8myzy-txu4c5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12인기03-01] 인공지능의 발전으로 인한 사회 변화를 살펴보고 인공지능으로 해결할 수 있는 사회적 문제를 분석한다.",
              "easy": [
                "인공지능",
                "사회 변화",
                "사회적",
                "분석"
              ],
              "normal": [
                "인공지능",
                "발전",
                "사회 변화",
                "사회적 문제",
                "분석"
              ],
              "aliases": {},
              "id": "AI-03-AC-ST-01",
              "legacyId": "1rmtuks-t5gfgv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g06",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12인기03-02] 인공지능에 의해 변화하는 인간의 삶과 직업의 양상에 대해 이해하고 진로를 탐색한다.",
              "easy": [
                "인간의 삶",
                "직업",
                "양상",
                "진로"
              ],
              "normal": [
                "인공지능",
                "변화",
                "인간의 삶",
                "직업의 양상",
                "이해",
                "진로",
                "탐색"
              ],
              "aliases": {},
              "id": "AI-03-AC-ST-02",
              "legacyId": "1rmtuks-p0j4il",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g08",
                  "g09",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "[12인기03-03] 인공지능에 대한 비판적 자세를 바탕으로 인공지능과 인간의 공존 방안을 도출한다.",
              "easy": [
                "인공지능",
                "비판적 자세",
                "인간",
                "공존 방안"
              ],
              "normal": [
                "인공지능",
                "비판적 자세",
                "인간",
                "공존 방안",
                "도출"
              ],
              "aliases": {},
              "id": "AI-03-AC-ST-03",
              "legacyId": "1rmtuks-7o67fd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12인기03-04] 인공지능의 활용사례와 윤리적 딜레마 상황을 인공지능 윤리 관점에서 분석한다.",
              "easy": [
                "활용사례",
                "윤리적 딜레마 상황",
                "인공지능 윤리"
              ],
              "normal": [
                "인공지능",
                "활용사례",
                "윤리적 딜레마 상황",
                "인공지능 윤리",
                "관점",
                "분석"
              ],
              "aliases": {},
              "id": "AI-03-AC-ST-04",
              "legacyId": "1rmtuks-1evmb6t",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g07",
                  "g08",
                  "g09"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12인기03-03] 인공지능에 대한 일방적인 수용 또는 거부보다는 비판적인 자세를 바탕으로 인간과 공존해야 하는 존재로서 인공지능의 역할을 제시할 수 있어야 한다. 인공지능을 대하는 인간의 태도에 대한 윤리적 고찰을 통해 바람직한 공존 방식을 규정할 수 있어야 한다.",
              "easy": [
                "일방적인",
                "거부",
                "비판적인",
                "인간",
                "윤리적",
                "고찰"
              ],
              "normal": [
                "인공지능",
                "일방적인 수용",
                "거부",
                "비판적인 자세",
                "인간",
                "공존",
                "인공지능의 역할",
                "인간의 태도",
                "윤리적 고찰",
                "바람직한 공존 방식"
              ],
              "aliases": {},
              "id": "AI-03-AC-EX-01",
              "legacyId": "1ykpcgs-ioptwx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g11",
                  "g02",
                  "g13",
                  "g04",
                  "g16",
                  "g17"
                ],
                "normal": [
                  "g08",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g09",
                  "g07",
                  "g10"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g11",
                  "g12"
                ],
                "g03": [
                  "g13",
                  "g14"
                ],
                "g06": [
                  "g08",
                  "g15"
                ],
                "g07": [
                  "g16",
                  "g17"
                ]
              }
            },
            {
              "text": "[12인기03-04] 인간의 편향성에 대한 이해를 바탕으로 알고리즘과 데이터의 편향성으로 인해 인공지능이 사회에 끼치는 영향을 이해하고, 인공지능으로 인한 딜레마 상황에서 윤리적인 판단과 선택을 할 수 있어야 한다. 현재까지 정의되어진 인공지능 윤리(지침)와 관련하여 인공지능 개발자, 사용자, 운영⋅관리자 관점을 살펴보고, 인공지능 기술 활용으로 발생 가능한 윤리적 쟁점에 대하여 사회적 책임과 공정성의 가치를 판단할 수 있어야 한다.",
              "easy": [
                "편향성",
                "윤리적인",
                "선택",
                "인공지능 윤리",
                "사회적",
                "책임",
                "공정성"
              ],
              "normal": [
                "인간의 편향성",
                "편향성",
                "알고리즘",
                "데이터",
                "사회",
                "영향",
                "딜레마 상황",
                "윤리적인 판단",
                "판단",
                "선택",
                "인공지능 윤리(지침)",
                "인공지능 개발자",
                "사용자",
                "운영⋅관리자",
                "윤리적 쟁점",
                "사회적 책임",
                "공정성",
                "가치"
              ],
              "aliases": {},
              "id": "AI-03-AC-EX-02",
              "legacyId": "1ykpcgs-ac33sy",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g19",
                  "g06",
                  "g21",
                  "g23",
                  "g24",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03",
                  "g10",
                  "g11",
                  "g12",
                  "g05",
                  "g20",
                  "g06",
                  "g07",
                  "g13",
                  "g14",
                  "g15",
                  "g16",
                  "g08",
                  "g09",
                  "g17"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g18",
                  "g04"
                ],
                "g05": [
                  "g19",
                  "g20"
                ],
                "g07": [
                  "g21",
                  "g22"
                ],
                "g08": [
                  "g23",
                  "g24"
                ]
              },
              "yaho": [
                "바탕으로 알고리즘과 데이터의 편향성으로 인해 인공지능이 사회에 끼치는 영향을 이해하고",
                "인공지능으로 인한 딜레마 상황에서 윤리적인 판단과 선택을 할 수 있어야 한다",
                "인공지능 윤리(지침)와 관련하여 인공지능 개발자, 사용자, 운영⋅관리자 관점을 살펴보고",
                "인공지능 기술 활용으로 발생 가능한 윤리적 쟁점에 대하여",
                "사회적 책임과 공정성의 가치를 판단할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "인공지능의 사회적 가치와 영향력이 중요하다는 것과 새롭게 고려해야 할 윤리적 쟁점에 대한 충분한 사회적 논의 과정이 필요하다는 것을 전제로 인공지능 사회의 구성원으로서 갖추어야 할 인공지능 윤리의식과 가치 판단 능력을 함양하여 인공지능 시대의 사회적 책임과 공정성을 실천할 수 있도록 하는 데 중점을 두고 교수·학습을 구성하도록 한다.",
              "easy": [
                "윤리적",
                "쟁점",
                "윤리의식",
                "가치 판단",
                "책임",
                "공정성"
              ],
              "normal": [
                "인공지능",
                "사회적 가치",
                "영향력",
                "윤리적 쟁점",
                "사회적 논의 과정",
                "인공지능 사회",
                "구성원",
                "인공지능 윤리의식",
                "가치 판단 능력",
                "사회적 책임",
                "공정성",
                "실천"
              ],
              "aliases": {},
              "id": "AI-03-AC-CO-01",
              "legacyId": "1dahci5-1v4j0cr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g15",
                  "g16",
                  "g17",
                  "g18",
                  "g20",
                  "g07"
                ],
                "normal": [
                  "g08",
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g10",
                  "g11",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g13",
                  "g14"
                ],
                "g03": [
                  "g15",
                  "g16"
                ],
                "g04": [
                  "g08",
                  "g17"
                ],
                "g05": [
                  "g18",
                  "g19"
                ],
                "g06": [
                  "g13",
                  "g20"
                ]
              },
              "yaho": [
                "중요하다는 것과 새롭게 고려해야 할 윤리적 쟁점에 대한 충분한",
                "사회적 논의 과정이 필요하다는 것을 전제로 인공지능 사회의 구성원으로서",
                "갖추어야 할 인공지능 윤리의식과 가치 판단 능력을 함양하여",
                "인공지능 시대의 사회적 책임과 공정성을 실천할 수 있도록 하는 데 중점을",
                "두고 교수·학습을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "인공지능의 발전으로 인한 사회의 변화를 조사하고 인공지능에 의해 변화할 미래 사회의 모습을 예측하는 과정에서 자신의 진로를 구체적으로 설계하기 위해 충분한 자료를 제공하도록 한다.",
              "easy": [
                "인공지능",
                "변화",
                "미래 사회",
                "진로",
                "구체적으로 설계"
              ],
              "normal": [
                "인공지능",
                "발전",
                "사회",
                "변화",
                "미래 사회",
                "예측",
                "진로",
                "구체적으로 설계",
                "자료"
              ],
              "aliases": {},
              "id": "AI-03-AC-CO-02",
              "legacyId": "1dahci5-e68p8m",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g05",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g05",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "인공지능의 발전으로 인한 사회의 변화를 조사하고",
                "인공지능에 의해 변화할 미래 사회의 모습을 예측하는 과정에서 자신의 진로를",
                "구체적으로 설계하기 위해 충분한 자료를 제공하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "인공지능과 관련한 윤리적 쟁점 사례를 조사하고 구체적인 사안을 주제로 하는 토론 활동의 과정에서 인공지능 윤리의 중요성과 인공지능과 인간의 관계를 올바르게 설명할 수 있는지를 평가하도록 한다. 이 과정에서 근거를 바탕으로 자신의 주장을 펼치고 타인의 견해를 존중하는 성숙한 토론 문화를 조성하도록 한다.",
              "easy": [
                "윤리적 쟁점 사례",
                "인공지능 윤리",
                "근거",
                "타인",
                "견해",
                "토론 문화"
              ],
              "normal": [
                "인공지능",
                "윤리적 쟁점 사례",
                "조사",
                "토론 활동",
                "인공지능 윤리",
                "중요성",
                "인간의 관계",
                "근거",
                "주장",
                "타인의 견해",
                "존중",
                "성숙한 토론 문화"
              ],
              "aliases": {},
              "id": "AI-03-AC-CO-03",
              "legacyId": "1dahci5-eyf899",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g06",
                  "g21",
                  "g22",
                  "g08"
                ],
                "normal": [
                  "g04",
                  "g01",
                  "g09",
                  "g02",
                  "g03",
                  "g10",
                  "g05",
                  "g06",
                  "g11",
                  "g07",
                  "g12",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g14",
                  "g15",
                  "g16"
                ],
                "g02": [
                  "g17",
                  "g18"
                ],
                "g05": [
                  "g19",
                  "g20"
                ],
                "g07": [
                  "g21",
                  "g22"
                ]
              },
              "yaho": [
                "윤리적 쟁점 사례를 조사하고 구체적인 사안을 주제로 하는 토론 활동의 과정에서",
                "인공지능 윤리의 중요성과 인공지능과 인간의 관계를 올바르게 설명할 수 있는지를 평가하도록 한다",
                "이 과정에서 근거를 바탕으로 자신의 주장을 펼치고 타인의 견해를 존중하는",
                "성숙한 토론 문화를 조성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04"
                ]
              }
            }
          ]
        }
      ]
    },
    "인공지능 프로젝트": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "인공지능은 다양한 분야와 융합하여 새로운 가치를 창출하는 데 도움을 준다.",
              "easy": [
                "인공지능",
                "융합",
                "새로운 가치"
              ],
              "normal": [
                "인공지능",
                "다양한 분야",
                "융합",
                "새로운 가치",
                "창출"
              ],
              "id": "AI-04-CS-KI-01",
              "legacyId": "19een0-hzjw7n",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "인공지능은 지속가능발전목표를 달성하는 데 도움을 준다.",
              "easy": [
                "인공지능",
                "지속가능발전목표"
              ],
              "normal": [
                "인공지능",
                "지속가능발전목표",
                "달성"
              ],
              "id": "AI-04-CS-KI-02",
              "legacyId": "19een0-1ky9p45",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "인공지능과 지속가능발전목표",
              "easy": [
                "인공지능",
                "지속가능발전목표"
              ],
              "normal": [
                "인공지능",
                "지속가능발전목표"
              ],
              "id": "AI-04-CS-KN-01",
              "legacyId": "1gji2b-gt37xw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능 문제 해결 절차",
              "easy": [
                "인공지능",
                "문제 해결",
                "절차"
              ],
              "normal": [
                "인공지능",
                "문제 해결 절차"
              ],
              "id": "AI-04-CS-KN-02",
              "legacyId": "1gji2b-ftvwe7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g02",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03",
                  "g04"
                ]
              },
              "normalSplitMigrations": {
                "g01": [
                  "g02",
                  "g05"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "인공지능 프로젝트 주제 탐색하기",
              "easy": [
                "인공지능 프로젝트",
                "주제",
                "탐색"
              ],
              "normal": [
                "인공지능 프로젝트",
                "주제",
                "탐색"
              ],
              "id": "AI-04-CS-PF-01",
              "legacyId": "1eyoxrk-1w98gbx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g04",
                  "g05"
                ]
              }
            },
            {
              "text": "인공지능 프로젝트 수행 계획 구안하기",
              "easy": [
                "인공지능 프로젝트",
                "수행 계획",
                "구안"
              ],
              "normal": [
                "인공지능 프로젝트",
                "수행 계획",
                "구안"
              ],
              "id": "AI-04-CS-PF-02",
              "legacyId": "1eyoxrk-y76pa4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g04",
                  "g05"
                ]
              }
            },
            {
              "text": "인공지능 소프트웨어 개발 및 평가 방법 설정하기",
              "easy": [
                "인공지능 소프트웨어",
                "개발",
                "평가 방법"
              ],
              "normal": [
                "인공지능 소프트웨어",
                "개발",
                "평가 방법",
                "설정"
              ],
              "id": "AI-04-CS-PF-03",
              "legacyId": "1eyoxrk-15i8kny",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "인류의 지속가능발전에서 인공지능의 중요성 및 가치를 판단하는 태도",
              "easy": [
                "지속가능발전",
                "중요성"
              ],
              "normal": [
                "인류",
                "지속가능발전",
                "인공지능",
                "중요성",
                "가치",
                "판단",
                "태도"
              ],
              "id": "AI-04-CS-VA-01",
              "legacyId": "j8myzy-16m8os0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g05",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "인공지능 프로젝트를 수행하는 과정에서 협력적으로 문제를 해결하는 자세",
              "easy": [
                "인공지능 프로젝트",
                "협력적으로"
              ],
              "normal": [
                "인공지능 프로젝트",
                "수행",
                "협력적으로",
                "문제",
                "해결",
                "자세"
              ],
              "id": "AI-04-CS-VA-02",
              "legacyId": "j8myzy-1j9mje1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "프로젝트를 수행하는 과정에서 윤리 문제 등 사회적 영향 인식",
              "easy": [
                "윤리 문제",
                "사회적 영향"
              ],
              "normal": [
                "프로젝트",
                "수행",
                "윤리 문제",
                "사회적 영향",
                "인식"
              ],
              "id": "AI-04-CS-VA-03",
              "legacyId": "j8myzy-1jzgd57",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12인기04-01] 지속가능발전목표를 해결하기 위해 인공지능을 적용할 수 있는 방안을 탐색하고 인공지능 프로젝트 활동에 적합한 주제를 도출한다.",
              "easy": [
                "지속가능발전목표",
                "방안",
                "인공지능 프로젝트 활동",
                "주제"
              ],
              "normal": [
                "지속가능발전목표",
                "인공지능",
                "적용",
                "방안",
                "탐색",
                "인공지능 프로젝트 활동",
                "적합한 주제",
                "도출"
              ],
              "aliases": {},
              "id": "AI-04-AC-ST-01",
              "legacyId": "1rmtuks-16z927h",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g08",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g07",
                  "g08",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g02",
                  "g11"
                ]
              }
            },
            {
              "text": "[12인기04-02] 인공지능 문제 해결 과정에 기반하여 프로젝트 수행 계획을 구안한다.",
              "easy": [
                "인공지능",
                "문제 해결 과정",
                "수행 계획"
              ],
              "normal": [
                "인공지능",
                "문제 해결 과정",
                "프로젝트 수행 계획",
                "구안"
              ],
              "aliases": {},
              "id": "AI-04-AC-ST-02",
              "legacyId": "1rmtuks-1nydg1d",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g09",
                  "g08"
                ],
                "normal": [
                  "g04",
                  "g09",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g04",
                  "g05",
                  "g06"
                ],
                "g02": [
                  "g07",
                  "g08"
                ]
              },
              "normalSplitMigrations": {
                "g01": [
                  "g04",
                  "g09"
                ]
              }
            },
            {
              "text": "[12인기04-03] 인공지능 프로젝트를 수행하는 과정에서 협력적인 문제 해결 자세를 바탕으로 인공지능 소프트웨어를 개발한다.",
              "easy": [
                "인공지능 프로젝트",
                "협력적인",
                "문제 해결 자세",
                "인공지능 소프트웨어"
              ],
              "normal": [
                "인공지능 프로젝트",
                "수행",
                "협력적인",
                "문제 해결 자세",
                "인공지능 소프트웨어",
                "개발"
              ],
              "aliases": {},
              "id": "AI-04-AC-ST-03",
              "legacyId": "1rmtuks-1ouc6m9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g08",
                  "g11",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g08",
                  "g11",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ],
                "g02": [
                  "g08",
                  "g09",
                  "g10"
                ]
              },
              "normalSplitMigrations": {
                "g02": [
                  "g08",
                  "g11"
                ]
              }
            },
            {
              "text": "[12인기04-04] 인공지능의 사회적 영향을 고려하여 인공지능 소프트웨어를 개발하고 평가 결과를 반영하여 성능을 개선한다.",
              "easy": [
                "사회적 영향",
                "인공지능 소프트웨어",
                "평가 결과",
                "성능"
              ],
              "normal": [
                "인공지능",
                "사회적 영향",
                "인공지능 소프트웨어",
                "개발",
                "평가 결과",
                "반영",
                "성능",
                "개선"
              ],
              "aliases": {},
              "id": "AI-04-AC-ST-04",
              "legacyId": "1rmtuks-1hnti1a",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g07",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12인기04-01] 지속가능발전목표는 2015년 유엔 총회에서 결의한 것으로 총 17개의 주요 목표와 169개의 세부 목표로 구성되어 있다는 것을 이해하고, 17개의 주요 목표를 통해 현재 인류가 직면하고 있는 위기가 무엇인지 인식할 수 있어야 한다. 인공지능을 활용하여 달성할 수 있는 목표에는 어떤 것이 있는지를 살펴보고 인공지능 프로젝트 활동에 적합한 주제를 도출할 수 있어야 한다.",
              "easy": [
                "지속가능발전목표",
                "2015년",
                "주요 목표",
                "169개",
                "세부 목표",
                "인류",
                "위기"
              ],
              "normal": [
                "지속가능발전목표",
                "목표",
                "2015년",
                "유엔 총회",
                "17개의 주요 목표",
                "169개의 세부 목표",
                "인류",
                "위기",
                "인공지능",
                "인공지능 프로젝트 활동",
                "주제",
                "도출"
              ],
              "aliases": {},
              "id": "AI-04-AC-EX-01",
              "legacyId": "1ykpcgs-39fjzx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g15",
                  "g16",
                  "g17",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g10",
                  "g02",
                  "g08",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g09",
                  "g11",
                  "g12",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g14",
                  "g15"
                ],
                "g04": [
                  "g16",
                  "g17"
                ],
                "g07": [
                  "g09",
                  "g18"
                ]
              },
              "yaho": [
                "유엔 총회에서 결의한 것으로 총 17개의 주요 목표와 169개의 세부 목표로",
                "구성되어 있다는 것을 이해하고, 17개의 주요 목표를 통해 현재 인류가 직면하고",
                "있는 위기가 무엇인지 인식할 수 있어야 한다",
                "인공지능을 활용하여 달성할 수 있는 목표에는 어떤 것이 있는지를 살펴보고",
                "인공지능 프로젝트 활동에 적합한 주제를 도출할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "[12인기04-02] 문제 정의, 문제 해결에 적합한 데이터 수집 및 전처리, 기계학습 유형과 알고리즘 선정, 기계학습을 통한 모델 생성, 성능 평가 및 수정 등의 인공지능 문제 해결 과정에 따라 프로젝트 수행 계획을 구안할 수 있어야 한다.",
              "easy": [
                "정의",
                "문제 해결",
                "데이터 수집",
                "전처리",
                "기계학습 유형",
                "알고리즘",
                "모델",
                "생성",
                "성능 평가",
                "수정"
              ],
              "normal": [
                "문제 정의",
                "문제 해결",
                "데이터 수집",
                "전처리",
                "기계학습 유형",
                "기계학습",
                "알고리즘 선정",
                "모델 생성",
                "성능 평가",
                "수정",
                "인공지능",
                "문제 해결 과정",
                "프로젝트 수행 계획",
                "구안"
              ],
              "aliases": {},
              "id": "AI-04-AC-EX-02",
              "legacyId": "1ykpcgs-1focc01",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g16",
                  "g10",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g17",
                  "g18",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g10",
                  "g02",
                  "g03",
                  "g04",
                  "g12",
                  "g11",
                  "g06",
                  "g07",
                  "g08",
                  "g19",
                  "g21",
                  "g13",
                  "g14"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g15",
                  "g16"
                ],
                "g06": [
                  "g17",
                  "g18"
                ],
                "g09": [
                  "g19",
                  "g10",
                  "g20"
                ]
              },
              "normalSplitMigrations": {
                "g09": [
                  "g19",
                  "g21"
                ]
              },
              "yaho": [
                "데이터 수집 및 전처리, 기계학습 유형과 알고리즘 선정, 기계학습을 통한 모델 생성",
                "성능 평가 및 수정 등의 인공지능 문제 해결 과정에 따라",
                "프로젝트 수행 계획을 구안할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "인공지능 프로젝트를 위한 주제 선정 과정에서 인류가 직면해 있는 다양한 위기를 충분히 인식할 수 있도록 하고, 이러한 위기를 극복하는 다양한 방법 중 하나로 인공지능이 중요한 역할을 수행할 수 있다는 점을 강조하도록 한다. 또한 인공지능을 활용하는 방법적인 측면에서 직접 구현하기가 어려운 부분이 있더라도 학습자의 아이디어를 존중하여 다양한 생각이 발산될 수 있는 활동을 구성하도록 한다.",
              "easy": [
                "인공지능 프로젝트",
                "인류",
                "위기",
                "중요한 역할",
                "아이디어"
              ],
              "normal": [
                "인공지능 프로젝트",
                "인공지능",
                "주제 선정",
                "인류",
                "위기",
                "극복",
                "다양한 방법",
                "중요한 역할",
                "법적",
                "측면",
                "직접 구현",
                "구현",
                "어려운",
                "학습자의 아이디어",
                "존중",
                "다양한 생각",
                "발산"
              ],
              "aliases": {},
              "id": "AI-04-AC-CO-01",
              "legacyId": "1dahci5-z9l242",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g16"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g07",
                  "g02",
                  "g03",
                  "g08",
                  "n66-6e8725fe",
                  "g09",
                  "n66-b2c32ab2",
                  "n66-cdf278a8",
                  "n66-452688ee",
                  "g10",
                  "n66-13fbf8ef",
                  "g06",
                  "g11",
                  "g12",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g04",
                  "g14"
                ],
                "g06": [
                  "g15",
                  "g16"
                ]
              },
              "yaho": [
                "주제 선정 과정에서 인류가 직면해 있는 다양한 위기를 충분히 인식할 수 있도록 하고",
                "이러한 위기를 극복하는 다양한 방법 중 하나로 인공지능이 중요한 역할을",
                "수행할 수 있다는 점을 강조하도록 한다",
                "또한 인공지능을 활용하는 방법적인 측면에서 직접 구현하기가 어려운 부분이",
                "있더라도 학습자의 아이디어를 존중하여 다양한 생각이 발산될 수 있는 활동을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "인공지능 프로젝트를 수행하는 과정에서 인공지능 소프트웨어의 완성도뿐만 아니라 주제의 적절성, 문제 해결 방식의 창의성, 다른 사람과의 협업 능력 등 다각적인 측면을 골고루 반영하여 평가할 수 있는 루브릭을 제작하도록 한다.",
              "easy": [
                "인공지능 소프트웨어",
                "완성도",
                "창의성",
                "협업",
                "능력"
              ],
              "normal": [
                "인공지능 프로젝트",
                "인공지능 소프트웨어",
                "완성도",
                "주제의 적절성",
                "문제 해결 방식",
                "창의성",
                "협업 능력",
                "다각적인 측면",
                "평가",
                "루브릭"
              ],
              "aliases": {},
              "id": "AI-04-AC-CO-02",
              "legacyId": "1dahci5-azqi9i",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g05",
                  "g15",
                  "g16"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g05",
                  "g06",
                  "g09",
                  "g10",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g11",
                  "g12"
                ],
                "g04": [
                  "g13",
                  "g14"
                ],
                "g06": [
                  "g15",
                  "g16"
                ]
              },
              "yaho": [
                "과정에서 인공지능 소프트웨어의 완성도뿐만 아니라 주제의 적절성",
                "문제 해결 방식의 창의성, 다른 사람과의 협업 능력 등 다각적인 측면을 골고루 반영하여",
                "평가할 수 있는 루브릭을 제작하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        }
      ]
    },
    "과목 공통": {
      "character-goal": [
        {
          "title": "성격",
          "lines": [
            {
              "id": "AI-CG-CHAR-01",
              "text": "‘인공지능 기초’는 학문의 분야 중 컴퓨터과학, 데이터 과학, 정보시스템의 내용을 기반으로, 개인의 삶과 다양한 분야에서 직접적인 영향을 미치고 있는 인공지능에 대한 깊은 이해를 제공하게 된다.",
              "easy": [
                "컴퓨터과학",
                "데이터 과학",
                "정보시스템",
                "인공지능에 대한 깊은 이해"
              ],
              "normal": [
                "컴퓨터과학",
                "데이터 과학",
                "정보시스템",
                "인공지능에 대한 깊은 이해"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1cbxrxe",
                  "g-vmd4ro",
                  "g-6e3zcm",
                  "g-bvpf9t"
                ],
                "normal": [
                  "g-1cbxrxe",
                  "g-vmd4ro",
                  "g-6e3zcm",
                  "g-bvpf9t"
                ]
              }
            },
            {
              "id": "AI-CG-CHAR-02",
              "text": "미래 사회의 변화와 불확실성 등으로 인한 진로와 직업의 변화에 능동적으로 대처하며, 인공지능의 주체적 사용자인 학습자가 인공지능을 인간 중심으로 안전하고 책임 있게 사용하는 자기주도성을 갖춘 디지털 민주시민으로 성장하게 한다.",
              "easy": [
                "주체적 사용자",
                "인간 중심",
                "안전하고 책임 있게",
                "디지털 민주시민"
              ],
              "normal": [
                "주체적 사용자",
                "인간 중심",
                "안전하고 책임 있게",
                "디지털 민주시민",
                "자기주도성"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-mne51u",
                  "g-13rc9z9",
                  "g-67nnav",
                  "g-1a2ahdc"
                ],
                "normal": [
                  "g-mne51u",
                  "g-13rc9z9",
                  "g-67nnav",
                  "g-1a2ahdc",
                  "g-109krcn"
                ]
              }
            },
            {
              "id": "AI-CG-CHAR-03",
              "text": "프로젝트 기반의 프로그래밍을 통한 직접 구현, 모델에 대한 평가 등 인공지능에 대한 깊이 있는 학습을 기반으로 대학의 전공과 연계된 기초경험을 제공하도록 한다.",
              "easy": [
                "프로젝트 기반의 프로그래밍",
                "직접 구현",
                "모델에 대한 평가",
                "기초경험"
              ],
              "normal": [
                "프로젝트 기반의 프로그래밍",
                "직접 구현",
                "모델에 대한 평가",
                "기초경험"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1wdqqxb",
                  "g-14fmaj1",
                  "g-hvp68y",
                  "g-sv2zeo"
                ],
                "normal": [
                  "g-1wdqqxb",
                  "g-14fmaj1",
                  "g-hvp68y",
                  "g-sv2zeo"
                ]
              }
            }
          ]
        },
        {
          "title": "목표",
          "lines": [
            {
              "id": "AI-CG-GOAL-00",
              "text": "‘인공지능 기초’는 인공지능의 발전에 따른 사회의 변화를 파악하고, 인공지능의 원리에 대한 이해를 바탕으로 인공지능을 다양한 분야의 문제를 창의적으로 해결하기 위한 핵심 도구로서 프로그래밍할 수 있으며, 인공지능의 윤리적 쟁점에 관한 올바른 가치관과 태도를 함양하는 데 중점을 둔다.",
              "easy": [
                "사회의 변화",
                "인공지능의 원리",
                "핵심 도구로서 프로그래밍",
                "윤리적 쟁점"
              ],
              "normal": [
                "사회의 변화",
                "인공지능의 원리",
                "핵심 도구로서 프로그래밍",
                "윤리적 쟁점",
                "올바른 가치관과 태도"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-laxuct",
                  "g-gib811",
                  "g-1fmvso7",
                  "g-12u7wx5"
                ],
                "normal": [
                  "g-laxuct",
                  "g-gib811",
                  "g-1fmvso7",
                  "g-12u7wx5",
                  "g-102yh8v"
                ]
              }
            },
            {
              "id": "AI-CG-GOAL-01",
              "text": "(1) 인공지능에 대한 이해를 바탕으로 실생활의 문제를 인공지능의 관점에서 파악하고, 지능적 판단을 구현하기 위해 탐색과 추론 방식을 적용하는 능력과 태도를 기른다.",
              "easy": [
                "인공지능의 관점",
                "탐색과 추론"
              ],
              "normal": [
                "인공지능의 관점",
                "탐색과 추론",
                "지능적 판단"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-xhrbqw",
                  "g-o9q41f"
                ],
                "normal": [
                  "g-xhrbqw",
                  "g-o9q41f",
                  "g-d3uv46"
                ]
              }
            },
            {
              "id": "AI-CG-GOAL-02",
              "text": "(2) 기계학습을 활용하여 해결할 수 있는 문제를 정의하고, 문제 해결 과정에서 필요한 데이터와 모델을 활용하여 문제를 효과적으로 해결하는 능력과 태도를 기른다.",
              "easy": [
                "기계학습",
                "문제를 정의",
                "데이터와 모델"
              ],
              "normal": [
                "기계학습",
                "문제를 정의",
                "데이터와 모델",
                "효과적으로 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-4tuo8l",
                  "g-13wcdli",
                  "g-vbrb99"
                ],
                "normal": [
                  "g-4tuo8l",
                  "g-13wcdli",
                  "g-vbrb99",
                  "g-1r8sxoa"
                ]
              }
            },
            {
              "id": "AI-CG-GOAL-03",
              "text": "(3) 인공지능의 발전에 따른 인간의 삶과 진로의 변화를 탐색하고, 인공지능의 다양한 측면에 대한 비판적인 자세를 바탕으로 인공지능과 관련된 윤리적 문제에 대해 올바른 가치관을 형성할 수 있는 태도를 기른다.",
              "easy": [
                "삶과 진로의 변화",
                "비판적인 자세",
                "윤리적 문제",
                "올바른 가치관"
              ],
              "normal": [
                "삶과 진로의 변화",
                "비판적인 자세",
                "윤리적 문제",
                "올바른 가치관"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-18xhrik",
                  "g-11tmstp",
                  "g-1mmq0en",
                  "g-171qy4m"
                ],
                "normal": [
                  "g-18xhrik",
                  "g-11tmstp",
                  "g-1mmq0en",
                  "g-171qy4m"
                ]
              }
            },
            {
              "id": "AI-CG-GOAL-04",
              "text": "(4) 인공지능이 다양한 분야와 융합하여 새로운 가치를 창출할 수 있다는 점을 인식하고, 인류가 직면해 있는 문제를 인공지능을 활용하여 해결할 수 있는 능력과 태도를 기른다.",
              "easy": [
                "다양한 분야와 융합",
                "새로운 가치를 창출",
                "인류가 직면해 있는 문제"
              ],
              "normal": [
                "다양한 분야와 융합",
                "새로운 가치를 창출",
                "인류가 직면해 있는 문제"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-dfmwmk",
                  "g-5dgvtk",
                  "g-xpu6do"
                ],
                "normal": [
                  "g-dfmwmk",
                  "g-5dgvtk",
                  "g-xpu6do"
                ]
              }
            }
          ]
        }
      ],
      "teaching-evaluation": [
        {
          "title": "교수·학습의 방향",
          "lines": [
            {
              "id": "AI-TE-DIR-01",
              "text": "(라) ‘인공지능 기초’ 과목의 교수·학습은 인공지능의 원리에 대한 이해를 바탕으로 문제를 효율적으로 해결하는 역량을 향상하는 데 중점을 둔다. ‘인공지능 기초’ 과목 내의 내용 영역, 다른 교과 및 비교과 활동과의 융합을 통해 학생의 인공지능 소양이 다양한 분야에 전이될 수 있도록 한다.",
              "easy": [
                "인공지능의 원리에 대한 이해",
                "효율적으로 해결",
                "인공지능 소양",
                "다양한 분야에 전이"
              ],
              "normal": [
                "인공지능의 원리에 대한 이해",
                "효율적으로 해결",
                "인공지능 소양",
                "다양한 분야에 전이"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1uethb5",
                  "g-16kmvem",
                  "g-ya6xd6",
                  "g-q9ahko"
                ],
                "normal": [
                  "g-1uethb5",
                  "g-16kmvem",
                  "g-ya6xd6",
                  "g-q9ahko"
                ]
              }
            }
          ]
        },
        {
          "title": "교수·학습 방법",
          "lines": [
            {
              "id": "AI-TE-MET-01",
              "text": "(가) 교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, 디자인기반학습, 짝 프로그래밍, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
              "easy": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습"
              ],
              "normal": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-19d2otk",
                  "g-k6ok17",
                  "g-13x9dhw",
                  "g-1nrkow6",
                  "g-1t2nzug"
                ],
                "normal": [
                  "g-19d2otk",
                  "g-k6ok17",
                  "g-13x9dhw",
                  "g-1nrkow6",
                  "g-1t2nzug"
                ]
              }
            },
            {
              "id": "AI-TE-MET-02",
              "text": "(다) 학습자의 디지털·인공지능 소양에 대해 선제적으로 파악하고 학생의 현재 수준에 맞는 방식으로 교수·학습 활동을 구성한다. 프로그래밍을 통한 인공지능 프로그램의 개발 활동을 중심으로 하되, 인공지능 개념 이해에 도움이 되는 소프트웨어나 인공지능 관련 라이브러리를 적극적으로 활용하여 최소 성취수준을 보장하도록 한다.",
              "easy": [
                "디지털·인공지능 소양",
                "선제적으로 파악",
                "인공지능 프로그램의 개발 활동",
                "인공지능 관련 라이브러리",
                "최소 성취수준"
              ],
              "normal": [
                "디지털·인공지능 소양",
                "선제적으로 파악",
                "인공지능 프로그램의 개발 활동",
                "인공지능 관련 라이브러리",
                "최소 성취수준"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-nwtggv",
                  "g-70l1kf",
                  "g-l0cgp6",
                  "g-1xvdkjz",
                  "g-bn3kui"
                ],
                "normal": [
                  "g-nwtggv",
                  "g-70l1kf",
                  "g-l0cgp6",
                  "g-1xvdkjz",
                  "g-bn3kui"
                ]
              }
            }
          ]
        },
        {
          "title": "평가의 방향",
          "lines": [
            {
              "id": "AI-TE-EVD-01",
              "text": "(다) 구체적인 평가 루브릭을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
              "easy": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "normal": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-fb7v0z",
                  "g-1ofztiq",
                  "g-9d2m2a"
                ],
                "normal": [
                  "g-fb7v0z",
                  "g-1ofztiq",
                  "g-9d2m2a"
                ]
              }
            },
            {
              "id": "AI-TE-EVD-02",
              "text": "(라) 인공지능 프로그램 구현에 프로그래밍 활동이 포함되나 프로그래밍 내용보다는 인공지능의 구현과 활용, 인공지능 활용에 대한 인식에 초점을 맞추어 평가한다.",
              "easy": [
                "프로그래밍 내용보다는",
                "인공지능의 구현과 활용",
                "인공지능 활용에 대한 인식"
              ],
              "normal": [
                "프로그래밍 내용보다는",
                "인공지능의 구현과 활용",
                "인공지능 활용에 대한 인식"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1vj20wk",
                  "g-ee75o5",
                  "g-13hyln0"
                ],
                "normal": [
                  "g-1vj20wk",
                  "g-ee75o5",
                  "g-13hyln0"
                ]
              }
            }
          ]
        },
        {
          "title": "평가 방법",
          "lines": [
            {
              "id": "AI-TE-EVM-01",
              "text": "(가) 성취기준을 분석하고 재구성하여 지필평가 및 수행평가, 관찰 평가, 서·논술형 평가 등을 활용하는 종합적인 평가 포트폴리오를 계획하고, 교사 평가, 자기 평가, 동료 평가 등과 같은 다면적 평가를 실행하여 학생 성장에 기여할 수 있는 결과를 제공한다.",
              "easy": [
                "지필평가 및 수행평가",
                "관찰 평가",
                "서·논술형 평가",
                "평가 포트폴리오",
                "교사 평가",
                "자기 평가",
                "동료 평가"
              ],
              "normal": [
                "지필평가 및 수행평가",
                "관찰 평가",
                "서·논술형 평가",
                "평가 포트폴리오",
                "교사 평가",
                "자기 평가",
                "동료 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-5oozsg",
                  "g-1u9vcsj",
                  "g-i3bchn",
                  "g-1rh7djz",
                  "g-15q1la7",
                  "g-14ibsz7",
                  "g-1gr4e4w"
                ],
                "normal": [
                  "g-5oozsg",
                  "g-1u9vcsj",
                  "g-i3bchn",
                  "g-1rh7djz",
                  "g-15q1la7",
                  "g-14ibsz7",
                  "g-1gr4e4w"
                ]
              }
            },
            {
              "id": "AI-TE-EVM-02",
              "text": "(다) 인공지능에 관련된 평가는 다양한 방식으로 나타날 수 있으므로 정량적 평가와 정성적 평가 내용을 명확하게 구분한다. 특히 모델 학습과 적용이 반복적으로 이루어지는 프로젝트의 경우 평가 결과가 학생 활동에 즉시 피드백되어 결과물의 개선으로 나타날 수 있도록 평가를 계획한다.",
              "easy": [
                "정량적 평가",
                "정성적 평가",
                "즉시 피드백",
                "결과물의 개선"
              ],
              "normal": [
                "정량적 평가",
                "정성적 평가",
                "즉시 피드백",
                "결과물의 개선",
                "모델 학습과 적용이 반복적"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1cpe08r",
                  "g-1i32yoz",
                  "g-11yjtw3",
                  "g-ffofm3"
                ],
                "normal": [
                  "g-1cpe08r",
                  "g-1i32yoz",
                  "g-11yjtw3",
                  "g-ffofm3",
                  "g-lsx1bn"
                ]
              }
            }
          ]
        }
      ]
    }
  },
  "data-science": {
    "데이터 과학의 이해": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "디지털 사회의 시민에게는 데이터에 기반한 합리적인 의사 결정이 필요하다.",
              "easy": [
                "디지털 사회",
                "데이터에 기반한",
                "합리적인 의사 결정"
              ],
              "normal": [
                "디지털 사회",
                "시민",
                "데이터에 기반한",
                "데이터",
                "합리적인 의사 결정",
                "필요"
              ],
              "id": "DS-01-CS-KI-01",
              "legacyId": "19een0-4mj4z2",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "c66-39c394b0",
                  "g02"
                ],
                "normal": [
                  "g03",
                  "g04",
                  "n66-39c394b0",
                  "g01",
                  "g02",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "데이터 과학에 대한 이해는 데이터를 활용하여 복잡한 문제를 해결하는 데 도움을 준다.",
              "easy": [
                "데이터 과학"
              ],
              "normal": [
                "데이터 과학",
                "데이터",
                "이해",
                "활용",
                "복잡한 문제",
                "해결"
              ],
              "id": "DS-01-CS-KI-02",
              "legacyId": "19een0-rilu2b",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g06",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "데이터 과학의 개념",
              "easy": [
                "데이터 과학",
                "개념"
              ],
              "normal": [
                "데이터 과학",
                "개념"
              ],
              "id": "DS-01-CS-KN-01",
              "legacyId": "1gji2b-4xdv0m",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터의 형태와 속성",
              "easy": [
                "데이터",
                "형태",
                "속성"
              ],
              "normal": [
                "데이터",
                "형태",
                "속성"
              ],
              "id": "DS-01-CS-KN-02",
              "legacyId": "1gji2b-1rn19e4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터셋과 데이터베이스",
              "easy": [
                "데이터셋",
                "데이터베이스"
              ],
              "normal": [
                "데이터셋",
                "데이터베이스"
              ],
              "id": "DS-01-CS-KN-03",
              "legacyId": "1gji2b-1et7g28",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "데이터 과학의 문제 해결 사례 탐색하기",
              "easy": [
                "데이터 과학",
                "문제 해결 사례"
              ],
              "normal": [
                "데이터 과학",
                "문제 해결 사례",
                "탐색"
              ],
              "id": "DS-01-CS-PF-01",
              "legacyId": "1eyoxrk-1rawojh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g05"
                ]
              }
            },
            {
              "text": "데이터의 형태와 속성 파악하기",
              "easy": [
                "데이터",
                "속성"
              ],
              "normal": [
                "데이터",
                "형태",
                "속성",
                "파악"
              ],
              "id": "DS-01-CS-PF-02",
              "legacyId": "1eyoxrk-pskcyv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 통합의 의미 파악하기",
              "easy": [
                "데이터 통합",
                "의미"
              ],
              "normal": [
                "데이터 통합",
                "의미",
                "파악"
              ],
              "id": "DS-01-CS-PF-03",
              "legacyId": "1eyoxrk-1j8k98q",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "데이터 기반 의사 결정의 중요성 인식",
              "easy": [
                "데이터 기반 의사 결정",
                "중요성"
              ],
              "normal": [
                "데이터 기반 의사 결정",
                "중요성",
                "인식"
              ],
              "id": "DS-01-CS-VA-01",
              "legacyId": "j8myzy-1hxesi9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g04",
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "데이터의 잠재적 가치 내면화",
              "easy": [
                "데이터",
                "잠재적 가치"
              ],
              "normal": [
                "데이터",
                "잠재적 가치",
                "내면화"
              ],
              "id": "DS-01-CS-VA-02",
              "legacyId": "j8myzy-iqgnc2",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 과학을 통한 진로 설계 참여",
              "easy": [
                "데이터 과학",
                "진로 설계"
              ],
              "normal": [
                "데이터 과학",
                "진로 설계",
                "참여"
              ],
              "id": "DS-01-CS-VA-03",
              "legacyId": "j8myzy-hasbnd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12데과01-01] 데이터 과학의 개념을 이해하고 문제 해결 사례를 데이터 기반 의사 결정 상황에 적용한다.",
              "easy": [
                "데이터 과학",
                "문제 해결 사례",
                "데이터 기반 의사 결정"
              ],
              "normal": [
                "데이터 과학",
                "개념",
                "문제 해결 사례",
                "데이터 기반 의사 결정",
                "상황",
                "적용"
              ],
              "aliases": {},
              "id": "DS-01-AC-ST-01",
              "legacyId": "1rmtuks-1flpcz5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ],
                "g03": [
                  "g09",
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "[12데과01-02] 정형 데이터와 비정형 데이터를 구분하고 데이터 속성에서 데이터의 잠재적 가치를 파악한다.",
              "easy": [
                "정형 데이터",
                "비정형 데이터",
                "데이터 속성",
                "잠재적 가치"
              ],
              "normal": [
                "정형 데이터",
                "비정형 데이터",
                "구분",
                "데이터 속성",
                "잠재적 가치",
                "파악"
              ],
              "aliases": {},
              "id": "DS-01-AC-ST-02",
              "legacyId": "1rmtuks-hak6co",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12데과01-03] 데이터셋의 집합인 데이터베이스를 이해하고 서로 다른 데이터셋의 데이터를 분석이 가능한 형태로 통합하는 것의 의미를 파악한다.",
              "easy": [
                "데이터셋",
                "데이터베이스",
                "분석이 가능한 형태",
                "통합"
              ],
              "normal": [
                "데이터셋",
                "데이터",
                "집합",
                "데이터베이스",
                "서로 다른 데이터셋",
                "분석이 가능한 형태",
                "통합",
                "의미",
                "파악"
              ],
              "aliases": {},
              "id": "DS-01-AC-ST-03",
              "legacyId": "1rmtuks-ac55e6",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g03",
                  "g06",
                  "g02",
                  "g07",
                  "g04",
                  "g05",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g10",
                  "g11",
                  "g12"
                ]
              }
            },
            {
              "text": "[12데과01-04] 데이터로 인한 사회 변화를 인식하고 진로 및 직업과 관련한 데이터 기반 문제 해결 사례를 분석한다.",
              "easy": [
                "사회 변화",
                "진로",
                "직업",
                "문제 해결 사례"
              ],
              "normal": [
                "데이터",
                "사회 변화",
                "인식",
                "진로",
                "직업",
                "데이터 기반",
                "문제 해결 사례",
                "분석"
              ],
              "aliases": {},
              "id": "DS-01-AC-ST-04",
              "legacyId": "1rmtuks-1lyz3o9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g12"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "g11",
                  "g12",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g01",
                  "g08",
                  "g09",
                  "g10"
                ]
              },
              "normalSplitMigrations": {
                "g05": [
                  "g11",
                  "g12"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12데과01-02] 데이터의 형태를 바탕으로 정형 데이터와 비정형 데이터를 구분하고 정형 데이터에서 데이터 속성별 의미와 속성 간 관계를 파악하여 수집된 데이터가 분석 대상으로서 가치가 있는지 판단할 수 있어야 한다.",
              "easy": [
                "정형 데이터",
                "비정형 데이터",
                "데이터 속성",
                "속성 간 관계",
                "대상"
              ],
              "normal": [
                "데이터",
                "형태",
                "정형 데이터",
                "비정형 데이터",
                "구분",
                "데이터 속성",
                "의미",
                "속성 간 관계",
                "수집된 데이터",
                "분석 대상",
                "가치",
                "판단"
              ],
              "aliases": {},
              "id": "DS-01-AC-EX-01",
              "legacyId": "1ykpcgs-1jevirs",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g16"
                ],
                "normal": [
                  "g07",
                  "g08",
                  "g01",
                  "g02",
                  "g09",
                  "g03",
                  "g10",
                  "g04",
                  "g11",
                  "g05",
                  "g06",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g13",
                  "g14"
                ],
                "g05": [
                  "g15",
                  "g16"
                ]
              },
              "yaho": [
                "정형 데이터와 비정형 데이터를 구분하고",
                "정형 데이터에서 데이터 속성별 의미와 속성 간 관계를 파악하여",
                "수집된 데이터가 분석 대상으로서 가치가 있는지 판단할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "[12데과01-03] 서로 다른 데이터셋 간 공통된 속성을 기준으로 데이터를 통합할 수 있음을 이해하고 데이터셋 간의 관계를 바탕으로 데이터베이스의 개념을 설명할 수 있어야 한다. 대규모의 데이터를 여러 사람이 공유하기 위해서는 체계적인 시스템이 필요하다는 점을 바탕으로 데이터베이스의 필요성을 설명할 수 있어야 한다.",
              "easy": [
                "데이터셋",
                "공통된",
                "속성",
                "통합",
                "데이터베이스",
                "체계적인"
              ],
              "normal": [
                "서로 다른 데이터셋",
                "데이터셋",
                "데이터",
                "공통된 속성",
                "통합",
                "관계",
                "데이터베이스",
                "개념",
                "대규모의 데이터",
                "여러 사람",
                "공유",
                "체계적인 시스템",
                "필요성"
              ],
              "aliases": {},
              "id": "DS-01-AC-EX-02",
              "legacyId": "1ykpcgs-1xxo7fw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g14",
                  "g15",
                  "g03",
                  "g04",
                  "g17"
                ],
                "normal": [
                  "g08",
                  "g01",
                  "g09",
                  "g02",
                  "g03",
                  "g10",
                  "g04",
                  "g11",
                  "g05",
                  "g12",
                  "g06",
                  "g07",
                  "g13"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g14",
                  "g15"
                ],
                "g05": [
                  "g16",
                  "g09"
                ],
                "g07": [
                  "g17",
                  "g18"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "실제 활용 분야와 사례를 중심으로 데이터 과학이 어떻게 발전되어 왔는지 이해할 수 있도록 하며 지속가능한 발전을 통한 미래 사회를 만들기 위한 데이터의 역할 및 중요성을 파악할 수 있도록 교수·학습을 구성한다.",
              "easy": [
                "데이터 과학",
                "지속가능한 발전",
                "미래 사회",
                "역할",
                "중요성"
              ],
              "normal": [
                "활용 분야",
                "사례",
                "중심으로",
                "데이터 과학",
                "데이터",
                "발전",
                "지속가능한 발전",
                "미래 사회",
                "역할",
                "중요성"
              ],
              "aliases": {},
              "id": "DS-01-AC-CO-01",
              "legacyId": "1dahci5-1l2q2nj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g07",
                  "g08",
                  "n66-81108ac7",
                  "g01",
                  "g04",
                  "g09",
                  "g02",
                  "g03",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "데이터 과학이 어떻게 발전되어 왔는지 이해할 수 있도록 하며",
                "지속가능한 발전을 통한 미래 사회를 만들기 위한 데이터의 역할 및 중요성을",
                "파악할 수 있도록 교수·학습을 구성한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "우리 사회의 다양한 분야에서 사용될 수 있는 데이터의 잠재적 가치를 이해하고 데이터와 데이터 분석이 활용된 문제 해결의 사례를 탐색할 수 있도록 교수·학습을 구성한다.",
              "easy": [
                "잠재적 가치",
                "데이터 분석",
                "문제 해결"
              ],
              "normal": [
                "사회",
                "분야",
                "데이터",
                "잠재적 가치",
                "데이터 분석",
                "활용",
                "문제 해결",
                "사례",
                "탐색"
              ],
              "aliases": {},
              "id": "DS-01-AC-CO-02",
              "legacyId": "1dahci5-1w91rou",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g06",
                  "g07",
                  "g01",
                  "g02",
                  "g03",
                  "g08",
                  "g04",
                  "g05",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "yaho": [
                "우리 사회의 다양한 분야에서 사용될 수 있는 데이터의 잠재적 가치를 이해하고",
                "데이터와 데이터 분석이 활용된 문제 해결의 사례를 탐색할 수 있도록 교수·학습을 구성한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "데이터 과학에 기반한 여러 가지 문제 해결 사례를 탐색하기 어려워하는 학습자의 경우, 교수자가 제시한 사례에서 사용된 데이터가 무엇인지, 문제 해결에 어떠한 역할을 하였는지를 기반으로 데이터의 잠재적 가치를 설명할 수 있는지를 평가하도록 한다.",
              "easy": [
                "데이터 과학",
                "문제 해결 사례",
                "역할",
                "잠재적 가치"
              ],
              "normal": [
                "데이터 과학",
                "데이터",
                "문제 해결 사례",
                "문제 해결",
                "사례",
                "탐색",
                "학습자",
                "제시",
                "역할",
                "잠재적 가치",
                "설명",
                "평가"
              ],
              "aliases": {},
              "id": "DS-01-AC-CO-03",
              "legacyId": "1dahci5-dpmy4n",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g03",
                  "g02",
                  "g08",
                  "g11",
                  "g06",
                  "g07",
                  "n66-7cae51b7",
                  "g04",
                  "g05",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g08",
                  "g11"
                ]
              },
              "yaho": [
                "가지 문제 해결 사례를 탐색하기 어려워하는 학습자의 경우",
                "교수자가 제시한 사례에서 사용된 데이터가 무엇인지",
                "문제 해결에 어떠한 역할을 하였는지를 기반으로 데이터의 잠재적 가치를 설명할",
                "수 있는지를 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ]
              }
            }
          ]
        }
      ]
    },
    "데이터 준비와 분석": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "데이터 분석을 위해서는 데이터를 수집·전처리하는 과정이 필요하다.",
              "easy": [
                "데이터 분석",
                "수집",
                "전처리"
              ],
              "normal": [
                "데이터 분석",
                "데이터",
                "수집·전처리",
                "과정"
              ],
              "id": "DS-02-CS-KI-01",
              "legacyId": "19een0-1rmk5k1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 처리는 데이터를 분석에 효과적인 형태로 변환하며 지식을 추출하는 데 도움을 준다.",
              "easy": [
                "분석에 효과적인 형태",
                "변환",
                "지식",
                "추출"
              ],
              "normal": [
                "데이터 처리",
                "데이터",
                "분석에 효과적인 형태",
                "분석",
                "효과적인 형태",
                "변환",
                "지식",
                "추출"
              ],
              "id": "DS-02-CS-KI-02",
              "legacyId": "19een0-l2ua1j",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "c66-613855c6",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-613855c6",
                  "g03",
                  "g07",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "데이터 전처리",
              "easy": [
                "데이터 전처리"
              ],
              "normal": [
                "데이터 전처리"
              ],
              "id": "DS-02-CS-KN-01",
              "legacyId": "1gji2b-1n50o8j",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 분석 방법",
              "easy": [
                "데이터 분석",
                "방법"
              ],
              "normal": [
                "데이터 분석 방법"
              ],
              "id": "DS-02-CS-KN-02",
              "legacyId": "1gji2b-kznh5w",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "데이터 시각화하고 분석하기",
              "easy": [
                "시각화",
                "분석"
              ],
              "normal": [
                "데이터 시각화",
                "데이터",
                "시각화",
                "분석"
              ],
              "id": "DS-02-CS-PF-01",
              "legacyId": "1eyoxrk-171hqtt",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "n66-411b46fb",
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "이상치와 결측치 처리하고 정규화 활용하기",
              "easy": [
                "이상치",
                "정규화"
              ],
              "normal": [
                "이상치",
                "결측치",
                "처리",
                "정규화",
                "활용"
              ],
              "id": "DS-02-CS-PF-02",
              "legacyId": "1eyoxrk-1jwbut",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 속성 간의 관계를 파악하고 통합하여 탐색하기",
              "easy": [
                "데이터 속성",
                "통합"
              ],
              "normal": [
                "데이터 속성",
                "관계",
                "파악",
                "통합",
                "탐색"
              ],
              "id": "DS-02-CS-PF-03",
              "legacyId": "1eyoxrk-u8cwd9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "서로 다른 데이터 분석 방법 비교하기",
              "easy": [
                "데이터 분석",
                "비교"
              ],
              "normal": [
                "데이터 분석 방법",
                "비교"
              ],
              "id": "DS-02-CS-PF-04",
              "legacyId": "1eyoxrk-11oeu6s",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g02"
                ],
                "normal": [
                  "g07",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g04",
                  "g05"
                ]
              },
              "normalSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "데이터가 편향되지 않도록 수집하는 자세",
              "easy": [
                "편향",
                "수집"
              ],
              "normal": [
                "데이터",
                "편향",
                "않도록",
                "수집",
                "자세"
              ],
              "id": "DS-02-CS-VA-01",
              "legacyId": "j8myzy-1fu59xs",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-b3ea00d1",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터의 불확실성과 오류 가능성 인식",
              "easy": [
                "불확실성",
                "오류"
              ],
              "normal": [
                "데이터",
                "불확실성",
                "오류 가능성",
                "인식"
              ],
              "id": "DS-02-CS-VA-02",
              "legacyId": "j8myzy-4svvz0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12데과02-01] 데이터를 편향되지 않도록 수집하고 수집된 데이터의 특성을 분석한다.",
              "easy": [
                "편향",
                "수집",
                "특성"
              ],
              "normal": [
                "데이터",
                "편향",
                "않도록",
                "수집",
                "특성",
                "분석"
              ],
              "aliases": {},
              "id": "DS-02-AC-ST-01",
              "legacyId": "1rmtuks-111atf9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g07",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12데과02-02] 이상치와 결측치 탐색 및 정규화를 통해 전처리하여 오류 가능성을 최소화하고 데이터 분석을 위해 시각화한다.",
              "easy": [
                "이상치",
                "결측치",
                "정규화",
                "전처리"
              ],
              "normal": [
                "이상치",
                "결측치",
                "탐색",
                "정규화",
                "전처리",
                "오류 가능성",
                "최소화",
                "데이터 분석",
                "시각화"
              ],
              "aliases": {},
              "id": "DS-02-AC-ST-02",
              "legacyId": "1rmtuks-edlr2r",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g07",
                  "g03",
                  "g04",
                  "g05",
                  "g08",
                  "g09",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "[12데과02-03] 데이터를 분석하기 위해 데이터 속성 간의 관계를 파악하고 통합한다.",
              "easy": [
                "데이터",
                "속성 간의 관계",
                "통합"
              ],
              "normal": [
                "데이터",
                "분석",
                "속성 간의 관계",
                "파악",
                "통합"
              ],
              "aliases": {},
              "id": "DS-02-AC-ST-03",
              "legacyId": "1rmtuks-1jjlew4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g05",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12데과02-04] 동일한 데이터를 서로 다른 분석 방법을 적용하여 분석 결과를 비교한다.",
              "easy": [
                "분석 방법",
                "분석 결과",
                "비교"
              ],
              "normal": [
                "동일한 데이터",
                "서로 다른 분석 방법",
                "적용",
                "분석 결과",
                "비교"
              ],
              "aliases": {},
              "id": "DS-02-AC-ST-04",
              "legacyId": "1rmtuks-9154zs",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g06",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12데과02-01] 데이터의 선택과 수집된 데이터를 활용하는 과정에서 발생할 수 있는 편향성을 최소화하고 수집된 데이터의 출처, 규모, 데이터 속성별 자료형, 간단한 통계적 특성 등 데이터의 특성을 분석하고 파악할 수 있어야 한다.",
              "easy": [
                "편향성",
                "출처",
                "규모",
                "데이터 속성",
                "자료형"
              ],
              "normal": [
                "데이터",
                "선택",
                "수집",
                "편향성",
                "최소화",
                "출처",
                "규모",
                "데이터 속성",
                "자료형",
                "통계적 특성",
                "특성",
                "분석",
                "파악"
              ],
              "aliases": {},
              "id": "DS-02-AC-EX-01",
              "legacyId": "1ykpcgs-6r14le",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g10",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g08",
                  "g02",
                  "g09",
                  "g03",
                  "g04",
                  "g10",
                  "g05",
                  "g06",
                  "g11",
                  "g12",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "활용하는 과정에서 발생할 수 있는 편향성을 최소화하고 수집된 데이터의 출처",
                "규모, 데이터 속성별 자료형, 간단한 통계적 특성 등 데이터의 특성을 분석하고",
                "파악할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "[12데과02-04] 동일한 데이터에 서로 다른 분석 방법을 적용하는 경우 분석 결과가 달라질 수 있음을 이해하고, 분석 방법과 연관지어 서로 다른 결과가 나온 이유를 분석하고 비교할 수 있어야 한다.",
              "easy": [
                "동일한 데이터",
                "분석 방법",
                "분석 결과",
                "이유",
                "비교"
              ],
              "normal": [
                "동일한 데이터",
                "서로 다른 분석 방법",
                "분석 방법",
                "분석",
                "적용",
                "분석 결과",
                "결과",
                "달라질 수 있음",
                "이유",
                "비교"
              ],
              "aliases": {},
              "id": "DS-02-AC-EX-02",
              "legacyId": "1ykpcgs-zzdeyt",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g08",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g08",
                  "g10",
                  "g06",
                  "g03",
                  "g09",
                  "g07",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g11",
                  "g12"
                ],
                "g02": [
                  "g13",
                  "g08"
                ]
              },
              "yaho": [
                "동일한 데이터에 서로 다른 분석 방법을 적용하는 경우 분석 결과가 달라질 수 있음을 이해하고",
                "분석 방법과 연관지어 서로 다른 결과가 나온 이유를 분석하고 비교할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "데이터를 수집할 때 다양한 경로로 접근할 수 있는 공공 데이터 포털, 출처가 명확한 민간 데이터 포털을 통해 정확하고 신뢰할 수 있는 데이터를 수집하도록 활동을 구성하여 데이터 문해력을 기를 수 있도록 한다.",
              "easy": [
                "공공 데이터",
                "민간 데이터",
                "정확",
                "신뢰",
                "데이터 문해력"
              ],
              "normal": [
                "데이터",
                "수집",
                "공공 데이터 포털",
                "출처",
                "민간 데이터 포털",
                "정확",
                "신뢰",
                "데이터 문해력"
              ],
              "aliases": {},
              "id": "DS-02-AC-CO-01",
              "legacyId": "1dahci5-8nzf2i",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g09",
                  "g11",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g07",
                  "g08",
                  "g01",
                  "g06",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g09",
                  "g10"
                ],
                "g02": [
                  "g11",
                  "g10"
                ]
              },
              "yaho": [
                "경로로 접근할 수 있는 공공 데이터 포털, 출처가 명확한 민간 데이터 포털을 통해 정확하고",
                "신뢰할 수 있는 데이터를 수집하도록 활동을 구성하여 데이터 문해력을 기를 수 있도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "일상 속 데이터를 수집, 전처리, 분석하는 모든 과정에서 데이터 편향, 오류 가능성을 최소화하기 위한 방법을 탐색하고 관련 내용을 검증하는 과정을 교수·학습에 포함하도록 한다.",
              "easy": [
                "수집",
                "전처리",
                "분석",
                "편향",
                "오류"
              ],
              "normal": [
                "데이터",
                "수집",
                "전처리",
                "분석",
                "모든 과정",
                "편향",
                "오류 가능성",
                "최소화",
                "방법",
                "탐색",
                "검증"
              ],
              "aliases": {},
              "id": "DS-02-AC-CO-02",
              "legacyId": "1dahci5-jrge23",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g12"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g05",
                  "g06",
                  "g09",
                  "g10",
                  "g11",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g06": [
                  "g12",
                  "g13"
                ]
              },
              "yaho": [
                "일상 속 데이터를 수집, 전처리, 분석하는 모든 과정에서 데이터 편향",
                "오류 가능성을 최소화하기 위한 방법을 탐색하고",
                "관련 내용을 검증하는 과정을 교수·학습에 포함하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "데이터 전처리에 어려움을 겪는 학습자의 경우 전처리가 비교적 간단한 데이터를 제시하여 이상치와 결측치를 탐색하고 데이터 특성에 적합한 분석 방법을 제시할 수 있는지 평가하도록 한다.",
              "easy": [
                "데이터 전처리",
                "이상치",
                "결측치",
                "데이터 특성",
                "분석 방법"
              ],
              "normal": [
                "데이터 전처리",
                "데이터",
                "전처리",
                "학습자",
                "이상치",
                "결측치",
                "탐색",
                "데이터 특성",
                "분석 방법",
                "평가"
              ],
              "aliases": {},
              "id": "DS-02-AC-CO-03",
              "legacyId": "1dahci5-95axf7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g08",
                  "g07",
                  "g06",
                  "g02",
                  "g03",
                  "g09",
                  "g04",
                  "g05",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g08",
                  "g11"
                ]
              },
              "yaho": [
                "데이터 전처리에 어려움을 겪는 학습자의 경우 전처리가 비교적 간단한 데이터를 제시하여",
                "이상치와 결측치를 탐색하고 데이터 특성에 적합한 분석 방법을 제시할 수 있는지 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            }
          ]
        }
      ]
    },
    "데이터 모델링과 평가": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "데이터 모델은 문제를 합리적으로 해결할 수 있도록 도움을 준다.",
              "easy": [
                "데이터 모델",
                "합리적으로 해결"
              ],
              "normal": [
                "데이터 모델",
                "문제",
                "합리적으로 해결",
                "도움"
              ],
              "id": "DS-03-CS-KI-01",
              "legacyId": "19een0-1j7nkke",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "데이터 기반의 합리적 의사 결정을 위해 데이터를 분석해서 새로운 지식을 추출하고 의미를 해석한다.",
              "easy": [
                "의사 결정",
                "지식",
                "해석"
              ],
              "normal": [
                "데이터 기반",
                "데이터",
                "합리적 의사 결정",
                "분석",
                "새로운 지식",
                "추출",
                "의미",
                "해석"
              ],
              "id": "DS-03-CS-KI-02",
              "legacyId": "19een0-16osql1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g10",
                  "g12",
                  "g06"
                ],
                "normal": [
                  "g07",
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g09",
                  "g10"
                ],
                "g04": [
                  "g11",
                  "g12"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "데이터 모델의 개념",
              "easy": [
                "데이터 모델",
                "개념"
              ],
              "normal": [
                "데이터 모델",
                "개념"
              ],
              "id": "DS-03-CS-KN-01",
              "legacyId": "1gji2b-1kgd711",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "회귀 분석",
              "easy": [
                "회귀",
                "분석"
              ],
              "normal": [
                "회귀 분석"
              ],
              "id": "DS-03-CS-KN-02",
              "legacyId": "1gji2b-1y17mvc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              }
            },
            {
              "text": "군집 분석",
              "easy": [
                "군집 분석"
              ],
              "normal": [
                "군집 분석"
              ],
              "id": "DS-03-CS-KN-03",
              "legacyId": "1gji2b-19ctpeh",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "연관 분석",
              "easy": [
                "연관 분석"
              ],
              "normal": [
                "연관 분석"
              ],
              "id": "DS-03-CS-KN-04",
              "legacyId": "1gji2b-1xqapcc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "분석을 위한 도구 탐색하기",
              "easy": [
                "분석",
                "도구"
              ],
              "normal": [
                "분석",
                "도구",
                "탐색"
              ],
              "id": "DS-03-CS-PF-01",
              "legacyId": "1eyoxrk-1ftc6bt",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "분석 결과 평가하기",
              "easy": [
                "분석 결과",
                "평가"
              ],
              "normal": [
                "분석 결과",
                "평가"
              ],
              "id": "DS-03-CS-PF-02",
              "legacyId": "1eyoxrk-aadrgn",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "분석 결과에 대한 의미 해석하기",
              "easy": [
                "분석 결과",
                "해석"
              ],
              "normal": [
                "분석 결과",
                "의미 해석하기",
                "의미",
                "해석"
              ],
              "id": "DS-03-CS-PF-03",
              "legacyId": "1eyoxrk-1pcvgrd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "n66-2d44b470",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "데이터에 대한 다양한 해석을 수용하는 태도",
              "easy": [
                "다양한 해석",
                "수용"
              ],
              "normal": [
                "데이터",
                "다양한 해석",
                "수용",
                "태도"
              ],
              "id": "DS-03-CS-VA-01",
              "legacyId": "j8myzy-1quu3ni",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "적절한 분석 방법을 선택하여 적용하는 자세",
              "easy": [
                "분석 방법",
                "선택"
              ],
              "normal": [
                "적절한 분석 방법",
                "선택",
                "적용",
                "자세"
              ],
              "id": "DS-03-CS-VA-02",
              "legacyId": "j8myzy-vxeita",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g04",
                  "g02",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12데과03-01] 데이터 모델 개념을 이해하고 데이터 분석에 활용할 수 있는 도구를 탐색한다.",
              "easy": [
                "데이터 모델",
                "개념",
                "데이터 분석",
                "도구"
              ],
              "normal": [
                "데이터 모델",
                "개념",
                "데이터 분석",
                "활용",
                "도구",
                "탐색"
              ],
              "aliases": {},
              "id": "DS-03-AC-ST-01",
              "legacyId": "1rmtuks-r2nde",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12데과03-02] 동일한 데이터를 통계적 회귀모델과 기계학습을 통한 회귀모델로 분석하여 결과 해석 내용을 비교한다.",
              "easy": [
                "동일한 데이터",
                "통계적 회귀모델",
                "기계학습",
                "비교"
              ],
              "normal": [
                "동일한 데이터",
                "통계적 회귀모델",
                "회귀모델",
                "기계학습",
                "분석",
                "결과",
                "해석",
                "비교"
              ],
              "aliases": {},
              "id": "DS-03-AC-ST-02",
              "legacyId": "1rmtuks-2hohrz",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03",
                  "g07",
                  "g05",
                  "g08",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "[12데과03-03] 데이터의 속성에 대한 유사성을 측정하고 분석하여 군집을 형성하고, 군집 분석 결과의 의미를 해석한다.",
              "easy": [
                "속성",
                "유사성",
                "군집 분석",
                "의미"
              ],
              "normal": [
                "데이터",
                "속성",
                "유사성",
                "측정",
                "분석",
                "군집",
                "형성",
                "군집 분석 결과",
                "의미",
                "해석"
              ],
              "aliases": {},
              "id": "DS-03-AC-ST-03",
              "legacyId": "1rmtuks-17eij4b",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g11",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g07",
                  "g08",
                  "g04",
                  "g09",
                  "g05",
                  "g06",
                  "g10"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g11",
                  "g12"
                ]
              }
            },
            {
              "text": "[12데과03-04] 데이터 간의 관계를 분석하고 상호 연관성을 파악하여 결과의 의미를 해석한다.",
              "easy": [
                "관계",
                "상호",
                "연관성",
                "의미"
              ],
              "normal": [
                "데이터",
                "관계",
                "분석",
                "상호 연관성",
                "파악",
                "결과",
                "의미",
                "해석"
              ],
              "aliases": {},
              "id": "DS-03-AC-ST-04",
              "legacyId": "1rmtuks-12igui5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g09",
                  "g10",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g07",
                  "g04",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "[12데과03-05] 데이터 분석 방법에 따른 데이터 모델의 분석 결과를 비교하고 평가한다.",
              "easy": [
                "데이터 분석",
                "데이터 모델",
                "분석 결과"
              ],
              "normal": [
                "데이터 분석 방법",
                "데이터 모델",
                "분석 결과",
                "비교",
                "평가"
              ],
              "aliases": {},
              "id": "DS-03-AC-ST-05",
              "legacyId": "1rmtuks-wuzi30",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g06",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12데과03-06] 다양한 분석 방법을 비교하고 평가하여 분석 목적에 가장 적합한 분석 방법을 적용한다.",
              "easy": [
                "분석 방법",
                "비교",
                "분석 목적",
                "가장 적합한 분석 방법"
              ],
              "normal": [
                "다양한 분석 방법",
                "비교",
                "평가",
                "분석 목적",
                "가장 적합한 분석 방법",
                "적용"
              ],
              "aliases": {},
              "id": "DS-03-AC-ST-06",
              "legacyId": "1rmtuks-qhdm8m",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g07"
                ],
                "normal": [
                  "g06",
                  "g02",
                  "g03",
                  "g04",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12데과03-03] 데이터의 속성을 바탕으로 유사도가 높은 데이터끼리 묶어 다수의 군집으로 나누고 군집 내 유사성과 군집 간 상이성을 설명할 수 있어야 한다.",
              "easy": [
                "속성",
                "유사도",
                "군집",
                "군집 내 유사성",
                "군집 간 상이성"
              ],
              "normal": [
                "데이터",
                "속성",
                "유사도",
                "군집",
                "군집 내 유사성",
                "군집 간 상이성",
                "설명"
              ],
              "aliases": {},
              "id": "DS-03-AC-EX-01",
              "legacyId": "1ykpcgs-1oteo2h",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g07",
                  "g08",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12데과03-04] 장바구니 분석의 사례를 통해 연관 분석의 원리를 이해하고 데이터 속성 간 지지도, 신뢰도, 향상도를 측정하며 데이터 속성 간 연관 규칙을 찾아낼 수 있어야 한다.",
              "easy": [
                "장바구니",
                "연관 분석",
                "지지도",
                "신뢰도",
                "향상도"
              ],
              "normal": [
                "장바구니 분석",
                "연관 분석",
                "원리",
                "데이터 속성",
                "지지도",
                "신뢰도",
                "향상도",
                "측정",
                "연관 규칙"
              ],
              "aliases": {},
              "id": "DS-03-AC-EX-02",
              "legacyId": "1ykpcgs-5ig3xl",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g10",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g07",
                  "g08",
                  "g03",
                  "g04",
                  "g05",
                  "g09",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g10",
                  "g11"
                ],
                "g06": [
                  "g12",
                  "g13"
                ]
              }
            },
            {
              "text": "[12데과03-05] 데이터 특성과 분석 목적에 적합한 평가 방법(예측률, 정확도 등)을 선정하고 이를 바탕으로 데이터 분석 결과를 해석하고 그 의미를 판단할 수 있어야 한다.",
              "easy": [
                "데이터 특성",
                "목적",
                "평가 방법",
                "예측률",
                "분석 결과"
              ],
              "normal": [
                "데이터 특성",
                "분석 목적",
                "평가 방법",
                "예측률",
                "정확도",
                "선정",
                "데이터 분석 결과",
                "해석",
                "의미",
                "판단"
              ],
              "aliases": {},
              "id": "DS-03-AC-EX-03",
              "legacyId": "1ykpcgs-1fha7xk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g15",
                  "g03",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g08",
                  "g09",
                  "g10",
                  "g07",
                  "g11"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g12",
                  "g13"
                ],
                "g02": [
                  "g14",
                  "g15"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "데이터 모델링 과정에서 다양한 데이터 분석 방법을 비교하여 활용하고 데이터 해석 과정에서 등장하는 여러 견해를 상호 존중하고 비판적 시각으로 바라봄으로써 합리적으로 문제를 해결할 수 있도록 교수·학습을 구성하도록 한다.",
              "easy": [
                "데이터 모델링",
                "데이터 분석",
                "상호 존중",
                "비판적 시각",
                "합리적으로"
              ],
              "normal": [
                "데이터 모델링",
                "데이터 분석 방법",
                "비교",
                "활용",
                "데이터 해석",
                "여러 견해",
                "상호 존중",
                "비판적 시각",
                "합리적으로",
                "문제",
                "해결"
              ],
              "aliases": {},
              "id": "DS-03-AC-CO-01",
              "legacyId": "1dahci5-1o5ys8y",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g12",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g09",
                  "g10",
                  "g03",
                  "g11",
                  "g04",
                  "g05",
                  "g06",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g12",
                  "g13"
                ],
                "g03": [
                  "g14",
                  "g15"
                ]
              },
              "yaho": [
                "데이터 분석 방법을 비교하여 활용하고 데이터 해석 과정에서 등장하는 여러 견해를 상호 존중하고",
                "비판적 시각으로 바라봄으로써 합리적으로 문제를 해결할 수 있도록 교수·학습을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "데이터 분석을 위한 도구는 학습자의 디지털 역량을 사전에 파악하여 학습자의 인지적인 부담이 적은 방향으로 선정하도록 한다. 학습에 사용하는 기기나 운영 체제에 비교적 독립적인 소프트웨어나 프로그래밍 언어를 활용하여 다양한 학습 환경에서 학습자의 접근성을 보장하도록 한다.",
              "easy": [
                "데이터 분석",
                "디지털",
                "역량",
                "운영 체제",
                "소프트웨어",
                "프로그래밍 언어"
              ],
              "normal": [
                "데이터 분석",
                "도구",
                "학습자",
                "디지털 역량",
                "인지적인 부담",
                "기기",
                "운영 체제",
                "소프트웨어",
                "프로그래밍 언어",
                "학습 환경",
                "접근성",
                "보장"
              ],
              "aliases": {},
              "id": "DS-03-AC-CO-02",
              "legacyId": "1dahci5-1w0gpdz",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g13",
                  "g14",
                  "g10",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g08",
                  "g03",
                  "g04",
                  "g09",
                  "g10",
                  "g05",
                  "g06",
                  "g11",
                  "g07",
                  "g12"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g13",
                  "g14"
                ],
                "g04": [
                  "g15",
                  "g16"
                ]
              }
            },
            {
              "text": "최소 성취수준을 보장하기 위하여 교수자가 제시한 데이터 분석 과정을 바탕으로 데이터 모델의 개념을 제시하고 여러 가지 분석 방법을 구별하여 설명할 수 있는지 평가한다. 또한 비교적 명확하게 해석 결과가 도출되는 데이터셋을 제공하여 학습자가 최소한의 데이터 분석 과정을 체험하고 의미를 인식할 수 있는 학습 과정을 제공하도록 한다.",
              "easy": [
                "최소 성취수준",
                "데이터 분석",
                "데이터 모델",
                "분석 방법",
                "데이터셋",
                "의미"
              ],
              "normal": [
                "최소 성취수준",
                "데이터 분석 과정",
                "과정",
                "데이터 모델",
                "개념",
                "분석 방법",
                "구별",
                "평가",
                "명확하게",
                "데이터셋",
                "학습자",
                "체험",
                "의미",
                "인식",
                "학습 과정"
              ],
              "aliases": {},
              "id": "DS-03-AC-CO-03",
              "legacyId": "1dahci5-riytxd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g13",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g14",
                  "g03",
                  "g07",
                  "g04",
                  "g08",
                  "g09",
                  "n66-fa99cbde",
                  "g05",
                  "g10",
                  "g11",
                  "g06",
                  "g12",
                  "n66-df62212c"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g13",
                  "g14"
                ]
              },
              "yaho": [
                "최소 성취수준을 보장하기 위하여",
                "교수자가 제시한 데이터 분석 과정을 바탕으로 데이터 모델의 개념을 제시하고",
                "여러 가지 분석 방법을 구별하여 설명할 수 있는지 평가한다",
                "또한 비교적 명확하게 해석 결과가 도출되는 데이터셋을 제공하여",
                "학습자가 최소한의 데이터 분석 과정을 체험하고 의미를 인식할 수 있는 학습 과정을 제공하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05"
                ]
              }
            }
          ]
        }
      ]
    },
    "데이터 과학 프로젝트": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "데이터 기반 문제 해결을 위해 데이터 과학의 기본 개념과 원리를 바탕으로 탐구 과정을 수행한다.",
              "easy": [
                "데이터 과학",
                "기본 개념",
                "탐구 과정"
              ],
              "normal": [
                "데이터 기반 문제 해결",
                "데이터 과학",
                "기본 개념",
                "원리",
                "탐구 과정",
                "수행"
              ],
              "id": "DS-04-CS-KI-01",
              "legacyId": "19een0-tcviln",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "데이터 과학으로 문제를 해결할 때 통계적 방법이나 기계학습 등 다양한 방법을 활용한다.",
              "easy": [
                "데이터 과학",
                "통계적 방법",
                "기계학습"
              ],
              "normal": [
                "데이터 과학",
                "문제",
                "해결",
                "통계적 방법",
                "기계학습",
                "다양한 방법",
                "활용"
              ],
              "id": "DS-04-CS-KI-02",
              "legacyId": "19een0-1fj3mql",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g06": [
                  "g08",
                  "g09"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "데이터 과학의 주제",
              "easy": [
                "데이터 과학",
                "주제"
              ],
              "normal": [
                "데이터 과학",
                "주제"
              ],
              "id": "DS-04-CS-KN-01",
              "legacyId": "1gji2b-697g0a",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "탐색적 데이터 분석",
              "easy": [
                "탐색적",
                "데이터 분석"
              ],
              "normal": [
                "탐색적 데이터 분석"
              ],
              "id": "DS-04-CS-KN-02",
              "legacyId": "1gji2b-1hx2q64",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              }
            },
            {
              "text": "결과의 의미 해석",
              "easy": [
                "결과",
                "의미 해석"
              ],
              "normal": [
                "결과",
                "의미 해석"
              ],
              "id": "DS-04-CS-KN-03",
              "legacyId": "1gji2b-13h5tyw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "분야별 데이터 과학의 주제 조사하기",
              "easy": [
                "분야별",
                "데이터 과학"
              ],
              "normal": [
                "분야별",
                "데이터 과학",
                "주제",
                "조사"
              ],
              "id": "DS-04-CS-PF-01",
              "legacyId": "1eyoxrk-qsh8za",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "탐색적 데이터 분석으로 데이터 속 의미 파악하기",
              "easy": [
                "데이터 분석",
                "의미"
              ],
              "normal": [
                "탐색적 데이터 분석",
                "데이터",
                "의미",
                "파악"
              ],
              "id": "DS-04-CS-PF-02",
              "legacyId": "1eyoxrk-1jt2sms",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g06",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "기계학습 방법으로 분석하기",
              "easy": [
                "기계학습",
                "분석"
              ],
              "normal": [
                "기계학습",
                "방법",
                "분석"
              ],
              "id": "DS-04-CS-PF-03",
              "legacyId": "1eyoxrk-15ykkzq",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g03",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "결과를 활용하는 방법 탐색하기",
              "easy": [
                "방법",
                "탐색"
              ],
              "normal": [
                "결과",
                "활용",
                "방법",
                "탐색"
              ],
              "id": "DS-04-CS-PF-04",
              "legacyId": "1eyoxrk-lf3p5f",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "문제를 해결하기 위한 창의적인 방법을 고민하는 자세",
              "easy": [
                "창의적인 방법",
                "고민하는 자세"
              ],
              "normal": [
                "문제를 해결",
                "문제",
                "해결",
                "창의적인 방법",
                "고민하는 자세",
                "고민",
                "자세"
              ],
              "id": "DS-04-CS-VA-01",
              "legacyId": "j8myzy-f7lnv7",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "c66-242acba4"
                ],
                "normal": [
                  "n66-8b0ea142",
                  "g01",
                  "g03",
                  "g02",
                  "n66-242acba4",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "복잡하고 어려운 문제를 끝까지 해결하기 위해 노력하는 태도",
              "easy": [
                "끝까지 해결",
                "노력하는 태도"
              ],
              "normal": [
                "복잡하고 어려운 문제",
                "끝까지 해결",
                "노력하는 태도",
                "노력",
                "태도"
              ],
              "id": "DS-04-CS-VA-02",
              "legacyId": "j8myzy-is7gy9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "c66-3d31a885"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "n66-3d31a885",
                  "g04",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06",
                  "g07"
                ],
                "g02": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "일반화 및 공유 과정에서 윤리 문제 등 사회적 영향 인식",
              "easy": [
                "윤리 문제",
                "사회적 영향"
              ],
              "normal": [
                "일반화",
                "공유",
                "윤리 문제",
                "사회적 영향",
                "인식"
              ],
              "id": "DS-04-CS-VA-03",
              "legacyId": "j8myzy-12657b3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12데과04-01] 분야별 데이터 과학의 적용 사례를 조사하여 분석하고 데이터로 해결 가능한 주제를 찾아 적합성을 판단한다.",
              "easy": [
                "데이터 과학",
                "적용 사례",
                "해결 가능한 주제",
                "적합성"
              ],
              "normal": [
                "분야별",
                "데이터 과학",
                "데이터",
                "적용 사례",
                "조사",
                "분석",
                "해결 가능한 주제",
                "적합성",
                "판단"
              ],
              "aliases": {},
              "id": "DS-04-AC-ST-01",
              "legacyId": "1rmtuks-epog8y",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g09",
                  "g05"
                ],
                "normal": [
                  "g06",
                  "g01",
                  "g03",
                  "g02",
                  "g07",
                  "g08",
                  "g09",
                  "g05",
                  "g10"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g11",
                  "g12"
                ]
              }
            },
            {
              "text": "[12데과04-02] 수집된 데이터를 탐색적으로 분석하여 데이터 속 의미를 파악하고 문제 해결을 위한 창의적인 방법을 구상한다.",
              "easy": [
                "탐색적으로",
                "의미",
                "문제 해결",
                "창의적인"
              ],
              "normal": [
                "데이터",
                "탐색적으로 분석",
                "의미",
                "파악",
                "문제 해결",
                "창의적인 방법",
                "구상"
              ],
              "aliases": {},
              "id": "DS-04-AC-ST-02",
              "legacyId": "1rmtuks-25d6m",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g08",
                  "g03",
                  "g04",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g08",
                  "g09"
                ],
                "g05": [
                  "g10",
                  "g11"
                ]
              }
            },
            {
              "text": "[12데과04-03] 데이터 분석을 진행할 때, 2개 이상의 방법을 사용하여 분석하고 결과를 비교한다.",
              "easy": [
                "데이터 분석",
                "2개 이상의 방법",
                "비교"
              ],
              "normal": [
                "데이터 분석",
                "분석",
                "2개 이상의 방법",
                "결과",
                "비교"
              ],
              "aliases": {},
              "id": "DS-04-AC-ST-03",
              "legacyId": "1rmtuks-ykn2pd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "[12데과04-04] 복잡하고 어려운 문제라도 끝까지 해결하기 위한 자세를 갖추고 분석하여 분석 결과에 대한 의미를 해석한다.",
              "easy": [
                "끝까지",
                "분석 결과",
                "의미"
              ],
              "normal": [
                "복잡하고 어려운 문제",
                "끝까지 해결",
                "자세",
                "분석",
                "분석 결과",
                "의미",
                "해석"
              ],
              "aliases": {},
              "id": "DS-04-AC-ST-04",
              "legacyId": "1rmtuks-1gvcekd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g11",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g08",
                  "g09",
                  "g10"
                ],
                "g02": [
                  "g11",
                  "g12"
                ]
              }
            },
            {
              "text": "[12데과04-05] 분석을 위한 목적부터 데이터 수집 및 분석에 이르는 전 과정을 성찰하고 사회적 영향을 고려하여 분석 결과의 활용방안을 탐색한다.",
              "easy": [
                "분석을 위한 목적",
                "데이터 수집",
                "전 과정",
                "사회적 영향"
              ],
              "normal": [
                "분석을 위한 목적",
                "분석",
                "데이터 수집",
                "전 과정",
                "성찰",
                "사회적 영향",
                "고려",
                "분석 결과",
                "활용방안",
                "탐색"
              ],
              "aliases": {},
              "id": "DS-04-AC-ST-05",
              "legacyId": "1rmtuks-1ptpot5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g03",
                  "g02",
                  "g04",
                  "g05",
                  "g06",
                  "g08",
                  "g09",
                  "g07",
                  "g10"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g03",
                  "g11"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12데과04-03] 동일한 데이터를 기반으로 서로 다른 데이터 전처리, 데이터 분석 방법을 적용한 결과를 비교하여 가장 적절한 데이터 모델링 방법을 설계할 수 있어야 한다.",
              "easy": [
                "동일한 데이터",
                "데이터 전처리",
                "데이터 분석",
                "비교",
                "데이터 모델링"
              ],
              "normal": [
                "동일한 데이터",
                "데이터 전처리",
                "데이터 분석 방법",
                "적용",
                "결과",
                "비교",
                "적절한",
                "데이터 모델링 방법",
                "설계"
              ],
              "aliases": {},
              "id": "DS-04-AC-EX-01",
              "legacyId": "1ykpcgs-1jy2h6b",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g12",
                  "g05",
                  "g14"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g07",
                  "g04",
                  "g05",
                  "g15",
                  "g16",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g10",
                  "g11"
                ],
                "g03": [
                  "g12",
                  "g13"
                ],
                "g06": [
                  "g14",
                  "g13"
                ]
              },
              "normalSplitMigrations": {
                "g08": [
                  "g15",
                  "g16"
                ]
              }
            },
            {
              "text": "[12데과04-05] 데이터 분석을 통한 문제 해결 과정에서 파생되는 사회적인 영향, 윤리적인 문제를 성찰하고 데이터 모델을 수정한 후, 문제 해결 결과를 일반화하고 공유할 수 있어야 한다.",
              "easy": [
                "데이터 분석",
                "사회적인",
                "윤리적인",
                "데이터 모델",
                "일반화"
              ],
              "normal": [
                "데이터 분석",
                "문제 해결 과정",
                "사회적인 영향",
                "윤리적인 문제",
                "성찰",
                "데이터 모델",
                "수정",
                "문제 해결 결과",
                "일반화",
                "공유"
              ],
              "aliases": {},
              "id": "DS-04-AC-EX-02",
              "legacyId": "1ykpcgs-1ddu19j",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g13",
                  "g15",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g05",
                  "g09",
                  "g10",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g11",
                  "g12"
                ],
                "g03": [
                  "g13",
                  "g14"
                ],
                "g04": [
                  "g15",
                  "g16"
                ]
              },
              "yaho": [
                "데이터 분석을 통한 문제 해결 과정에서 파생되는 사회적인 영향",
                "윤리적인 문제를 성찰하고 데이터 모델을 수정한 후, 문제 해결 결과를 일반화하고",
                "공유할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "기후위기, 환경 문제, 에너지 문제 등의 주제를 가정, 학교, 지역 및 지구 차원에서 프로젝트 주제로 고려하여, 인류가 당면한 여러 가지 생태적 문제를 데이터 과학 프로젝트를 통해 심층적으로 탐구하도록 한다.",
              "easy": [
                "기후위기",
                "환경",
                "에너지 문제",
                "프로젝트 주제",
                "데이터 과학"
              ],
              "normal": [
                "기후위기",
                "환경 문제",
                "에너지 문제",
                "가정",
                "학교",
                "지역",
                "지구",
                "프로젝트 주제",
                "생태적 문제",
                "데이터 과학 프로젝트",
                "심층적으로 탐구"
              ],
              "aliases": {},
              "id": "DS-04-AC-CO-01",
              "legacyId": "1dahci5-w4cdvv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g13",
                  "g03",
                  "g11",
                  "g16"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g07",
                  "g08",
                  "g09",
                  "g10",
                  "g11",
                  "g05",
                  "g06",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g13",
                  "g14"
                ],
                "g05": [
                  "g15",
                  "g14"
                ],
                "g06": [
                  "g16",
                  "g04"
                ]
              },
              "yaho": [
                "에너지 문제 등의 주제를 가정, 학교, 지역 및 지구 차원에서 프로젝트 주제로 고려하여",
                "인류가 당면한 여러 가지 생태적 문제를 데이터 과학 프로젝트를 통해 심층적으로 탐구하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "여러 가지 데이터 분석 방법 중 기계학습을 통한 분석 방법을 포함하여 분석 결과를 비교함으로써 디지털·인공지능 소양을 기를 수 있도록 교수·학습을 구성하도록 한다.",
              "easy": [
                "데이터 분석",
                "기계학습",
                "분석 결과",
                "디지털·인공지능"
              ],
              "normal": [
                "데이터 분석 방법",
                "분석",
                "방법",
                "기계학습",
                "분석 결과",
                "비교",
                "디지털·인공지능 소양"
              ],
              "aliases": {},
              "id": "DS-04-AC-CO-02",
              "legacyId": "1dahci5-1r4mbm4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g07",
                  "g02",
                  "g03",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g08",
                  "g02",
                  "g03",
                  "g06",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ],
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "프로젝트 과정에서 온라인 공유 환경을 제공하여 온·오프라인의 협업이 모두 일어날 수 있도록 하고 협업 과정이 온라인 문서에 기록될 수 있도록 한다. 특히 주제 선정, 데이터 수집 등에서 아이디어를 발산하고 수렴하는 과정이 기록되도록 하여 프로젝트 내 문제 해결 과정이 드러나는 데에 중점을 두도록 한다.",
              "easy": [
                "온라인 공유",
                "온·오프라인",
                "온라인 문서",
                "주제 선정",
                "데이터 수집",
                "아이디어"
              ],
              "normal": [
                "프로젝트",
                "과정",
                "온라인 공유 환경",
                "온·오프라인",
                "협업",
                "온라인 문서",
                "기록",
                "주제 선정",
                "데이터 수집",
                "아이디어",
                "발산",
                "수렴",
                "문제 해결 과정"
              ],
              "aliases": {},
              "id": "DS-04-AC-CO-03",
              "legacyId": "1dahci5-1hn1a3e",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g13",
                  "g03",
                  "g05",
                  "g06",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g16",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g10",
                  "g06",
                  "g07",
                  "g08",
                  "g11",
                  "g12",
                  "g09"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g13",
                  "g14"
                ],
                "g09": [
                  "g15",
                  "g16"
                ]
              }
            },
            {
              "text": "민주시민으로서 데이터 과학 프로젝트를 통해 생산한 정보의 사회적 영향 및 파급력에 대하여 논의할 수 있도록 문제기반학습을 구성하고 협력학습을 통해 학생들이 토론이나 토의 과정의 기회를 갖도록 한다.",
              "easy": [
                "민주시민",
                "데이터 과학",
                "사회적 영향",
                "문제기반학습",
                "협력학습"
              ],
              "normal": [
                "민주시민",
                "데이터 과학 프로젝트",
                "정보",
                "사회적 영향",
                "파급력",
                "논의",
                "문제기반학습",
                "협력학습",
                "토론",
                "토의"
              ],
              "aliases": {},
              "id": "DS-04-AC-CO-04",
              "legacyId": "1dahci5-3tneid",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g11",
                  "g04",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g08",
                  "g06",
                  "g07",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g11",
                  "g12"
                ]
              },
              "yaho": [
                "데이터 과학 프로젝트를 통해 생산한 정보의 사회적 영향 및 파급력에 대하여",
                "논의할 수 있도록 문제기반학습을 구성하고",
                "협력학습을 통해 학생들이 토론이나 토의 과정의 기회를 갖도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        }
      ]
    },
    "과목 공통": {
      "character-goal": [
        {
          "title": "성격",
          "lines": [
            {
              "id": "DS-CG-CHAR-01",
              "text": "‘데이터 과학’은 데이터와 데이터 처리에 대한 다양한 방법론을 기반으로 통계와 기계학습 등을 활용하여 다양한 학문 분야의 문제 해결과 의사 결정에서 통찰력을 제공하게 된다.",
              "easy": [
                "통계와 기계학습",
                "문제 해결과 의사 결정",
                "통찰력"
              ],
              "normal": [
                "통계와 기계학습",
                "문제 해결과 의사 결정",
                "통찰력",
                "데이터 처리에 대한 다양한 방법론"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-3wn5fv",
                  "g-bb5au7",
                  "g-1fmr93c"
                ],
                "normal": [
                  "g-3wn5fv",
                  "g-bb5au7",
                  "g-1fmr93c",
                  "g-zgepgv"
                ]
              }
            },
            {
              "id": "DS-CG-CHAR-02",
              "text": "학생들은 데이터 과학의 기초적인 원리를 이해하고 데이터 문해력을 함양함으로써 급증하는 데이터를 비판적으로 분석할 수 있으며, 미래 사회와 환경변화 등에 대한 통찰력과 책임감 있는 자기주도성을 갖춘 디지털 민주시민으로 성장하게 된다.",
              "easy": [
                "데이터 문해력",
                "비판적으로 분석",
                "책임감 있는 자기주도성",
                "디지털 민주시민"
              ],
              "normal": [
                "데이터 문해력",
                "비판적으로 분석",
                "책임감 있는 자기주도성",
                "디지털 민주시민"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-15lok6y",
                  "g-hcjdwh",
                  "g-7uof1t",
                  "g-1nf4nef"
                ],
                "normal": [
                  "g-15lok6y",
                  "g-hcjdwh",
                  "g-7uof1t",
                  "g-1nf4nef"
                ]
              }
            },
            {
              "id": "DS-CG-CHAR-03",
              "text": "‘데이터 과학’은 컴퓨팅 사고력을 바탕으로 실생활 및 다양한 분야의 문제를 창의적으로 해결하는 데 필요한 능력과 태도를 함양하며, 데이터 과학의 지식이 필요한 진로와 연계된 기초경험을 제공하도록 한다.",
              "easy": [
                "컴퓨팅 사고력",
                "창의적으로 해결",
                "진로와 연계된 기초경험"
              ],
              "normal": [
                "컴퓨팅 사고력",
                "창의적으로 해결",
                "진로와 연계된 기초경험"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1q9ap0u",
                  "g-nkedsy",
                  "g-9182vz"
                ],
                "normal": [
                  "g-1q9ap0u",
                  "g-nkedsy",
                  "g-9182vz"
                ]
              }
            }
          ]
        },
        {
          "title": "목표",
          "lines": [
            {
              "id": "DS-CG-GOAL-00",
              "text": "‘데이터 과학’은 컴퓨팅 사고력을 기반으로 디지털 사회에서 데이터의 역할 및 잠재적 가치와 데이터 과학에 기반한 문제 해결 과정의 중요성을 인식하며, 다양한 분야의 문제를 해결하고 합리적 의사 결정을 위한 통찰의 역량을 키우는 데 중점을 둔다.",
              "easy": [
                "데이터의 역할 및 잠재적 가치",
                "문제 해결 과정",
                "합리적 의사 결정",
                "통찰의 역량"
              ],
              "normal": [
                "데이터의 역할 및 잠재적 가치",
                "문제 해결 과정",
                "합리적 의사 결정",
                "통찰의 역량",
                "컴퓨팅 사고력"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-vs3drn",
                  "g-n1w9yh",
                  "g-163s7a9",
                  "g-1d4mk0p"
                ],
                "normal": [
                  "g-vs3drn",
                  "g-n1w9yh",
                  "g-163s7a9",
                  "g-1d4mk0p",
                  "g-p0n2i2"
                ]
              }
            },
            {
              "id": "DS-CG-GOAL-01",
              "text": "(1) 데이터 과학의 발전에 따른 사회의 특성과 데이터의 가치를 이해하고, 데이터에 기반한 합리적인 의사 결정을 실천하는 태도를 기른다.",
              "easy": [
                "데이터의 가치",
                "합리적인 의사 결정"
              ],
              "normal": [
                "데이터의 가치",
                "합리적인 의사 결정"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-bfd9fl",
                  "g-myur54"
                ],
                "normal": [
                  "g-bfd9fl",
                  "g-myur54"
                ]
              }
            },
            {
              "id": "DS-CG-GOAL-02",
              "text": "(2) 데이터 분석과 관련된 효과적인 방법을 이해하고, 문제상황에 따라 데이터의 관계를 파악하여 다양한 분석 방법을 적용할 수 있는 능력을 기른다.",
              "easy": [
                "데이터의 관계",
                "다양한 분석 방법"
              ],
              "normal": [
                "데이터의 관계",
                "다양한 분석 방법",
                "문제상황에 따라"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-lnoj58",
                  "g-hck3h2"
                ],
                "normal": [
                  "g-lnoj58",
                  "g-hck3h2",
                  "g-12njycq"
                ]
              }
            },
            {
              "id": "DS-CG-GOAL-03",
              "text": "(3) 문제를 합리적으로 해결하기 위한 모델을 구성하고, 문제 해결 과정에서 발생할 수 있는 여러 쟁점을 비교하며, 분석된 결과의 의미를 찾아 비판적으로 해석하는 능력과 태도를 기른다.",
              "easy": [
                "모델을 구성",
                "여러 쟁점을 비교",
                "비판적으로 해석"
              ],
              "normal": [
                "모델을 구성",
                "여러 쟁점을 비교",
                "비판적으로 해석"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1y0wsay",
                  "g-17xo7za",
                  "g-1x169t7"
                ],
                "normal": [
                  "g-1y0wsay",
                  "g-17xo7za",
                  "g-1x169t7"
                ]
              }
            },
            {
              "id": "DS-CG-GOAL-04",
              "text": "(4) 데이터 과학을 기반으로 한 문제 해결이 합리적 의사 결정에 효과적임을 인식하고, 데이터 과학의 방법으로 문제를 해결하는 능력과 태도를 기른다.",
              "easy": [
                "합리적 의사 결정",
                "데이터 과학의 방법"
              ],
              "normal": [
                "합리적 의사 결정",
                "데이터 과학의 방법"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1thwb59",
                  "g-uu70kr"
                ],
                "normal": [
                  "g-1thwb59",
                  "g-uu70kr"
                ]
              }
            }
          ]
        }
      ],
      "teaching-evaluation": [
        {
          "title": "교수·학습의 방향",
          "lines": [
            {
              "id": "DS-TE-DIR-01",
              "text": "(마) 데이터 과학에 대한 이해를 통해 디지털 사회에서 데이터 기반의 사회 변화에 적극적으로 대응할 수 있는 태도와 능력을 함양할 수 있도록 교수·학습을 설계한다.",
              "easy": [
                "데이터 기반의 사회 변화",
                "적극적으로 대응"
              ],
              "normal": [
                "데이터 기반의 사회 변화",
                "적극적으로 대응"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1sdu852",
                  "g-wrn3ym"
                ],
                "normal": [
                  "g-1sdu852",
                  "g-wrn3ym"
                ]
              }
            },
            {
              "id": "DS-TE-DIR-02",
              "text": "(바) 프로젝트형 실습은 협업을 통해 의사 소통 능력, 협력적 문제 해결력, 공유의 가치 인식 등을 함양하도록 한다.",
              "easy": [
                "프로젝트형 실습",
                "의사 소통 능력",
                "협력적 문제 해결력",
                "공유의 가치 인식"
              ],
              "normal": [
                "프로젝트형 실습",
                "의사 소통 능력",
                "협력적 문제 해결력",
                "공유의 가치 인식"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-yylljy",
                  "g-ftqs1m",
                  "g-1rundil",
                  "g-ad6ngz"
                ],
                "normal": [
                  "g-yylljy",
                  "g-ftqs1m",
                  "g-1rundil",
                  "g-ad6ngz"
                ]
              }
            },
            {
              "id": "DS-TE-DIR-03",
              "text": "(사) 특정 데이터 과학 기술이나 도구의 사용법 습득에 치중하지 않도록 유의하고, 문제 해결을 위한 데이터 과학 기술의 활용, 프로젝트 설계 및 수행을 통해 데이터 문해력과 인공지능 소양을 함양하는 데 중점을 둔다.",
              "easy": [
                "도구의 사용법 습득에 치중하지 않도록",
                "데이터 문해력",
                "인공지능 소양"
              ],
              "normal": [
                "도구의 사용법 습득에 치중하지 않도록",
                "데이터 문해력",
                "인공지능 소양",
                "프로젝트 설계 및 수행"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1s98b4e",
                  "g-1q3hfwf",
                  "g-1ey2nqf"
                ],
                "normal": [
                  "g-1s98b4e",
                  "g-1q3hfwf",
                  "g-1ey2nqf",
                  "g-h7ey9x"
                ]
              }
            }
          ]
        },
        {
          "title": "교수·학습 방법",
          "lines": [
            {
              "id": "DS-TE-MET-01",
              "text": "(가) 교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, 디자인기반학습, 짝 프로그래밍, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
              "easy": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습"
              ],
              "normal": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-9z66ml",
                  "g-35hd2k",
                  "g-qgi5tv",
                  "g-1tc0dg1",
                  "g-1c5hn7p"
                ],
                "normal": [
                  "g-9z66ml",
                  "g-35hd2k",
                  "g-qgi5tv",
                  "g-1tc0dg1",
                  "g-1c5hn7p"
                ]
              }
            },
            {
              "id": "DS-TE-MET-02",
              "text": "(다) 데이터를 수집하고 분석하는 과정에서 토의·토론을 통해 데이터 편향성, 윤리 문제 등 사회적 영향력을 판단하여 의사 결정할 수 있는 과정을 포함한다. 데이터 모델링 과정에서는 토의·토론을 통해 다양한 데이터 분석 방법을 비교하여 선정하고 비판적 시각으로 결과를 해석할 수 있도록 안내한다.",
              "easy": [
                "데이터 편향성",
                "윤리 문제",
                "사회적 영향력",
                "토의·토론",
                "비판적 시각"
              ],
              "normal": [
                "데이터 편향성",
                "윤리 문제",
                "사회적 영향력",
                "토의·토론",
                "비판적 시각",
                "다양한 데이터 분석 방법을 비교"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1p0lz1i",
                  "g-s066xg",
                  "g-1izb0k6",
                  "g-19ie5f1",
                  "g-7e2nzy"
                ],
                "normal": [
                  "g-1p0lz1i",
                  "g-s066xg",
                  "g-1izb0k6",
                  "g-19ie5f1",
                  "g-7e2nzy",
                  "g-13hmaae"
                ]
              }
            }
          ]
        },
        {
          "title": "평가의 방향",
          "lines": [
            {
              "id": "DS-TE-EVD-01",
              "text": "(다) 구체적인 평가 루브릭을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
              "easy": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "normal": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1arsjj2",
                  "g-10p7ogp",
                  "g-11g2787"
                ],
                "normal": [
                  "g-1arsjj2",
                  "g-10p7ogp",
                  "g-11g2787"
                ]
              }
            },
            {
              "id": "DS-TE-EVD-02",
              "text": "(라) 작성한 프로그램의 정확성, 효율성과 더불어 프로그램 설계 과정의 논리성과 실습 과정을 통해 데이터 모델링의 과정을 이해하고 있는지에 중점을 두고 평가한다.",
              "easy": [
                "정확성, 효율성",
                "설계 과정의 논리성",
                "데이터 모델링의 과정"
              ],
              "normal": [
                "정확성, 효율성",
                "설계 과정의 논리성",
                "데이터 모델링의 과정"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1v7urnv",
                  "g-b1aqot",
                  "g-dpi1y5"
                ],
                "normal": [
                  "g-1v7urnv",
                  "g-b1aqot",
                  "g-dpi1y5"
                ]
              }
            },
            {
              "id": "DS-TE-EVD-03",
              "text": "(마) 모둠별 탐구 활동의 성과물에 대한 평가뿐만 아니라 협업 및 발표, 토론 수행 등의 전 과정에서 합리적이고 객관적인 평가가 이루어질 수 있도록 평가기준과 구체적인 체크리스트를 마련하고, 이를 교사 평가뿐만 아니라 자기 평가, 동료 평가의 도구로 활용한다.",
              "easy": [
                "평가기준",
                "체크리스트",
                "자기 평가",
                "동료 평가"
              ],
              "normal": [
                "평가기준",
                "체크리스트",
                "자기 평가",
                "동료 평가",
                "전 과정"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1rrxc9f",
                  "g-43lq2u",
                  "g-6fa1n3",
                  "g-1g043ro"
                ],
                "normal": [
                  "g-1rrxc9f",
                  "g-43lq2u",
                  "g-6fa1n3",
                  "g-1g043ro",
                  "g-qe5wm1"
                ]
              }
            }
          ]
        },
        {
          "title": "평가 방법",
          "lines": [
            {
              "id": "DS-TE-EVM-01",
              "text": "(가) 성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 평가 포트폴리오를 계획한다. 예를 들면, 관찰 평가, 서술형평가, 수행평가 등을 활용하거나, 자기 평가, 동료 평가 등과 같은 다면적 평가를 실행한다.",
              "easy": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행평가",
                "자기 평가",
                "동료 평가"
              ],
              "normal": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행평가",
                "자기 평가",
                "동료 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ys7g3u",
                  "g-7tq6m8",
                  "g-1k9kmn3",
                  "g-13bv73l",
                  "g-15r758w",
                  "g-iogr6j"
                ],
                "normal": [
                  "g-1ys7g3u",
                  "g-7tq6m8",
                  "g-1k9kmn3",
                  "g-13bv73l",
                  "g-15r758w",
                  "g-iogr6j"
                ]
              }
            },
            {
              "id": "DS-TE-EVM-02",
              "text": "(다) 실습 과제를 평가할 경우, 산출물 평가와 더불어 과제 해결 과정을 꾸준히 관찰하여 학생의 학습 과정을 종합적으로 평가한다. 특히 프로젝트형 과제 수행 시 학습자의 수행 과정을 온오프라인 상에 누적하도록 하여 전반적인 과정을 종합적으로 평가하도록 한다.",
              "easy": [
                "산출물 평가",
                "과제 해결 과정",
                "온오프라인 상에 누적",
                "종합적으로 평가"
              ],
              "normal": [
                "산출물 평가",
                "과제 해결 과정",
                "온오프라인 상에 누적",
                "종합적으로 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-15blvix",
                  "g-17aofev",
                  "g-j92p8w",
                  "g-1aqj5wi"
                ],
                "normal": [
                  "g-15blvix",
                  "g-17aofev",
                  "g-j92p8w",
                  "g-1aqj5wi"
                ]
              }
            },
            {
              "id": "DS-TE-EVM-03",
              "text": "(라) 협업 프로젝트를 평가할 때는 학습자별 역할을 구체적으로 기록하고, 동료 평가를 통해 모둠원에서 활동했던 비중을 논의하여 제시하도록 함으로써 최대한 공정성을 확보한다.",
              "easy": [
                "학습자별 역할",
                "동료 평가",
                "공정성을 확보"
              ],
              "normal": [
                "학습자별 역할",
                "동료 평가",
                "공정성을 확보"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-7t0k5o",
                  "g-19s39a5",
                  "g-1jwgs2r"
                ],
                "normal": [
                  "g-7t0k5o",
                  "g-19s39a5",
                  "g-1jwgs2r"
                ]
              }
            }
          ]
        }
      ]
    }
  },
  "software-life": {
    "세상을 변화시키는 소프트웨어": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "디지털 기술의 발전에 따라 소프트웨어는 인간의 삶과 사회 전반을 변화시키고 있다.",
              "easy": [
                "디지털 기술",
                "인간의 삶",
                "사회 전반"
              ],
              "normal": [
                "디지털 기술",
                "발전",
                "소프트웨어",
                "인간의 삶",
                "사회 전반",
                "변화"
              ],
              "id": "SL-01-CS-KI-01",
              "legacyId": "19een0-1h9l8wf",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "학문 분야와 소프트웨어의 융합은 세상의 문제와 현상을 효과적으로 탐구하고 해결하는 데 도움을 준다.",
              "easy": [
                "학문 분야",
                "소프트웨어",
                "융합",
                "현상"
              ],
              "normal": [
                "학문 분야",
                "소프트웨어",
                "융합",
                "세상의 문제",
                "현상",
                "효과적으로 탐구",
                "해결"
              ],
              "id": "SL-01-CS-KI-02",
              "legacyId": "19een0-btn50f",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g05",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "소프트웨어와 사회 변화",
              "easy": [
                "소프트웨어",
                "사회 변화"
              ],
              "normal": [
                "소프트웨어",
                "사회 변화"
              ],
              "id": "SL-01-CS-KN-01",
              "legacyId": "1gji2b-qd772t",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "소프트웨어 융합과 문제 해결",
              "easy": [
                "소프트웨어 융합",
                "문제 해결"
              ],
              "normal": [
                "소프트웨어 융합",
                "문제 해결"
              ],
              "id": "SL-01-CS-KN-02",
              "legacyId": "1gji2b-12rqz09",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "소프트웨어를 통해 세상을 변화시킨 사례 탐색하기",
              "easy": [
                "소프트웨어",
                "변화"
              ],
              "normal": [
                "소프트웨어",
                "세상",
                "변화",
                "사례",
                "탐색"
              ],
              "id": "SL-01-CS-PF-01",
              "legacyId": "1eyoxrk-1txz7r6",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "소프트웨어의 발전에 따른 미래 사회 예측하기",
              "easy": [
                "소프트웨어",
                "미래 사회"
              ],
              "normal": [
                "소프트웨어",
                "발전",
                "미래 사회",
                "예측"
              ],
              "id": "SL-01-CS-PF-02",
              "legacyId": "1eyoxrk-1ajnmge",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "소프트웨어와의 융합을 통한 문제 해결이 가능한 사례 탐색하기",
              "easy": [
                "소프트웨어",
                "융합"
              ],
              "normal": [
                "소프트웨어",
                "융합",
                "문제 해결",
                "가능한 사례",
                "탐색"
              ],
              "id": "SL-01-CS-PF-03",
              "legacyId": "1eyoxrk-1xp7jj8",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "문제와 현상을 소프트웨어의 관점으로 바라보는 자세",
              "easy": [
                "현상",
                "소프트웨어의 관점"
              ],
              "normal": [
                "문제",
                "현상",
                "소프트웨어의 관점",
                "바라보는 자세"
              ],
              "id": "SL-01-CS-VA-01",
              "legacyId": "j8myzy-s65ba",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "실생활 및 다양한 학문 분야의 문제 해결에 소프트웨어를 적용하는 자세",
              "easy": [
                "학문 분야",
                "소프트웨어"
              ],
              "normal": [
                "실생활",
                "학문 분야",
                "문제 해결",
                "소프트웨어",
                "적용",
                "자세"
              ],
              "id": "SL-01-CS-VA-02",
              "legacyId": "j8myzy-nz5y9t",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12소생01-01] 소프트웨어가 세상을 변화시킨 사례를 탐색하고 소프트웨어가 사회 변화에 미치는 영향을 분석한다.",
              "easy": [
                "소프트웨어",
                "세상",
                "사회 변화",
                "영향"
              ],
              "normal": [
                "소프트웨어",
                "세상",
                "변화",
                "사례",
                "탐색",
                "사회 변화",
                "영향",
                "분석"
              ],
              "aliases": {},
              "id": "SL-01-AC-ST-01",
              "legacyId": "1rmtuks-pxknrl",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g07",
                  "g04",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12소생01-02] 실세계의 문제와 현상을 소프트웨어의 관점으로 바라보고 소프트웨어 발전에 따른 미래 사회의 변화를 예측한다.",
              "easy": [
                "실세계",
                "현상",
                "소프트웨어의 관점",
                "미래 사회"
              ],
              "normal": [
                "실세계",
                "문제",
                "현상",
                "소프트웨어의 관점",
                "소프트웨어 발전",
                "미래 사회",
                "변화",
                "예측"
              ],
              "aliases": {},
              "id": "SL-01-AC-ST-02",
              "legacyId": "1rmtuks-4tfoth",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g05",
                  "g07",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "[12소생01-03] 소프트웨어 융합을 통한 문제 해결 사례를 바탕으로 다양한 학문 분야에서 소프트웨어와의 융합을 통해 문제를 해결하는 방법을 비교·분석한다.",
              "easy": [
                "소프트웨어 융합",
                "문제 해결 사례",
                "학문 분야",
                "해결하는 방법"
              ],
              "normal": [
                "소프트웨어 융합",
                "융합",
                "문제 해결 사례",
                "문제",
                "학문 분야",
                "해결하는 방법",
                "비교·분석"
              ],
              "aliases": {},
              "id": "SL-01-AC-ST-03",
              "legacyId": "1rmtuks-v874ih",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g04",
                  "g03",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g08",
                  "g09"
                ],
                "g05": [
                  "g10",
                  "g11"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12소생01-02] 세상의 문제와 현상에 대한 구체적 사례와 특징을 소프트웨어 기술을 도입하기 전과 후로 구분하여 분석하고 이를 바탕으로 사회 변화의 흐름을 파악할 수 있어야 한다.",
              "easy": [
                "현상",
                "소프트웨어 기술",
                "도입하기 전",
                "후",
                "사회 변화"
              ],
              "normal": [
                "세상의 문제",
                "현상",
                "구체적 사례",
                "특징",
                "소프트웨어 기술",
                "도입하기 전",
                "후",
                "분석",
                "사회 변화",
                "흐름",
                "파악"
              ],
              "aliases": {},
              "id": "SL-01-AC-EX-01",
              "legacyId": "1ykpcgs-h4jtl0",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04",
                  "g11",
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g08",
                  "g02",
                  "g09",
                  "g10",
                  "g04",
                  "g11",
                  "g06",
                  "g12",
                  "g07",
                  "g13",
                  "g14"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g15",
                  "g16"
                ]
              }
            },
            {
              "text": "[12소생01-03] 인문, 사회, 과학, 예술 등 다양한 학문 분야에서 소프트웨어와 융합으로 문제가 해결되거나 발전한 구체적인 사례를 탐색하여 소프트웨어와의 융합을 통한 문제 해결이 가지는 장점을 설명할 수 있어야 한다.",
              "easy": [
                "인문",
                "과학",
                "예술",
                "소프트웨어",
                "융합"
              ],
              "normal": [
                "인문",
                "사회",
                "과학",
                "예술",
                "학문 분야",
                "소프트웨어",
                "융합",
                "문제",
                "해결",
                "발전",
                "사례",
                "탐색",
                "문제 해결",
                "장점",
                "설명"
              ],
              "aliases": {},
              "id": "SL-01-AC-EX-02",
              "legacyId": "1ykpcgs-yma1zd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g09",
                  "g05",
                  "g06",
                  "g10",
                  "g11",
                  "g12",
                  "g13",
                  "g14",
                  "g07",
                  "g08",
                  "g15"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "yaho": [
                "등 다양한 학문 분야에서 소프트웨어와 융합으로 문제가 해결되거나 발전한 구체적인 사례를 탐색하여",
                "소프트웨어와의 융합을 통한 문제 해결이 가지는 장점을 설명할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "일반적인 자료(인터넷 기사, 동영상 등) 및 전문 자료(보고서, 논문 등) 검색을 통해 세상을 변화시킨 소프트웨어의 사례에 대해 학생들이 비판적으로 탐색 및 분석할 수 있는 활동을 제공한다. 또한 학생들이 인식한 세상의 변화에 대해 논의하는 활동을 중심으로 교수·학습을 구성하여 학생들이 근거를 기반으로 민주적으로 의사 소통하는 능력을 함양하도록 한다.",
              "easy": [
                "전문 자료",
                "소프트웨어",
                "비판적으로",
                "근거",
                "민주적으로",
                "의사 소통"
              ],
              "normal": [
                "일반적인 자료",
                "동영상",
                "전문 자료",
                "보고서",
                "소프트웨어",
                "사례",
                "비판적으로",
                "탐색",
                "분석",
                "세상의 변화",
                "논의",
                "중심으로",
                "학습",
                "근거",
                "민주적으로 의사 소통",
                "능력",
                "함양"
              ],
              "aliases": {},
              "id": "SL-01-AC-CO-01",
              "legacyId": "1dahci5-clu4lk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g05",
                  "g13",
                  "g14"
                ],
                "normal": [
                  "g07",
                  "n66-e8b8fd51",
                  "g01",
                  "n66-db15f898",
                  "g02",
                  "g03",
                  "g04",
                  "g08",
                  "g09",
                  "g10",
                  "g11",
                  "n66-46daf4da",
                  "n66-40e4ac9a",
                  "g05",
                  "g06",
                  "g12",
                  "n66-c7375d5a"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g06": [
                  "g13",
                  "g14"
                ]
              },
              "yaho": [
                "동영상 등) 및 전문 자료(보고서",
                "논문 등) 검색을 통해 세상을 변화시킨 소프트웨어의 사례에 대해 학생들이",
                "비판적으로 탐색 및 분석할 수 있는 활동을 제공한다",
                "또한 학생들이 인식한 세상의 변화에 대해 논의하는 활동을 중심으로 교수·학습을 구성하여",
                "학생들이 근거를 기반으로 민주적으로 의사 소통하는 능력을 함양하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "다양한 학문 분야 및 지역사회와 국가 차원의 다양한 이슈에 대해 소프트웨어 기술을 융합하여 문제를 해결한 사례를 구체적으로 살펴보도록 교수·학습을 구성한다. 또한 문제 해결에 소프트웨어를 융합하기 위해 필요한 역량이 무엇인지 학습자가 스스로 인식하고 있는지를 평가에 포함하도록 한다.",
              "easy": [
                "학문 분야",
                "지역사회",
                "국가",
                "소프트웨어",
                "융합",
                "문제 해결"
              ],
              "normal": [
                "다양한 학문 분야",
                "학문 분야",
                "지역사회",
                "국가",
                "이슈",
                "소프트웨어 기술",
                "소프트웨어",
                "융합",
                "사례",
                "문제 해결",
                "필요한 역량",
                "학습자",
                "인식",
                "평가"
              ],
              "aliases": {},
              "id": "SL-01-AC-CO-02",
              "legacyId": "1dahci5-1d3xto1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g14",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "n66-f8603864",
                  "g01",
                  "g02",
                  "g03",
                  "g08",
                  "g04",
                  "g14",
                  "g05",
                  "g09",
                  "g06",
                  "g10",
                  "g11",
                  "g12",
                  "g13"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g14",
                  "g15"
                ]
              }
            }
          ]
        }
      ]
    },
    "창작을 지원하는 소프트웨어": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "다양한 장치와 센서를 소프트웨어를 통해 작품과 결합함으로써 작품의 창작을 지원한다.",
              "easy": [
                "장치",
                "센서",
                "소프트웨어"
              ],
              "normal": [
                "장치",
                "센서",
                "소프트웨어",
                "작품",
                "결합",
                "창작",
                "지원"
              ],
              "id": "SL-02-CS-KI-01",
              "legacyId": "19een0-pyfxb9",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "피지컬 컴퓨팅을 통한 작품 창작은 생각을 현실화하고 문제를 해결하는 데 도움을 준다.",
              "easy": [
                "피지컬 컴퓨팅",
                "작품",
                "창작"
              ],
              "normal": [
                "피지컬 컴퓨팅",
                "작품 창작",
                "생각",
                "현실화",
                "문제",
                "해결"
              ],
              "id": "SL-02-CS-KI-02",
              "legacyId": "19een0-9kughg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "피지컬 컴퓨팅 도구",
              "easy": [
                "피지컬 컴퓨팅",
                "도구"
              ],
              "normal": [
                "피지컬 컴퓨팅",
                "도구"
              ],
              "id": "SL-02-CS-KN-01",
              "legacyId": "1gji2b-zrl7tw",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "미디어 아트",
              "easy": [
                "미디어 아트"
              ],
              "normal": [
                "미디어 아트"
              ],
              "id": "SL-02-CS-KN-02",
              "legacyId": "1gji2b-k98181",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "웨어러블 장치",
              "easy": [
                "웨어러블",
                "장치"
              ],
              "normal": [
                "웨어러블 장치"
              ],
              "id": "SL-02-CS-KN-03",
              "legacyId": "1gji2b-1ce2tri",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "피지컬 컴퓨팅 시스템의 구성 및 작동 원리 분석하기",
              "easy": [
                "피지컬 컴퓨팅",
                "작동 원리"
              ],
              "normal": [
                "피지컬 컴퓨팅 시스템",
                "구성",
                "작동 원리",
                "분석"
              ],
              "id": "SL-02-CS-PF-01",
              "legacyId": "1eyoxrk-urv15r",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g05",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "목적에 맞는 센서와 액추에이터 탐색하기",
              "easy": [
                "센서",
                "액추에이터"
              ],
              "normal": [
                "목적에 맞는",
                "목적",
                "센서",
                "액추에이터",
                "탐색"
              ],
              "id": "SL-02-CS-PF-02",
              "legacyId": "1eyoxrk-1xhq8qx",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "n66-55732469",
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "피지컬 컴퓨팅을 통해 작품 구현하기",
              "easy": [
                "피지컬 컴퓨팅",
                "작품"
              ],
              "normal": [
                "피지컬 컴퓨팅",
                "작품",
                "구현"
              ],
              "id": "SL-02-CS-PF-03",
              "legacyId": "1eyoxrk-yz9gpy",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "소프트웨어를 통한 아이디어 표현의 다양성과 유연성",
              "easy": [
                "소프트웨어",
                "유연성"
              ],
              "normal": [
                "소프트웨어",
                "아이디어 표현",
                "다양성",
                "유연성"
              ],
              "id": "SL-02-CS-VA-01",
              "legacyId": "j8myzy-3wtior",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "다양한 분야에서 활용된 소프트웨어의 가치 성찰",
              "easy": [
                "소프트웨어",
                "성찰"
              ],
              "normal": [
                "다양한 분야",
                "소프트웨어",
                "가치",
                "성찰"
              ],
              "id": "SL-02-CS-VA-02",
              "legacyId": "j8myzy-1u3jn60",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g05",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12소생02-01] 피지컬 컴퓨팅 도구로 구현된 작품의 구성 및 작동 원리를 분석한다.",
              "easy": [
                "피지컬 컴퓨팅",
                "작품",
                "작동 원리"
              ],
              "normal": [
                "피지컬 컴퓨팅 도구",
                "작품",
                "구성",
                "작동 원리",
                "분석"
              ],
              "aliases": {},
              "id": "SL-02-AC-ST-01",
              "legacyId": "1rmtuks-17983tc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g06",
                  "g02",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12소생02-02] 소프트웨어를 통해 아이디어를 표현하는 데 필요한 센서와 액추에이터를 선택하여 피지컬 컴퓨팅 시스템을 구성한다.",
              "easy": [
                "아이디어",
                "센서",
                "액추에이터",
                "피지컬 컴퓨팅"
              ],
              "normal": [
                "소프트웨어",
                "아이디어",
                "표현",
                "센서",
                "액추에이터",
                "선택",
                "피지컬 컴퓨팅 시스템",
                "구성"
              ],
              "aliases": {},
              "id": "SL-02-AC-ST-02",
              "legacyId": "1rmtuks-1m4yb3n",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g09"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "g07",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "[12소생02-03] 피지컬 컴퓨팅을 통해 미디어 아트 작품을 창작하고, 창작에 활용된 소프트웨어의 가치를 파악한다.",
              "easy": [
                "피지컬 컴퓨팅",
                "미디어 아트",
                "작품",
                "소프트웨어"
              ],
              "normal": [
                "피지컬 컴퓨팅",
                "미디어 아트",
                "작품",
                "창작",
                "소프트웨어",
                "가치",
                "파악"
              ],
              "aliases": {},
              "id": "SL-02-AC-ST-03",
              "legacyId": "1rmtuks-9w6yui",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g06",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12소생02-04] 웨어러블 장치 작품을 창작하고 공유하는 과정을 통해 소프트웨어의 가치를 확산한다.",
              "easy": [
                "웨어러블 장치",
                "작품",
                "공유",
                "소프트웨어"
              ],
              "normal": [
                "웨어러블 장치",
                "작품",
                "창작",
                "공유",
                "소프트웨어",
                "가치",
                "확산"
              ],
              "aliases": {},
              "id": "SL-02-AC-ST-04",
              "legacyId": "1rmtuks-4oaakg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g08",
                  "g09"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12소생02-01] 피지컬 컴퓨팅 도구로 구현된 작품 또는 장치를 분석하여 센서나 액추에이터의 기능과 역할을 설명하고, 센서나 액추에이터를 다양한 용도로 유연하게 활용할 수 있음을 인식할 수 있어야 한다.",
              "easy": [
                "피지컬 컴퓨팅",
                "센서",
                "액추에이터",
                "기능",
                "유연하게"
              ],
              "normal": [
                "피지컬 컴퓨팅 도구",
                "작품",
                "장치",
                "센서",
                "액추에이터",
                "기능",
                "역할",
                "다양한 용도",
                "유연하게 활용",
                "인식"
              ],
              "aliases": {},
              "id": "SL-02-AC-EX-01",
              "legacyId": "1ykpcgs-ka5vkg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g11",
                  "g02",
                  "g03",
                  "g04",
                  "g13"
                ],
                "normal": [
                  "g01",
                  "g07",
                  "g08",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g09",
                  "g06",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g11",
                  "g12"
                ],
                "g06": [
                  "g13",
                  "g14"
                ]
              },
              "yaho": [
                "피지컬 컴퓨팅 도구로 구현된 작품 또는 장치를 분석하여",
                "센서나 액추에이터의 기능과 역할을 설명하고",
                "센서나 액추에이터를 다양한 용도로 유연하게 활용할 수 있음을 인식할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "원격수업 등 피지컬 컴퓨팅 도구를 활용하기 어려운 경우 소프트웨어 기반의 가상 시뮬레이터를 활용하여 교수·학습을 구성하도록 한다. 가상 시뮬레이터를 활용하는 경우 학습자가 다양한 컴퓨팅 환경을 사용할 수 있음을 인식하고 되도록 특정 디지털 기기에 의존하지 않는 학습 환경을 제공하여 교수·학습이 원활하게 이루어지도록 한다.",
              "easy": [
                "원격수업",
                "피지컬 컴퓨팅",
                "가상 시뮬레이터",
                "컴퓨팅 환경",
                "학습 환경"
              ],
              "normal": [
                "원격수업",
                "피지컬 컴퓨팅 도구",
                "소프트웨어 기반",
                "가상 시뮬레이터",
                "교수·학습",
                "학습자",
                "컴퓨팅 환경",
                "특정 디지털 기기",
                "학습 환경"
              ],
              "aliases": {},
              "id": "SL-02-AC-CO-01",
              "legacyId": "1dahci5-1lo2ykr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g10",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g03",
                  "g09",
                  "g07",
                  "g04",
                  "g08",
                  "g05"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g10",
                  "g11"
                ]
              },
              "yaho": [
                "원격수업 등 피지컬 컴퓨팅 도구를 활용하기 어려운 경우",
                "소프트웨어 기반의 가상 시뮬레이터를 활용하여 교수·학습을 구성하도록 한다",
                "경우 학습자가 다양한 컴퓨팅 환경을 사용할 수 있음을 인식하고",
                "되도록 특정 디지털 기기에 의존하지 않는 학습 환경을 제공하여",
                "교수·학습이 원활하게 이루어지도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ],
                "y02": [
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "예술 분야와 피지컬 컴퓨팅이 융합될 때 두 분야의 표현 범위가 확장될 수 있음을 이해하도록 하고 표현하려는 아이디어에 대한 설계와 구현 결과가 오류 없이 실행되어 의도한 바를 충분히 표현할 수 있는지 평가하도록 한다.",
              "easy": [
                "예술",
                "피지컬 컴퓨팅",
                "융합",
                "범위",
                "아이디어"
              ],
              "normal": [
                "예술 분야",
                "분야",
                "피지컬 컴퓨팅",
                "융합",
                "표현 범위",
                "표현",
                "확장",
                "아이디어",
                "설계",
                "구현 결과",
                "오류",
                "의도한 바",
                "평가"
              ],
              "aliases": {},
              "id": "SL-02-AC-CO-02",
              "legacyId": "1dahci5-4nt4lt",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g13",
                  "g02",
                  "g03",
                  "g15",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g14",
                  "g02",
                  "g03",
                  "g04",
                  "g11",
                  "g08",
                  "g05",
                  "g06",
                  "g07",
                  "g09",
                  "g10",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g13",
                  "g14"
                ],
                "g04": [
                  "g11",
                  "g15"
                ],
                "g07": [
                  "g16",
                  "g17"
                ]
              },
              "yaho": [
                "융합될 때 두 분야의 표현 범위가 확장될 수 있음을 이해하도록 하고",
                "표현하려는 아이디어에 대한 설계와 구현 결과가 오류 없이 실행되어",
                "의도한 바를 충분히 표현할 수 있는지 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "최소 성취수준을 보장하기 위하여 학습자의 수준에 맞는 피지컬 컴퓨팅 활동을 계획하고, 피지컬 컴퓨팅 시스템을 구현하기 위한 아이디어와 설계 계획, 구현 계획을 충분히 기록할 수 있는 환경을 제공하여 물리적인 구현이 이루어지지 않더라도 아이디어 발산, 설계 계획 수립 등 학습 과정에 대한 평가가 이루어지도록 한다.",
              "easy": [
                "최소 성취수준",
                "피지컬 컴퓨팅",
                "아이디어",
                "설계 계획",
                "구현 계획",
                "아이디어 발산"
              ],
              "normal": [
                "최소 성취수준",
                "수준",
                "학습자",
                "피지컬 컴퓨팅 활동",
                "피지컬 컴퓨팅 시스템",
                "아이디어",
                "설계 계획",
                "구현 계획",
                "기록",
                "물리적인 구현",
                "아이디어 발산",
                "학습 과정",
                "평가"
              ],
              "aliases": {},
              "id": "SL-02-AC-CO-03",
              "legacyId": "1dahci5-cgwhoi",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g14",
                  "g04",
                  "g05",
                  "g06",
                  "g11"
                ],
                "normal": [
                  "g01",
                  "g08",
                  "g07",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g09",
                  "g10",
                  "g11",
                  "g12",
                  "g13"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g14",
                  "g15"
                ],
                "g03": [
                  "g14",
                  "g16"
                ]
              },
              "yaho": [
                "수준에 맞는 피지컬 컴퓨팅 활동을 계획하고",
                "피지컬 컴퓨팅 시스템을 구현하기 위한 아이디어와 설계 계획",
                "구현 계획을 충분히 기록할 수 있는 환경을 제공하여",
                "물리적인 구현이 이루어지지 않더라도 아이디어 발산",
                "설계 계획 수립 등 학습 과정에 대한 평가가 이루어지도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            }
          ]
        }
      ]
    },
    "현상을 분석하는 소프트웨어": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "데이터를 다루는 소프트웨어는 사회 각 분야에서 발생하는 방대한 데이터를 효율적으로 수집, 가공, 분석하는 데 활용된다.",
              "easy": [
                "소프트웨어",
                "수집",
                "가공",
                "분석"
              ],
              "normal": [
                "데이터",
                "소프트웨어",
                "사회 각 분야",
                "방대한 데이터",
                "효율적으로 수집",
                "가공",
                "분석",
                "활용"
              ],
              "id": "SL-03-CS-KI-01",
              "legacyId": "19een0-m0n8lj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g06",
                  "g07",
                  "g08",
                  "g04",
                  "g05",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 분석은 다양한 분야의 현상을 합리적으로 해석할 수 있도록 도움을 준다.",
              "easy": [
                "데이터 분석",
                "현상",
                "합리적으로"
              ],
              "normal": [
                "데이터 분석",
                "다양한 분야",
                "현상",
                "합리적으로 해석",
                "도움"
              ],
              "id": "SL-03-CS-KI-02",
              "legacyId": "19een0-1b2p39m",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g05",
                  "g03",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g07",
                  "g08"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "데이터 유형별 수집 방법",
              "easy": [
                "데이터",
                "유형",
                "수집",
                "방법"
              ],
              "normal": [
                "데이터 유형",
                "수집 방법"
              ],
              "id": "SL-03-CS-KN-01",
              "legacyId": "1gji2b-1vspym1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g03",
                  "g04"
                ],
                "g02": [
                  "g05",
                  "g06"
                ]
              }
            },
            {
              "text": "데이터 시각화와 분석",
              "easy": [
                "데이터 시각화",
                "분석"
              ],
              "normal": [
                "데이터 시각화",
                "분석"
              ],
              "id": "SL-03-CS-KN-02",
              "legacyId": "1gji2b-1kgweh1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "다양한 분야의 데이터 탐색하기",
              "easy": [
                "데이터",
                "탐색"
              ],
              "normal": [
                "다양한 분야",
                "데이터",
                "탐색"
              ],
              "id": "SL-03-CS-PF-01",
              "legacyId": "1eyoxrk-1odl87d",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g04",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터 처리하고 관리하기",
              "easy": [
                "처리",
                "관리"
              ],
              "normal": [
                "데이터 처리",
                "데이터",
                "처리",
                "관리"
              ],
              "id": "SL-03-CS-PF-02",
              "legacyId": "1eyoxrk-1qcmrsr",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "n66-c0a28919",
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "데이터를 분석하여 의미 파악하기",
              "easy": [
                "분석",
                "의미"
              ],
              "normal": [
                "데이터",
                "분석",
                "의미",
                "파악"
              ],
              "id": "SL-03-CS-PF-03",
              "legacyId": "1eyoxrk-1wu640z",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "데이터의 사회적 가치 인식",
              "easy": [
                "데이터",
                "사회적 가치"
              ],
              "normal": [
                "데이터",
                "사회적 가치",
                "인식"
              ],
              "id": "SL-03-CS-VA-01",
              "legacyId": "j8myzy-1sjw359",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g04",
                  "g05"
                ]
              }
            },
            {
              "text": "데이터 분석 결과를 윤리적으로 활용하는 태도",
              "easy": [
                "데이터 분석",
                "윤리적으로"
              ],
              "normal": [
                "데이터 분석 결과",
                "윤리적으로 활용",
                "태도"
              ],
              "id": "SL-03-CS-VA-02",
              "legacyId": "j8myzy-aivjzk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g04",
                  "g05"
                ],
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12소생03-01] 사회 현상을 분석할 수 있는 데이터의 중요성과 가치를 인식하고 데이터를 탐색하여 활용 방안을 구상한다.",
              "easy": [
                "사회 현상",
                "중요성",
                "가치",
                "방안"
              ],
              "normal": [
                "사회 현상",
                "데이터",
                "중요성",
                "가치",
                "인식",
                "탐색",
                "활용 방안",
                "구상"
              ],
              "aliases": {},
              "id": "SL-03-AC-ST-01",
              "legacyId": "1rmtuks-1i681sf",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g07",
                  "g05",
                  "g08"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "[12소생03-02] 데이터 유형에 따라 적합한 방법으로 데이터를 수집하고 목적에 맞게 처리하고 관리한다.",
              "easy": [
                "유형",
                "수집",
                "처리",
                "관리"
              ],
              "normal": [
                "데이터 유형",
                "데이터",
                "적합한 방법",
                "수집",
                "목적",
                "처리",
                "관리"
              ],
              "aliases": {},
              "id": "SL-03-AC-ST-02",
              "legacyId": "1rmtuks-1wvkscv",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g09",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g08",
                  "g06",
                  "g03",
                  "g07",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "[12소생03-03] 데이터를 분석하고 시각화하여 다양한 사회 현상의 의미를 해석한다.",
              "easy": [
                "분석",
                "시각화",
                "사회 현상"
              ],
              "normal": [
                "데이터",
                "분석",
                "시각화",
                "사회 현상",
                "의미",
                "해석"
              ],
              "aliases": {},
              "id": "SL-03-AC-ST-03",
              "legacyId": "1rmtuks-100zyj5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12소생03-04] 데이터의 사회적 가치에 대한 이해를 토대로 데이터를 분석하고 의미를 파악한 후, 결과를 윤리적으로 활용한다.",
              "easy": [
                "사회적",
                "분석",
                "의미",
                "윤리적으로"
              ],
              "normal": [
                "데이터",
                "사회적 가치",
                "분석",
                "의미",
                "파악",
                "결과",
                "윤리적으로 활용"
              ],
              "aliases": {},
              "id": "SL-03-AC-ST-04",
              "legacyId": "1rmtuks-1n5lby",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g08",
                  "g03",
                  "g04",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g06",
                  "g07",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g08",
                  "g09"
                ],
                "g05": [
                  "g10",
                  "g11"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12소생03-01] 데이터를 활용하는 다양한 사회 현상을 탐색하여 데이터 분석의 필요성을 인식할 수 있어야 한다. 공공 및 민간 데이터 제공 플랫폼을 통해 문제 해결에 필요한 데이터를 탐색하고 탐색한 데이터의 활용 방안을 파악할 수 있어야 한다.",
              "easy": [
                "사회 현상",
                "데이터 분석",
                "공공",
                "민간 데이터",
                "플랫폼"
              ],
              "normal": [
                "데이터",
                "사회 현상",
                "탐색",
                "데이터 분석",
                "필요성",
                "공공",
                "민간 데이터",
                "제공 플랫폼",
                "문제 해결",
                "활용 방안",
                "파악"
              ],
              "aliases": {},
              "id": "SL-03-AC-EX-01",
              "legacyId": "1ykpcgs-qffhig",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g04",
                  "g11",
                  "g13"
                ],
                "normal": [
                  "g07",
                  "g01",
                  "g08",
                  "g02",
                  "g03",
                  "g04",
                  "g11",
                  "g14",
                  "g06",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y01",
                  "y02"
                ]
              },
              "coreSplitMigrations": {
                "g05": [
                  "g11",
                  "g12",
                  "g13"
                ]
              },
              "normalSplitMigrations": {
                "g05": [
                  "g11",
                  "g14"
                ]
              }
            },
            {
              "text": "[12소생03-02] 수집 의도에 맞는 데이터 유형(정형데이터, 비정형데이터 등)에 따라 알맞은 데이터 수집 방법이나 도구를 선택하고, 수집한 데이터에서 필요한 부분과 필요하지 않은 부분을 구분하여 데이터를 정제하고 저장할 수 있어야 한다.",
              "easy": [
                "정형데이터",
                "비정형데이터",
                "데이터 수집",
                "도구",
                "저장"
              ],
              "normal": [
                "수집 의도",
                "데이터 유형",
                "데이터",
                "정형데이터",
                "비정형데이터",
                "데이터 수집 방법",
                "도구",
                "선택",
                "필요한 부분",
                "필요하지 않은 부분",
                "구분",
                "정제",
                "저장"
              ],
              "aliases": {},
              "id": "SL-03-AC-EX-02",
              "legacyId": "1ykpcgs-1mt0016",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03",
                  "g15",
                  "g05",
                  "g07"
                ],
                "normal": [
                  "g08",
                  "g01",
                  "g13",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g09",
                  "g10",
                  "g11",
                  "g12",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g13",
                  "g14"
                ],
                "g04": [
                  "g15",
                  "g16"
                ]
              },
              "yaho": [
                "비정형데이터 등)에 따라 알맞은 데이터 수집 방법이나 도구를 선택하고",
                "수집한 데이터에서 필요한 부분과 필요하지 않은 부분을 구분하여 데이터를 정제하고",
                "저장할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "개인 정보가 포함된 데이터의 경우 개인 정보가 식별되지 않도록 처리하고 결과 예측에 편향이 생길 가능성을 사전에 점검하여 데이터의 편향이 최소한으로 일어날 수 있는 방향으로 활동을 구성하도록 한다.",
              "easy": [
                "개인 정보",
                "식별되지 않도록 처리",
                "예측",
                "편향",
                "최소한"
              ],
              "normal": [
                "개인 정보",
                "데이터",
                "식별되지 않도록 처리",
                "결과 예측",
                "편향",
                "가능성",
                "사전에",
                "점검",
                "최소한"
              ],
              "aliases": {},
              "id": "SL-03-AC-CO-01",
              "legacyId": "1dahci5-8qwnal",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g06",
                  "g12",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g10",
                  "g06",
                  "g03",
                  "g04",
                  "g07",
                  "g08",
                  "g09",
                  "g05"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g11",
                  "g12"
                ]
              },
              "yaho": [
                "경우 개인 정보가 식별되지 않도록 처리하고 결과 예측에 편향이 생길 가능성을 사전에 점검하여",
                "데이터의 편향이 최소한으로 일어날 수 있는 방향으로 활동을 구성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02"
                ]
              }
            },
            {
              "text": "현상을 분석하기 위한 문제 상황, 해결 동기 및 목적, 데이터의 수집 및 관리, 분석 방법 및 과정, 결과 해석 등 일련의 수행 과정을 보고서, 포트폴리오 등으로 누적하도록 하고 가치 있는 데이터를 선택하였는지, 데이터 유형에 따라 적절한 방법을 선택하여 목적에 맞게 가공하였는지, 올바른 시각화 방법을 선택하였는지, 결과 해석이 분석 데이터를 토대로 객관적으로 도출되었는지 등을 종합적으로 평가하도록 한다.",
              "easy": [
                "문제 상황",
                "목적",
                "수집",
                "분석 방법",
                "보고서",
                "포트폴리오",
                "시각화"
              ],
              "normal": [
                "문제 상황",
                "해결 동기",
                "목적",
                "데이터의 수집 및 관리",
                "분석 방법",
                "과정",
                "결과 해석",
                "보고서",
                "포트폴리오",
                "누적",
                "가치 있는 데이터",
                "데이터 유형",
                "가공",
                "시각화 방법",
                "분석 데이터",
                "객관적으로",
                "평가"
              ],
              "aliases": {},
              "id": "SL-03-AC-CO-02",
              "legacyId": "1dahci5-1hdsqk8",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g21",
                  "g04",
                  "g06",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g10",
                  "g02",
                  "g03",
                  "g04",
                  "g11",
                  "g05",
                  "g06",
                  "g07",
                  "g12",
                  "g13",
                  "g14",
                  "g15",
                  "g16",
                  "g17",
                  "g18",
                  "g19"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g20",
                  "g21",
                  "g22"
                ],
                "g05": [
                  "g23",
                  "g24"
                ]
              },
              "yaho": [
                "해결 동기 및 목적, 데이터의 수집 및 관리, 분석 방법 및 과정",
                "결과 해석 등 일련의 수행 과정을 보고서, 포트폴리오 등으로 누적하도록 하고",
                "가치 있는 데이터를 선택하였는지, 데이터 유형에 따라 적절한 방법을 선택하여",
                "목적에 맞게 가공하였는지, 올바른 시각화 방법을 선택하였는지",
                "결과 해석이 분석 데이터를 토대로 객관적으로 도출되었는지 등을 종합적으로 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              }
            }
          ]
        }
      ]
    },
    "모의 실험하는 소프트웨어": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "실제와 비슷한 모형을 소프트웨어로 구현한 시뮬레이션은 복잡한 문제나 현상의 원리를 탐구하고 개념을 이해하는 데 도움을 준다.",
              "easy": [
                "실제와 비슷한 모형",
                "소프트웨어",
                "시뮬레이션",
                "현상"
              ],
              "normal": [
                "실제와 비슷한 모형",
                "소프트웨어",
                "시뮬레이션",
                "복잡한 문제",
                "현상",
                "원리",
                "탐구",
                "개념",
                "이해"
              ],
              "id": "SL-04-CS-KI-01",
              "legacyId": "19een0-1grwt48",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g07",
                  "g02",
                  "g03",
                  "g05"
                ],
                "normal": [
                  "g07",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g08",
                  "g09",
                  "g10"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g11",
                  "g12"
                ]
              }
            },
            {
              "text": "소프트웨어 시뮬레이션을 통해 실세계에서 실행하기에 어렵거나 불가능한 대상을 모의적으로 실행한다.",
              "easy": [
                "소프트웨어 시뮬레이션",
                "실행하기에 어렵거나",
                "불가능한"
              ],
              "normal": [
                "소프트웨어 시뮬레이션",
                "실세계",
                "실행하기에 어렵거나",
                "불가능한 대상",
                "모의적으로 실행"
              ],
              "id": "SL-04-CS-KI-02",
              "legacyId": "19een0-1i06uny",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g03",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ],
                "g04": [
                  "g08",
                  "g09"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "시뮬레이션의 개념과 구성요소",
              "easy": [
                "시뮬레이션",
                "개념",
                "구성요소"
              ],
              "normal": [
                "시뮬레이션",
                "개념",
                "구성요소"
              ],
              "id": "SL-04-CS-KN-01",
              "legacyId": "1gji2b-mck8s4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "시뮬레이션 활용 분야",
              "easy": [
                "시뮬레이션",
                "활용 분야"
              ],
              "normal": [
                "시뮬레이션",
                "활용 분야"
              ],
              "id": "SL-04-CS-KN-02",
              "legacyId": "1gji2b-1na58lq",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "시뮬레이션 모델",
              "easy": [
                "시뮬레이션 모델"
              ],
              "normal": [
                "시뮬레이션 모델"
              ],
              "id": "SL-04-CS-KN-03",
              "legacyId": "1gji2b-1qtl2ld",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01"
                ],
                "normal": [
                  "g01"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "시뮬레이션 프로그램 활용하기",
              "easy": [
                "시뮬레이션 프로그램",
                "활용"
              ],
              "normal": [
                "시뮬레이션 프로그램",
                "활용"
              ],
              "id": "SL-04-CS-PF-01",
              "legacyId": "1eyoxrk-1lej3x8",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "시뮬레이션 모델 구성하기",
              "easy": [
                "시뮬레이션 모델",
                "구성"
              ],
              "normal": [
                "시뮬레이션 모델",
                "구성"
              ],
              "id": "SL-04-CS-PF-02",
              "legacyId": "1eyoxrk-1jezmkc",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "시뮬레이션을 위한 소프트웨어 구현하기",
              "easy": [
                "시뮬레이션",
                "소프트웨어"
              ],
              "normal": [
                "시뮬레이션",
                "소프트웨어",
                "구현"
              ],
              "id": "SL-04-CS-PF-03",
              "legacyId": "1eyoxrk-1ygw4xd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "시뮬레이션의 가치 인식",
              "easy": [
                "시뮬레이션",
                "가치"
              ],
              "normal": [
                "시뮬레이션",
                "가치",
                "인식"
              ],
              "id": "SL-04-CS-VA-01",
              "legacyId": "j8myzy-11f2a2y",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "소프트웨어를 활용한 현실 세계 모델링에 적극적으로 도전하는 태도",
              "easy": [
                "현실 세계",
                "모델링"
              ],
              "normal": [
                "소프트웨어",
                "현실 세계 모델링",
                "적극적으로 도전",
                "태도"
              ],
              "id": "SL-04-CS-VA-02",
              "legacyId": "j8myzy-ujbau8",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g06",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12소생04-01] 시뮬레이션 프로그램의 개념과 구성요소를 이해하고 가치를 파악한다.",
              "easy": [
                "시뮬레이션 프로그램",
                "개념",
                "구성요소"
              ],
              "normal": [
                "시뮬레이션 프로그램",
                "개념",
                "구성요소",
                "이해",
                "가치",
                "파악"
              ],
              "aliases": {},
              "id": "SL-04-AC-ST-01",
              "legacyId": "1rmtuks-1q7i1o3",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12소생04-02] 다양한 시뮬레이션 프로그램의 활용 분야를 탐색하고 활용 방안을 구상한다.",
              "easy": [
                "시뮬레이션 프로그램",
                "활용 분야",
                "방안"
              ],
              "normal": [
                "시뮬레이션 프로그램",
                "활용 분야",
                "탐색",
                "활용 방안",
                "구상"
              ],
              "aliases": {},
              "id": "SL-04-AC-ST-02",
              "legacyId": "1rmtuks-9lw4go",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "[12소생04-03] 시뮬레이션 프로그램 구성 방법에 따라 복잡한 문제나 현상의 원리를 시뮬레이션 모델로 표현한다.",
              "easy": [
                "시뮬레이션 프로그램",
                "현상",
                "원리",
                "시뮬레이션 모델"
              ],
              "normal": [
                "시뮬레이션 프로그램",
                "구성 방법",
                "복잡한 문제",
                "현상",
                "원리",
                "시뮬레이션 모델",
                "표현"
              ],
              "aliases": {},
              "id": "SL-04-AC-ST-03",
              "legacyId": "1rmtuks-2x9rdz",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "[12소생04-04] 소프트웨어를 적극적으로 활용하여 시뮬레이션 모델을 구현한다.",
              "easy": [
                "소프트웨어",
                "시뮬레이션 모델",
                "구현"
              ],
              "normal": [
                "소프트웨어",
                "적극적으로 활용",
                "시뮬레이션 모델",
                "구현"
              ],
              "aliases": {},
              "id": "SL-04-AC-ST-04",
              "legacyId": "1rmtuks-1tfkc0a",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12소생04-01] 시뮬레이션 프로그램 제작을 위해 화면 구성, 구현 기능 등의 요소를 파악하고 시뮬레이션의 실제적 활용을 통해 시뮬레이션의 필요성과 역할을 인식할 수 있어야 한다.",
              "easy": [
                "시뮬레이션 프로그램",
                "화면",
                "구현 기능",
                "필요성",
                "역할"
              ],
              "normal": [
                "시뮬레이션 프로그램",
                "제작",
                "화면 구성",
                "구현 기능",
                "요소",
                "실제적 활용",
                "필요성",
                "역할",
                "인식"
              ],
              "aliases": {},
              "id": "SL-04-AC-EX-01",
              "legacyId": "1ykpcgs-of0l2i",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g10",
                  "g03",
                  "g04",
                  "g05"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g02",
                  "g03",
                  "g07",
                  "g08",
                  "g04",
                  "g05",
                  "g09"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g10",
                  "g11"
                ],
                "g03": [
                  "g12",
                  "g13"
                ]
              }
            },
            {
              "text": "[12소생04-02] 예측, 실험, 게임 등 다양한 분야에서 시뮬레이션 프로그램이 활용된 목적과 방법을 바탕으로 구현하려는 시뮬레이션의 화면 및 기능을 계획할 수 있어야 한다.",
              "easy": [
                "예측",
                "실험",
                "게임",
                "시뮬레이션 프로그램",
                "화면"
              ],
              "normal": [
                "예측",
                "실험",
                "게임",
                "다양한 분야",
                "시뮬레이션 프로그램",
                "시뮬레이션",
                "목적",
                "방법",
                "화면",
                "기능",
                "계획"
              ],
              "aliases": {},
              "id": "SL-04-AC-EX-02",
              "legacyId": "1ykpcgs-1hebjic",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g07"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g04",
                  "g10",
                  "g05",
                  "g06",
                  "g07",
                  "g08",
                  "g11"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "수학적 원리, 과학적 현상, 항공우주 등 다양한 학문 분야의 현상이나 원리를 탐구하거나, 운전, 길찾기, 가상현실 등 실생활에서 활용되는 다양한 사례에서 시뮬레이션 프로그램의 역할을 분석하여 시뮬레이션의 필요성을 인식하도록 한다. 이 과정에서 시뮬레이션 프로그램의 활용이 현실의 자원 사용을 절약하게 함으로써 궁극적으로 지속가능한 발전에도 기여할 수 있음을 안내하도록 한다.",
              "easy": [
                "수학적 원리",
                "과학적 현상",
                "항공우주",
                "운전",
                "길찾기",
                "가상현실"
              ],
              "normal": [
                "수학적 원리",
                "원리",
                "과학적 현상",
                "현상",
                "항공우주",
                "학문 분야",
                "운전",
                "길찾기",
                "가상현실",
                "사례",
                "시뮬레이션 프로그램",
                "역할",
                "필요성",
                "현실의 자원 사용",
                "절약",
                "지속가능한 발전",
                "기여"
              ],
              "aliases": {},
              "id": "SL-04-AC-CO-01",
              "legacyId": "1dahci5-15zka0y",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "normal": [
                  "g01",
                  "g13",
                  "g02",
                  "g12",
                  "g03",
                  "g11",
                  "g04",
                  "g05",
                  "g06",
                  "g14",
                  "g07",
                  "g15",
                  "g08",
                  "g16",
                  "g17",
                  "g10",
                  "g18"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05"
                ]
              },
              "coreSplitMigrations": {
                "g09": [
                  "g19",
                  "g20"
                ]
              },
              "yaho": [
                "항공우주 등 다양한 학문 분야의 현상이나 원리를 탐구하거나, 운전, 길찾기",
                "가상현실 등 실생활에서 활용되는 다양한 사례에서 시뮬레이션 프로그램의 역할을 분석하여",
                "시뮬레이션의 필요성을 인식하도록 한다",
                "이 과정에서 시뮬레이션 프로그램의 활용이 현실의 자원 사용을 절약하게 함으로써",
                "궁극적으로 지속가능한 발전에도 기여할 수 있음을 안내하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ],
                "y02": [
                  "y66-04",
                  "y66-05"
                ]
              }
            },
            {
              "text": "목적에 맞는 시뮬레이션 모델을 설계하여 현상이나 원리를 탐구하는 시뮬레이션을 오류 없이 구현하였는지, 시뮬레이션 프로그램의 목표에 부합하도록 기능이 수행되는지 등을 평가하도록 한다.",
              "easy": [
                "시뮬레이션 모델",
                "현상",
                "오류 없이 구현",
                "시뮬레이션 프로그램",
                "목표"
              ],
              "normal": [
                "목적",
                "시뮬레이션 모델",
                "시뮬레이션",
                "설계",
                "현상",
                "원리",
                "탐구",
                "오류 없이 구현",
                "시뮬레이션 프로그램",
                "목표",
                "기능",
                "수행",
                "평가"
              ],
              "aliases": {},
              "id": "SL-04-AC-CO-02",
              "legacyId": "1dahci5-nchobg",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03",
                  "g12",
                  "g07",
                  "g08"
                ],
                "normal": [
                  "g10",
                  "g01",
                  "g05",
                  "g02",
                  "g03",
                  "g04",
                  "g11",
                  "g12",
                  "g07",
                  "g08",
                  "g09",
                  "g13",
                  "g14"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "yaho": [
                "목적에 맞는 시뮬레이션 모델을 설계하여",
                "현상이나 원리를 탐구하는 시뮬레이션을 오류 없이 구현하였는지",
                "시뮬레이션 프로그램의 목표에 부합하도록 기능이 수행되는지 등을 평가하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "최소 성취수준을 보장하기 위하여 시뮬레이션 프로그램을 제작하지 못하더라도 시뮬레이션이 활용될 수 있는 다양한 아이디어를 도출하도록 하고 아이디어를 실제로 구현하는 데 필요한 기술적인 방안에 대해 고민할 수 있는 학습 과정을 제공하도록 한다.",
              "easy": [
                "최소 성취수준",
                "시뮬레이션 프로그램",
                "아이디어",
                "기술적인"
              ],
              "normal": [
                "최소 성취수준",
                "시뮬레이션 프로그램",
                "제작",
                "활용",
                "아이디어",
                "도출",
                "실제로 구현",
                "기술적인 방안",
                "학습 과정"
              ],
              "aliases": {},
              "id": "SL-04-AC-CO-03",
              "legacyId": "1dahci5-zekl19",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g05",
                  "g06",
                  "g03",
                  "g07",
                  "g08",
                  "g04",
                  "g09"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g10",
                  "g11"
                ]
              },
              "yaho": [
                "시뮬레이션 프로그램을 제작하지 못하더라도 시뮬레이션이 활용될 수 있는 다양한",
                "아이디어를 도출하도록 하고 아이디어를 실제로 구현하는 데 필요한",
                "기술적인 방안에 대해 고민할 수 있는 학습 과정을 제공하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        }
      ]
    },
    "가치를 창출하는 소프트웨어": {
      "content-system": [
        {
          "title": "핵심 아이디어",
          "lines": [
            {
              "text": "소프트웨어 스타트업은 창의적인 아이디어를 실제로 구현하고 사회적·경제적 가치를 창출한다.",
              "easy": [
                "소프트웨어 스타트업",
                "창의적인 아이디어",
                "사회적·경제적 가치"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "창의적인 아이디어",
                "실제로 구현",
                "사회적·경제적 가치",
                "창출"
              ],
              "id": "SL-05-CS-KI-01",
              "legacyId": "19een0-1wq5ofn",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g04",
                  "g03",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g02": [
                  "g06",
                  "g07"
                ],
                "g03": [
                  "g08",
                  "g09"
                ]
              }
            },
            {
              "text": "소프트웨어 스타트업 프로젝트는 윤리적이고 협력적인 문제 해결 과정이 필요하다.",
              "easy": [
                "소프트웨어 스타트업",
                "윤리적이고 협력적인",
                "문제 해결 과정"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "프로젝트",
                "윤리적이고 협력적인",
                "윤리적",
                "협력적인",
                "문제 해결 과정",
                "필요"
              ],
              "id": "SL-05-CS-KI-02",
              "legacyId": "19een0-174kuhe",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g05",
                  "c66-dd0ec0e2",
                  "g10"
                ],
                "normal": [
                  "g05",
                  "g06",
                  "n66-dd0ec0e2",
                  "g02",
                  "g07",
                  "g10",
                  "g04"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ],
                "g03": [
                  "g07",
                  "g08",
                  "g09"
                ]
              },
              "normalSplitMigrations": {
                "g01": [
                  "g05",
                  "g06"
                ],
                "g03": [
                  "g07",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "지식·이해",
          "lines": [
            {
              "text": "소프트웨어 스타트업의 개념",
              "easy": [
                "소프트웨어 스타트업",
                "개념"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "개념"
              ],
              "id": "SL-05-CS-KN-01",
              "legacyId": "1gji2b-1yiozsy",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "소프트웨어 스타트업 프로젝트",
              "easy": [
                "소프트웨어 스타트업",
                "프로젝트"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "프로젝트"
              ],
              "id": "SL-05-CS-KN-02",
              "legacyId": "1gji2b-rzcdef",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              },
              "normalSplitMigrations": {
                "g01": [
                  "g02",
                  "g03"
                ]
              }
            }
          ]
        },
        {
          "title": "과정·기능",
          "lines": [
            {
              "text": "소프트웨어 스타트업 사례 탐색하기",
              "easy": [
                "소프트웨어 스타트업",
                "탐색"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "사례",
                "탐색"
              ],
              "id": "SL-05-CS-PF-01",
              "legacyId": "1eyoxrk-jcuk3p",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "사용자의 요구 분석하기",
              "easy": [
                "사용자",
                "요구"
              ],
              "normal": [
                "사용자",
                "요구",
                "분석"
              ],
              "id": "SL-05-CS-PF-02",
              "legacyId": "1eyoxrk-1800dn5",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "스타트업 아이디어 표현하기",
              "easy": [
                "스타트업",
                "아이디어",
                "표현"
              ],
              "normal": [
                "스타트업 아이디어",
                "표현"
              ],
              "id": "SL-05-CS-PF-03",
              "legacyId": "1eyoxrk-1dae2wi",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g03",
                  "g04"
                ]
              }
            },
            {
              "text": "스타트업 프로젝트에 적합한 소프트웨어 구현하기",
              "easy": [
                "적합한 소프트웨어",
                "구현"
              ],
              "normal": [
                "스타트업 프로젝트",
                "적합한 소프트웨어",
                "구현"
              ],
              "id": "SL-05-CS-PF-04",
              "legacyId": "1eyoxrk-1p499id",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g04",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        },
        {
          "title": "가치·태도",
          "lines": [
            {
              "text": "소프트웨어와 융합을 통해 새로운 가치를 창출하는 자세",
              "easy": [
                "소프트웨어",
                "융합"
              ],
              "normal": [
                "소프트웨어",
                "융합",
                "새로운 가치",
                "창출",
                "자세"
              ],
              "id": "SL-05-CS-VA-01",
              "legacyId": "j8myzy-atbhzj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g06",
                  "g07"
                ]
              }
            },
            {
              "text": "협력적으로 문제를 해결하고 공유하는 태도",
              "easy": [
                "협력적으로",
                "공유"
              ],
              "normal": [
                "협력적으로",
                "문제",
                "해결",
                "공유",
                "태도"
              ],
              "id": "SL-05-CS-VA-02",
              "legacyId": "j8myzy-erszfd",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g04"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "개발한 소프트웨어의 가치에 대한 성찰",
              "easy": [
                "개발한 소프트웨어",
                "성찰"
              ],
              "normal": [
                "개발한 소프트웨어",
                "가치",
                "성찰"
              ],
              "id": "SL-05-CS-VA-03",
              "legacyId": "j8myzy-1ura9m8",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g04",
                  "g03"
                ],
                "normal": [
                  "g04",
                  "g02",
                  "g03"
                ],
                "yaho": [
                  "y01"
                ]
              }
            }
          ]
        }
      ],
      "achievement": [
        {
          "title": "성취기준",
          "lines": [
            {
              "text": "[12소생05-01] 소프트웨어 스타트업의 개념을 이해하고 새로운 가치를 창출하는 소프트웨어 스타트업 사례를 분석한다.",
              "easy": [
                "소프트웨어 스타트업",
                "개념",
                "새로운 가치"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "개념",
                "새로운 가치",
                "창출",
                "사례",
                "분석"
              ],
              "aliases": {},
              "id": "SL-05-AC-ST-01",
              "legacyId": "1rmtuks-1mplyve",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g02",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g05",
                  "g04",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g03": [
                  "g07",
                  "g08"
                ]
              }
            },
            {
              "text": "[12소생05-02] 소프트웨어 스타트업 프로젝트의 수행 과정을 이해하고 사용자 요구를 분석하여 소프트웨어 스타트업 아이디어를 구안한다.",
              "easy": [
                "소프트웨어 스타트업",
                "수행 과정",
                "사용자 요구",
                "아이디어"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "프로젝트",
                "수행 과정",
                "사용자 요구",
                "분석",
                "아이디어",
                "구안"
              ],
              "aliases": {},
              "id": "SL-05-AC-ST-02",
              "legacyId": "1rmtuks-gsn4wk",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g08",
                  "g02",
                  "g03",
                  "g11"
                ],
                "normal": [
                  "g08",
                  "g09",
                  "g02",
                  "g03",
                  "g05",
                  "g11",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g08",
                  "g09"
                ],
                "g04": [
                  "g10",
                  "g11"
                ]
              },
              "normalSplitMigrations": {
                "g01": [
                  "g08",
                  "g09"
                ],
                "g06": [
                  "g08",
                  "g11"
                ]
              }
            },
            {
              "text": "[12소생05-03] 스타트업 프로젝트에 적합한 소프트웨어를 협력적으로 설계하고 구현한다.",
              "easy": [
                "스타트업 프로젝트",
                "적합한 소프트웨어",
                "협력적으로"
              ],
              "normal": [
                "스타트업 프로젝트",
                "적합한 소프트웨어",
                "협력적으로",
                "설계",
                "구현"
              ],
              "aliases": {},
              "id": "SL-05-AC-ST-03",
              "legacyId": "1rmtuks-1jc5mnj",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g01",
                  "g06",
                  "g03"
                ],
                "normal": [
                  "g01",
                  "g06",
                  "g03",
                  "g04",
                  "g05"
                ],
                "yaho": [
                  "y01"
                ]
              }
            },
            {
              "text": "[12소생05-04] 개발한 소프트웨어의 가치를 사회적, 기능적, 윤리적 관점에서 평가한다.",
              "easy": [
                "사회적",
                "기능적",
                "윤리적",
                "관점"
              ],
              "normal": [
                "개발한 소프트웨어",
                "가치",
                "사회적",
                "기능적",
                "윤리적 관점",
                "평가"
              ],
              "aliases": {},
              "id": "SL-05-AC-ST-04",
              "legacyId": "1rmtuks-13oui74",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g03",
                  "g04",
                  "g09",
                  "g10"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g06"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g07",
                  "g08"
                ],
                "g05": [
                  "g09",
                  "g10"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 해설",
          "lines": [
            {
              "text": "[12소생05-01] 창업과 스타트업의 차이를 파악하고 소프트웨어 스타트업의 성공 사례와 실패 사례를 바탕으로 스타트업 프로젝트 기획 방법, 스타트업 운영 시 고려 사항 등을 분석할 수 있어야 한다.",
              "easy": [
                "성공",
                "실패",
                "스타트업 프로젝트",
                "기획",
                "스타트업 운영",
                "고려",
                "사항"
              ],
              "normal": [
                "창업",
                "스타트업",
                "차이",
                "소프트웨어 스타트업",
                "성공 사례",
                "실패 사례",
                "스타트업 프로젝트",
                "기획 방법",
                "스타트업 운영",
                "고려 사항",
                "분석"
              ],
              "aliases": {},
              "id": "SL-05-AC-EX-01",
              "legacyId": "1ykpcgs-3j4bp4",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g13",
                  "g15",
                  "g10",
                  "g16",
                  "g11",
                  "g18",
                  "g19"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g09",
                  "g04",
                  "g05",
                  "g10",
                  "g06",
                  "g11",
                  "g08",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g04": [
                  "g13",
                  "g14"
                ],
                "g05": [
                  "g15",
                  "g14"
                ],
                "g06": [
                  "g16",
                  "g17"
                ],
                "g08": [
                  "g18",
                  "g19"
                ]
              },
              "yaho": [
                "창업과 스타트업의 차이를 파악하고",
                "소프트웨어 스타트업의 성공 사례와 실패 사례를 바탕으로 스타트업 프로젝트 기획 방법",
                "스타트업 운영 시 고려 사항 등을 분석할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "[12소생05-02] 사용자 요구 분석을 통한 주제 선정, 해결 아이디어 구안, 소프트웨어 설계 및 제작, 소프트웨어 평가의 절차로 수행되는 소프트웨어 스타트업 프로젝트의 수행 과정을 이해하고 적용할 수 있어야 한다.",
              "easy": [
                "주제 선정",
                "아이디어",
                "소프트웨어 설계",
                "제작",
                "소프트웨어 평가"
              ],
              "normal": [
                "사용자 요구 분석",
                "주제 선정",
                "해결 아이디어",
                "소프트웨어 설계",
                "제작",
                "소프트웨어 평가",
                "절차",
                "소프트웨어 스타트업",
                "프로젝트",
                "수행 과정",
                "이해",
                "적용"
              ],
              "aliases": {},
              "id": "SL-05-AC-EX-02",
              "legacyId": "1ykpcgs-2bo6m1",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g02",
                  "g16",
                  "g04",
                  "g05",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g02",
                  "g03",
                  "g04",
                  "g05",
                  "g08",
                  "g09",
                  "g19",
                  "g20",
                  "g10",
                  "g11",
                  "g12"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g13",
                  "g14"
                ],
                "g03": [
                  "g15",
                  "g16"
                ],
                "g04": [
                  "g17",
                  "g18"
                ],
                "g07": [
                  "g19",
                  "g20"
                ]
              },
              "normalSplitMigrations": {
                "g07": [
                  "g19",
                  "g20"
                ]
              },
              "yaho": [
                "주제 선정, 해결 아이디어 구안, 소프트웨어 설계 및 제작",
                "소프트웨어 평가의 절차로 수행되는 소프트웨어 스타트업 프로젝트의 수행 과정을 이해하고",
                "적용할 수 있어야 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            }
          ]
        },
        {
          "title": "성취기준 적용 시 고려 사항",
          "lines": [
            {
              "text": "소프트웨어 스타트업 프로젝트를 협력적으로 수행할 수 있도록 활동을 구성하고 수행 과정에서 구성원의 적극적 참여를 유도하기 위해 프로젝트 계획 단계에서 구성원의 임무와 역할을 명확히 분담하도록 하여 민주적으로 논의할 수 있는 환경을 조성하도록 한다.",
              "easy": [
                "소프트웨어 스타트업",
                "협력적으로",
                "적극적",
                "참여",
                "민주적으로"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "프로젝트",
                "협력적으로",
                "구성원",
                "적극적 참여",
                "프로젝트 계획",
                "임무",
                "역할",
                "분담",
                "민주적으로 논의",
                "환경"
              ],
              "aliases": {},
              "id": "SL-05-AC-CO-01",
              "legacyId": "1dahci5-w48ktz",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g11",
                  "g02",
                  "g13",
                  "g14",
                  "g15"
                ],
                "normal": [
                  "g11",
                  "g12",
                  "g02",
                  "g07",
                  "g03",
                  "g08",
                  "g04",
                  "g05",
                  "g09",
                  "g06",
                  "g10"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g11",
                  "g12"
                ],
                "g03": [
                  "g13",
                  "g14"
                ],
                "g06": [
                  "g15",
                  "g16"
                ]
              },
              "normalSplitMigrations": {
                "g01": [
                  "g11",
                  "g12"
                ]
              },
              "yaho": [
                "협력적으로 수행할 수 있도록 활동을 구성하고 수행 과정에서 구성원의 적극적 참여를 유도하기 위해",
                "프로젝트 계획 단계에서 구성원의 임무와 역할을 명확히 분담하도록 하여",
                "민주적으로 논의할 수 있는 환경을 조성하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03"
                ]
              }
            },
            {
              "text": "소프트웨어 스타트업 프로젝트의 주제 선정 시 사회적 필요성과 가치 등을 고려하여 실생활, 교과 내·교과 간 내용을 융합할 수 있는 주제를 선정하도록 한다.",
              "easy": [
                "소프트웨어 스타트업",
                "주제 선정",
                "교과 내",
                "교과 간",
                "융합"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "프로젝트",
                "주제 선정",
                "주제",
                "사회적 필요성",
                "가치",
                "실생활",
                "교과 내·교과 간",
                "융합"
              ],
              "aliases": {},
              "id": "SL-05-AC-CO-02",
              "legacyId": "1dahci5-j3cmti",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g09",
                  "g02",
                  "g13",
                  "g14",
                  "g07"
                ],
                "normal": [
                  "g09",
                  "g10",
                  "g02",
                  "g08",
                  "g03",
                  "g04",
                  "g05",
                  "g06",
                  "g07"
                ],
                "yaho": [
                  "y01"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g09",
                  "g10"
                ],
                "g03": [
                  "g11",
                  "g12"
                ],
                "g06": [
                  "g13",
                  "g14"
                ]
              },
              "normalSplitMigrations": {
                "g01": [
                  "g09",
                  "g10"
                ]
              }
            },
            {
              "text": "융합 문제 해결을 위한 소프트웨어 스타트업 프로젝트 수행 시 관찰 및 포트폴리오 평가를 통해 프로그래밍으로 해결 가능한 주제를 스스로 선정하였는지, 창의적 문제 해결 아이디어를 고안하였는지, 문제 해결에 적합한 알고리즘을 설계하고 프로그램으로 구현하였는지 등을 종합적으로 평가한다. 협력적 프로젝트의 수행 과정을 평가할 때는 학습자 간 유의미한 상호 작용이 이루어졌는지, 구성원 각자의 역할을 책임감 있게 수행하였는지 등을 종합적으로 고려하도록 한다.",
              "easy": [
                "융합",
                "문제 해결",
                "소프트웨어 스타트업",
                "포트폴리오 평가",
                "창의적",
                "아이디어",
                "협력적 프로젝트"
              ],
              "normal": [
                "융합 문제 해결",
                "문제 해결",
                "소프트웨어 스타트업",
                "프로젝트",
                "수행",
                "관찰",
                "포트폴리오 평가",
                "프로그래밍",
                "주제",
                "선정",
                "창의적",
                "문제 해결 아이디어",
                "알고리즘",
                "설계",
                "프로그램",
                "구현",
                "종합적으로 평가",
                "협력적 프로젝트",
                "상호 작용",
                "역할",
                "책임감"
              ],
              "aliases": {},
              "id": "SL-05-AC-CO-03",
              "legacyId": "1dahci5-1jq3e7x",
              "sourceDoc": "교육부 고시 제2022-33호 [별책10] 실과(기술·가정)/정보과 교육과정",
              "gapIds": {
                "easy": [
                  "g20",
                  "g21",
                  "g22",
                  "g13",
                  "g24",
                  "g25",
                  "g08"
                ],
                "normal": [
                  "g01",
                  "g21",
                  "g22",
                  "g23",
                  "g19",
                  "g12",
                  "g13",
                  "g04",
                  "g14",
                  "g15",
                  "g24",
                  "g26",
                  "g06",
                  "g16",
                  "g07",
                  "g17",
                  "g18",
                  "g08",
                  "g09",
                  "g10",
                  "g11"
                ],
                "yaho": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04",
                  "y66-05",
                  "y66-06"
                ]
              },
              "coreSplitMigrations": {
                "g01": [
                  "g20",
                  "g21"
                ],
                "g02": [
                  "g22",
                  "g23"
                ],
                "g05": [
                  "g24",
                  "g21",
                  "g25"
                ]
              },
              "normalSplitMigrations": {
                "g02": [
                  "g22",
                  "g23"
                ],
                "g05": [
                  "g24",
                  "g26"
                ]
              },
              "yaho": [
                "소프트웨어 스타트업 프로젝트 수행 시 관찰 및 포트폴리오 평가를 통해",
                "프로그래밍으로 해결 가능한 주제를 스스로 선정하였는지",
                "창의적 문제 해결 아이디어를 고안하였는지, 문제 해결에 적합한 알고리즘을 설계하고",
                "프로그램으로 구현하였는지 등을 종합적으로 평가한다",
                "협력적 프로젝트의 수행 과정을 평가할 때는 학습자 간 유의미한 상호 작용이 이루어졌는지",
                "구성원 각자의 역할을 책임감 있게 수행하였는지 등을 종합적으로 고려하도록 한다"
              ],
              "yahoSplitMigrations": {
                "y01": [
                  "y66-01",
                  "y66-02",
                  "y66-03",
                  "y66-04"
                ],
                "y02": [
                  "y66-05",
                  "y66-06"
                ]
              }
            }
          ]
        }
      ]
    },
    "과목 공통": {
      "character-goal": [
        {
          "title": "성격",
          "lines": [
            {
              "id": "SL-CG-CHAR-01",
              "text": "‘소프트웨어와 생활’은 소프트웨어에 대한 기본 개념과 원리를 실생활 및 다양한 학문 분야의 문제 해결에 융합적이고 협력적으로 적용하는 과정을 경험할 수 있게 한다.",
              "easy": [
                "기본 개념과 원리",
                "융합적이고 협력적으로 적용"
              ],
              "normal": [
                "기본 개념과 원리",
                "융합적이고 협력적으로 적용",
                "실생활 및 다양한 학문 분야"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1oiccvm",
                  "g-13df3vo"
                ],
                "normal": [
                  "g-1oiccvm",
                  "g-13df3vo",
                  "g-yuncxc"
                ]
              }
            },
            {
              "id": "SL-CG-CHAR-02",
              "text": "학생들은 소프트웨어와 각 분야와의 융합에 대한 가치와 중요성을 인식하고, 소프트웨어를 적용한 표현 및 데이터 분석과 활용, 소프트웨어를 통한 시뮬레이션 구현 등을 경험함으로써 실생활 및 다양한 학문 분야의 문제를 융합적이고 창의적으로 해결하는 능력을 갖춘 디지털 민주시민으로 성장하게 된다.",
              "easy": [
                "융합에 대한 가치와 중요성",
                "데이터 분석과 활용",
                "시뮬레이션 구현",
                "융합적이고 창의적으로 해결"
              ],
              "normal": [
                "융합에 대한 가치와 중요성",
                "데이터 분석과 활용",
                "시뮬레이션 구현",
                "융합적이고 창의적으로 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-11i5r5r",
                  "g-qyqc7h",
                  "g-9itk5x",
                  "g-14p7k5e"
                ],
                "normal": [
                  "g-11i5r5r",
                  "g-qyqc7h",
                  "g-9itk5x",
                  "g-14p7k5e"
                ]
              }
            },
            {
              "id": "SL-CG-CHAR-03",
              "text": "또한, 서로 다른 분야의 융합, 융합을 통한 창의적 문제 해결의 경험을 기반으로 소프트웨어를 활용한 문제 해결의 중요성을 체득하고, 다양한 분야의 진로를 탐색하게 된다.",
              "easy": [
                "서로 다른 분야의 융합",
                "창의적 문제 해결",
                "진로를 탐색"
              ],
              "normal": [
                "서로 다른 분야의 융합",
                "창의적 문제 해결",
                "진로를 탐색"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-skqt3q",
                  "g-7n8dsc",
                  "g-evob3j"
                ],
                "normal": [
                  "g-skqt3q",
                  "g-7n8dsc",
                  "g-evob3j"
                ]
              }
            }
          ]
        },
        {
          "title": "목표",
          "lines": [
            {
              "id": "SL-CG-GOAL-00",
              "text": "‘소프트웨어와 생활’은 디지털 사회에서 실생활 및 다양한 학문 분야의 문제 해결에 융합되어 새로운 가치를 창출하는 소프트웨어의 가치와 필요성을 인식하고, 직면한 문제를 융합의 관점에서 효과적이고 창의적으로 해결하는 능력을 함양하여 사회에 기여할 수 있는 가치관과 태도를 기르는 데 중점을 둔다.",
              "easy": [
                "새로운 가치를 창출",
                "융합의 관점",
                "효과적이고 창의적으로 해결",
                "사회에 기여"
              ],
              "normal": [
                "새로운 가치를 창출",
                "융합의 관점",
                "효과적이고 창의적으로 해결",
                "사회에 기여"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1oawz9p",
                  "g-vt0ldm",
                  "g-1mhtve9",
                  "g-1fxaklo"
                ],
                "normal": [
                  "g-1oawz9p",
                  "g-vt0ldm",
                  "g-1mhtve9",
                  "g-1fxaklo"
                ]
              }
            },
            {
              "id": "SL-CG-GOAL-01",
              "text": "(1) 실생활이나 다양한 학문 분야에서 활용되는 소프트웨어의 가치와 필요성을 파악하고, 소프트웨어를 통해 해결 가능한 문제를 발견하기 위한 능력과 태도를 기른다.",
              "easy": [
                "소프트웨어의 가치와 필요성",
                "해결 가능한 문제를 발견"
              ],
              "normal": [
                "소프트웨어의 가치와 필요성",
                "해결 가능한 문제를 발견"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1ahj2cq",
                  "g-j78azg"
                ],
                "normal": [
                  "g-1ahj2cq",
                  "g-j78azg"
                ]
              }
            },
            {
              "id": "SL-CG-GOAL-02",
              "text": "(2) 소프트웨어와 하드웨어를 활용한 표현 방법에 대한 이해를 바탕으로, 생각이나 현상을 효과적으로 전달하는 데 적합한 방법을 선택하여 표현할 수 있는 능력을 기른다.",
              "easy": [
                "소프트웨어와 하드웨어",
                "적합한 방법을 선택",
                "표현"
              ],
              "normal": [
                "소프트웨어와 하드웨어",
                "적합한 방법을 선택",
                "표현"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-a1eau2",
                  "g-1vu2m8h",
                  "g-xh3ypu"
                ],
                "normal": [
                  "g-a1eau2",
                  "g-1vu2m8h",
                  "g-xh3ypu"
                ]
              }
            },
            {
              "id": "SL-CG-GOAL-03",
              "text": "(3) 사회 각 분야에서 발생하는 데이터를 목적에 맞게 수집·가공·분석하고, 그 의미를 소프트웨어와의 융합적인 관점에서 해석할 수 있는 능력을 함양한다.",
              "easy": [
                "수집·가공·분석",
                "융합적인 관점",
                "해석"
              ],
              "normal": [
                "수집·가공·분석",
                "융합적인 관점",
                "해석"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-11xjy2w",
                  "g-mluer4",
                  "g-v27lxs"
                ],
                "normal": [
                  "g-11xjy2w",
                  "g-mluer4",
                  "g-v27lxs"
                ]
              }
            },
            {
              "id": "SL-CG-GOAL-04",
              "text": "(4) 실생활이나 다양한 학문 분야의 문제를 해결하기 위한 소프트웨어 구현의 필요성을 인지하고, 시뮬레이션하여 프로그램을 구현 및 개선할 수 있는 능력을 기른다.",
              "easy": [
                "소프트웨어 구현의 필요성",
                "시뮬레이션",
                "구현 및 개선"
              ],
              "normal": [
                "소프트웨어 구현의 필요성",
                "시뮬레이션",
                "구현 및 개선"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-dr4tar",
                  "g-jhalkg",
                  "g-toev7z"
                ],
                "normal": [
                  "g-dr4tar",
                  "g-jhalkg",
                  "g-toev7z"
                ]
              }
            },
            {
              "id": "SL-CG-GOAL-05",
              "text": "(5) 소프트웨어 스타트업 사례를 탐색하고, 창의적인 아이디어를 바탕으로 사회에 기여할 수 있는 소프트웨어를 개발하는 프로젝트를 수행하는 능력과 태도를 기른다.",
              "easy": [
                "소프트웨어 스타트업",
                "창의적인 아이디어",
                "사회에 기여",
                "프로젝트"
              ],
              "normal": [
                "소프트웨어 스타트업",
                "창의적인 아이디어",
                "사회에 기여",
                "프로젝트"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-10411ry",
                  "g-7yjn4b",
                  "g-3zkmzd",
                  "g-31mkf4"
                ],
                "normal": [
                  "g-10411ry",
                  "g-7yjn4b",
                  "g-3zkmzd",
                  "g-31mkf4"
                ]
              }
            }
          ]
        }
      ],
      "teaching-evaluation": [
        {
          "title": "교수·학습의 방향",
          "lines": [
            {
              "id": "SL-TE-DIR-01",
              "text": "(마) ‘소프트웨어와 생활’ 과목의 교수·학습에서는 교과 간, 교과 내 영역 간의 연계성을 고려하여 학습 경험을 조직함으로써 융합적 사고력을 함양할 수 있도록 하며, 융합적 문제 해결이 단편적인 경험을 넘어 의미 있는 문제 해결이 되도록 함으로써 삶 속에서 학습의 전이가 일어날 수 있도록 한다.",
              "easy": [
                "교과 간, 교과 내 영역 간의 연계성",
                "융합적 사고력",
                "삶 속에서 학습의 전이"
              ],
              "normal": [
                "교과 간, 교과 내 영역 간의 연계성",
                "융합적 사고력",
                "삶 속에서 학습의 전이",
                "의미 있는 문제 해결"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1dvu8vt",
                  "g-kok2y2",
                  "g-v31ky1"
                ],
                "normal": [
                  "g-1dvu8vt",
                  "g-kok2y2",
                  "g-v31ky1",
                  "g-1nccpyo"
                ]
              }
            }
          ]
        },
        {
          "title": "교수·학습 방법",
          "lines": [
            {
              "id": "SL-TE-MET-01",
              "text": "(가) 교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, 디자인기반학습, 짝 프로그래밍, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다. 특히, ‘소프트웨어와 생활’ 과목은 전 영역에서 실생활 체험 및 응용을 위한 프로젝트 활동을 적극적으로 활용할 수 있다.",
              "easy": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습",
                "프로젝트 활동"
              ],
              "normal": [
                "문제기반학습",
                "프로젝트 기반학습",
                "디자인기반학습",
                "짝 프로그래밍",
                "탐구학습",
                "프로젝트 활동",
                "전 영역"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-b45pdv",
                  "g-1fulwce",
                  "g-1xbms5",
                  "g-1pjfawz",
                  "g-krhkfv",
                  "g-1fxpf77"
                ],
                "normal": [
                  "g-b45pdv",
                  "g-1fulwce",
                  "g-1xbms5",
                  "g-1pjfawz",
                  "g-krhkfv",
                  "g-1fxpf77",
                  "g-1yq1vfv"
                ]
              }
            },
            {
              "id": "SL-TE-MET-02",
              "text": "(마) 협업 프로젝트 활동에서 학습 과정과 결과를 쉽게 공유할 수 있도록 공유 문서, 메신저, 이메일 등 디지털 기술을 적극적으로 활용하고, 학습자 간 상호 소통할 때 언어 예절을 지키고 긍정적인 표현으로 소통하도록 안내한다.",
              "easy": [
                "공유 문서",
                "메신저",
                "이메일",
                "언어 예절",
                "긍정적인 표현"
              ],
              "normal": [
                "공유 문서",
                "메신저",
                "이메일",
                "언어 예절",
                "긍정적인 표현"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-a57nl5",
                  "g-10g20te",
                  "g-fmale2",
                  "g-n3mhoa",
                  "g-sqbe6b"
                ],
                "normal": [
                  "g-a57nl5",
                  "g-10g20te",
                  "g-fmale2",
                  "g-n3mhoa",
                  "g-sqbe6b"
                ]
              }
            }
          ]
        },
        {
          "title": "평가의 방향",
          "lines": [
            {
              "id": "SL-TE-EVD-01",
              "text": "(다) 구체적인 평가 루브릭을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
              "easy": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "normal": [
                "평가 루브릭",
                "학생과 함께 구성",
                "학습을 성찰"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1btrxvk",
                  "g-ddmj1j",
                  "g-w40xu9"
                ],
                "normal": [
                  "g-1btrxvk",
                  "g-ddmj1j",
                  "g-w40xu9"
                ]
              }
            },
            {
              "id": "SL-TE-EVD-02",
              "text": "(라) 효율적인 평가를 위하여 다양한 디지털 도구를 활용할 수 있으나 학생이 디지털 도구 활용의 미숙으로 인해 평가에 불이익을 받지 않도록 디지털 도구의 사용법을 익히는 데 부담을 최소화하거나 충분히 익힐 수 있는 기회를 제공하도록 한다.",
              "easy": [
                "디지털 도구",
                "평가에 불이익",
                "부담을 최소화",
                "충분히 익힐 수 있는 기회"
              ],
              "normal": [
                "디지털 도구",
                "평가에 불이익",
                "부담을 최소화",
                "충분히 익힐 수 있는 기회"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1cm6vfp",
                  "g-11icdff",
                  "g-1gf8gbb",
                  "g-1t34c4x"
                ],
                "normal": [
                  "g-1cm6vfp",
                  "g-11icdff",
                  "g-1gf8gbb",
                  "g-1t34c4x"
                ]
              }
            }
          ]
        },
        {
          "title": "평가 방법",
          "lines": [
            {
              "id": "SL-TE-EVM-01",
              "text": "(가) 성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 평가 포트폴리오를 계획한다. 예를 들면, 관찰 평가, 서술형평가, 수행평가 등을 활용하거나, 자기 평가, 동료 평가 등과 같은 다면적 평가를 실행한다.",
              "easy": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행평가",
                "자기 평가",
                "동료 평가"
              ],
              "normal": [
                "평가 포트폴리오",
                "관찰 평가",
                "서술형평가",
                "수행평가",
                "자기 평가",
                "동료 평가"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-8lpqh8",
                  "g-1jdpa0e",
                  "g-8a32rx",
                  "g-pozz63",
                  "g-1e5jtzy",
                  "g-1usl755"
                ],
                "normal": [
                  "g-8lpqh8",
                  "g-1jdpa0e",
                  "g-8a32rx",
                  "g-pozz63",
                  "g-1e5jtzy",
                  "g-1usl755"
                ]
              }
            },
            {
              "id": "SL-TE-EVM-02",
              "text": "(다) 모둠별 프로젝트 활동의 과정 및 성과물에 대해 전반적으로 평가할 뿐 아니라 협업 및 발표, 토론, 의사 소통, 협력적 태도 등을 합리적으로 평가할 수 있도록, 구체적이고 객관적인 평가기준과 체크리스트를 마련한다. 이 기준을 교사 평가뿐 아니라 자기 평가, 동료 평가를 위한 도구로 활용한다.",
              "easy": [
                "평가기준",
                "체크리스트",
                "교사 평가",
                "자기 평가",
                "동료 평가"
              ],
              "normal": [
                "평가기준",
                "체크리스트",
                "교사 평가",
                "자기 평가",
                "동료 평가",
                "과정 및 성과물"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1g4jgz3",
                  "g-1vl22i",
                  "g-130m5tb",
                  "g-1o504jn",
                  "g-58czb4"
                ],
                "normal": [
                  "g-1g4jgz3",
                  "g-1vl22i",
                  "g-130m5tb",
                  "g-1o504jn",
                  "g-58czb4",
                  "g-54zzvb"
                ]
              }
            },
            {
              "id": "SL-TE-EVM-03",
              "text": "(라) 토의·토론 평가 시 주장, 근거, 토의 결과를 통한 결론 등이 포함된 토의·토론 기록지를 활용하여 어떤 주장을 하고자 했는지, 객관적인 근거를 제시하였는지, 토론 후 생각 정리를 통해 어떤 결론을 내렸는지 등을 평가한다.",
              "easy": [
                "토의·토론 기록지",
                "주장",
                "근거",
                "결론"
              ],
              "normal": [
                "토의·토론 기록지",
                "주장",
                "근거",
                "결론"
              ],
              "aliases": {},
              "gapIds": {
                "easy": [
                  "g-1f1ijpx",
                  "g-10dhwkc",
                  "g-1fv3e9f",
                  "g-1d9vxz3"
                ],
                "normal": [
                  "g-1f1ijpx",
                  "g-10dhwkc",
                  "g-1fv3e9f",
                  "g-1d9vxz3"
                ]
              }
            }
          ]
        }
      ]
    }
  }
};
